{
  "created_at": "2025-05-03T14:34:32.591001+00:00",
  "elapsed": 0.17891,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:34:32.591001+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "2935",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:34:32 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Billie+Eilish&format=json&method=track.getInfo&track=Therefore+I+Am"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Billie+Eilish&format=json&method=track.getInfo&track=Therefore+I+Am",
  "_decoded_content": {
    "track": {
      "name": "therefore i am",
      "url": "https:\/\/www.last.fm\/music\/Billie+Eilish\/_\/therefore+i+am",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "958772",
      "playcount": "11450821",
      "artist": {
        "name": "Billie Eilish",
        "url": "https:\/\/www.last.fm\/music\/Billie+Eilish"
      },
      "toptags": {
        "tag": [
          {
            "name": "electropop",
            "url": "https:\/\/www.last.fm\/tag\/electropop"
          },
          {
            "name": "downtempo",
            "url": "https:\/\/www.last.fm\/tag\/downtempo"
          },
          {
            "name": "Jazz-Pop",
            "url": "https:\/\/www.last.fm\/tag\/Jazz-Pop"
          },
          {
            "name": "alternative rnb",
            "url": "https:\/\/www.last.fm\/tag\/alternative+rnb"
          },
          {
            "name": "2020",
            "url": "https:\/\/www.last.fm\/tag\/2020"
          }
        ]
      },
      "wiki": {
        "published": "22 Nov 2020, 08:27",
        "summary": "\"Therefore I Am\" is about Billie Eilish's disinterest in others' opinions of her and her refusal to be defined by what others say about her. The lyrics reflect a sense of self-confidence and assertiveness in response to someone who is trying to bring her down by talking about her behind her back. The line \"I think therefore I am\" alludes to the philosophical concept of Descartes' \"Cogito, ergo sum\" meaning \"I think, therefore I am\" and represents Billie's sense of self-awareness and independent thinking. <a href=\"http:\/\/www.last.fm\/music\/Billie+Eilish\/_\/therefore+i+am\">Read more on Last.fm<\/a>.",
        "content": "\"Therefore I Am\" is about Billie Eilish's disinterest in others' opinions of her and her refusal to be defined by what others say about her. The lyrics reflect a sense of self-confidence and assertiveness in response to someone who is trying to bring her down by talking about her behind her back. The line \"I think therefore I am\" alludes to the philosophical concept of Descartes' \"Cogito, ergo sum\" meaning \"I think, therefore I am\" and represents Billie's sense of self-awareness and independent thinking.\n\nThe song's chorus \"I'm not your friend or anything, damn \/ You think that you're the man \/ I think therefore I am\" emphasizes that she is not beholden to anyone's expectations or opinions of her. She will not let others define her or tell her how to think or act.\n\nThe last two stanzas convey Billie's disinterest in accolades, fame, and being in the public eye. The line \"I don't want press to put your name next to mine\" suggests that she doesn't want to be lumped together with people who don't share her values or way of life. The repetition of the line \"I'm sorry, I don't think I caught your name\" could be interpreted as her way of dismissing someone who she does not consider worth knowing or engaging with.\n\nOverall, \"Therefore I Am\" highlights Billie's sense of empowerment, self-awareness and independence, emphasizing the importance of being true to oneself and not letting others define us. <a href=\"http:\/\/www.last.fm\/music\/Billie+Eilish\/_\/therefore+i+am\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}