{
  "created_at": "2025-05-03T14:32:55.942549+00:00",
  "elapsed": 0.335137,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:32:55.942549+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5692",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:32:56 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Eminem&format=json&method=track.getInfo&track=Lose+Yourself"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Eminem&format=json&method=track.getInfo&track=Lose+Yourself",
  "_decoded_content": {
    "track": {
      "name": "Lose Yourself",
      "mbid": "f207eac0-829f-41e5-9dc9-d7c3263de3ed",
      "url": "https:\/\/www.last.fm\/music\/Eminem\/_\/Lose+Yourself",
      "duration": "274000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1591303",
      "playcount": "11229198",
      "artist": {
        "name": "Eminem",
        "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4",
        "url": "https:\/\/www.last.fm\/music\/Eminem"
      },
      "album": {
        "artist": "Eminem",
        "title": "Curtain Call: The Hits",
        "mbid": "5f7c0d23-58d9-4bdf-bfd9-e1e420b3ef29",
        "url": "https:\/\/www.last.fm\/music\/Eminem\/Curtain+Call:+The+Hits",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/0e4c959a450a45e89a95f65d2824d97d.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/0e4c959a450a45e89a95f65d2824d97d.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/0e4c959a450a45e89a95f65d2824d97d.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/0e4c959a450a45e89a95f65d2824d97d.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "6"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          },
          {
            "name": "Eminem",
            "url": "https:\/\/www.last.fm\/tag\/Eminem"
          },
          {
            "name": "hip hop",
            "url": "https:\/\/www.last.fm\/tag\/hip+hop"
          },
          {
            "name": "Soundtrack",
            "url": "https:\/\/www.last.fm\/tag\/Soundtrack"
          }
        ]
      },
      "wiki": {
        "published": "17 Jul 2008, 22:14",
        "summary": "\"Lose Yourself\" is an Academy-award-winning song featured in the film  8 Mile. According to Songfacts, on the movie set, Eminem had a trailer where he could record songs for the movie during breaks in filming. He wrote this in character as B. Rabbit, the film's protagonist.\n\n\"Lose Yourself\" was a commercial success, becoming Eminem's first Billboard Hot 100 number-one single and remaining there for twelve consecutive weeks. It reached atop of the charts in nineteen other countries. <a href=\"http:\/\/www.last.fm\/music\/Eminem\/_\/Lose+Yourself\">Read more on Last.fm<\/a>.",
        "content": "\"Lose Yourself\" is an Academy-award-winning song featured in the film  8 Mile. According to Songfacts, on the movie set, Eminem had a trailer where he could record songs for the movie during breaks in filming. He wrote this in character as B. Rabbit, the film's protagonist.\n\n\"Lose Yourself\" was a commercial success, becoming Eminem's first Billboard Hot 100 number-one single and remaining there for twelve consecutive weeks. It reached atop of the charts in nineteen other countries. \"Lose Yourself\" received acclaim from music critics, with many critics praising the song's inspiring, aggressive themes and describing it as Eminem's best work to date. Eminem's rapping ability, the lyrics and the production were also praised. In many retrospective reviews and lists, critics have cited the song among Eminem's finest, as well as one of the greatest hip-hop songs of all time.\n\nThe music video for the song, directed by Eminem, manager Paul Rosenberg and Phillip G. Atwell, was released on October 7, 2002. The video is a mixture of multiple scenarios, including scenes from and reminiscent of the movie 8 Mile, and Eminem rapping next to the \"8 Mile Rd. Mobile Court\" sign that appears on the cover of the movie's soundtrack. It received the MTV Video Music Award for Best Video from a Film.\n\n\"Lose Yourself\" won the Academy Award for Best Original Song, making it the first hip hop song to receive the award, and also won the Grammy Award for Best Rap Song and Best Rap Solo Performance. In 2004, it was one of only three hip hop songs from the 21st century to be included on Rolling Stone's list of the 500 Greatest Songs of All Time, being the highest ranked at number 166. Rolling Stone also included it on its list of the Top 50 Hip Hop Songs of All Time. \"Lose Yourself\" is certified Diamond by the Recording Industry Association of America (RIAA), and has been downloaded 10 million times in the United States alone. It was performed by Eminem and Anderson .Paak in the Super Bowl LVI halftime show on February 13, 2022.\n\nIn the United States, \"Lose Yourself\" debuted on the Billboard Hot 100 singles chart the week of October 5, 2002, at No. 43 prior to its release 24 days later, which is October 28 of that same year. A week later, the single jumped to No. 18, and hit No. 1 on the week of November 9 and remained there for twelve consecutive weeks until it was knocked off by Bump, Bump, Bump by B2K and P. Diddy. The single spent 16 total weeks in the Top 10, and a total of 23 weeks in the Top 50. While in the No. 1 spot (from November 9, 2002, through January 25, 2003), \"Lose Yourself\" kept several top contenders for the No. 1 spot from ever reaching No. 1, including Jay-Z, Nelly, Jennifer Lopez, Christina Aguilera, and especially Missy Elliott, whose single \"Work It\" was at No. 2 for 10 weeks. The song also topped the Pop Songs chart for 7 weeks and hit No. 4 and No. 2 on the Hot R&B\/Hip-Hop Songs and Rap Songs charts. The song also used some rock music origins allowing moderate success to alternative rock radio peaking No. 14 on the Modern Rock Tracks chart, the rapper's only song to chart. It reached 4 million in sales by August 2011, and as of September 2017, it has sold 7.37 million copies in the U.S.\n\nIn France, it is the 53rd best-selling single of the 21st century, with 386,000 units sold as of August 2014. By December 2016, it had sold more than 11,590,000 units worldwide.\n\nAs of March 2018, it had sold 10 million copies in the U.S and has now been certified diamond. <a href=\"http:\/\/www.last.fm\/music\/Eminem\/_\/Lose+Yourself\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}