{
  "created_at": "2025-05-03T14:31:01.272896+00:00",
  "elapsed": 0.251382,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:31:01.272896+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5182",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:31:01 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Westlife&format=json&method=track.getInfo&track=Hello+My+Love"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Westlife&format=json&method=track.getInfo&track=Hello+My+Love",
  "_decoded_content": {
    "track": {
      "name": "Hello My Love",
      "url": "https:\/\/www.last.fm\/music\/Westlife\/_\/Hello+My+Love",
      "duration": "216000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "29678",
      "playcount": "187930",
      "artist": {
        "name": "Westlife",
        "mbid": "5f000e69-3cfd-4871-8f1b-faa7f0d4bcbc",
        "url": "https:\/\/www.last.fm\/music\/Westlife"
      },
      "album": {
        "artist": "Various Artists",
        "title": "Working Class Heroes",
        "url": "https:\/\/www.last.fm\/music\/Various+Artists\/Working+Class+Heroes",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/f41ae7337ac05a19167abce417bc14da.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/f41ae7337ac05a19167abce417bc14da.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/f41ae7337ac05a19167abce417bc14da.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/f41ae7337ac05a19167abce417bc14da.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "irish",
            "url": "https:\/\/www.last.fm\/tag\/irish"
          },
          {
            "name": "2010s",
            "url": "https:\/\/www.last.fm\/tag\/2010s"
          },
          {
            "name": "2019",
            "url": "https:\/\/www.last.fm\/tag\/2019"
          },
          {
            "name": "linedance 2019",
            "url": "https:\/\/www.last.fm\/tag\/linedance+2019"
          }
        ]
      },
      "wiki": {
        "published": "18 Jan 2019, 03:08",
        "summary": "\"Hello My Love\" is a song by Irish pop vocal band Westlife. It was released on 10 January 2019 the lead single from Westlife's eleventh studio album, and is their first single to be released under Universal Music Group and Virgin EMI Records. It is also their first official single in eight years since the release of their last single, \"Lighthouse\", in 2011.\nSince they announced their breakup in 2011 and their last appearance together in 2012, several rumors about them reuniting and making new musics have appeared. <a href=\"http:\/\/www.last.fm\/music\/Westlife\/_\/Hello+My+Love\">Read more on Last.fm<\/a>.",
        "content": "\"Hello My Love\" is a song by Irish pop vocal band Westlife. It was released on 10 January 2019 the lead single from Westlife's eleventh studio album, and is their first single to be released under Universal Music Group and Virgin EMI Records. It is also their first official single in eight years since the release of their last single, \"Lighthouse\", in 2011.\nSince they announced their breakup in 2011 and their last appearance together in 2012, several rumors about them reuniting and making new musics have appeared. On 23 September 2018, several Irish news outlets started reporting that the group has been signed to Universal Music Group and Virgin EMI Records for a new music record deal. On 3 October 2018, the group formally announced on their official social media accounts that there would be new music coming soon. According to reports they've been preparing for the comeback for the past twelve months. Group member Mark Feehily also said in 2017 he hoped to get them all together for a proper catch-up. Band members Nicky Byrne and Shane Filan stated about their reunion, \"We still have a lot that we want to achieve as a band and we want to bring our new music to fans all over the world\" and \"While we were away, we realised what Westlife really meant to the fans — and to us.\"\n\nWith regards to their new music, Feehily and Filan added, \"We’re not trying to change Westlife's sound, we're trying to evolve\", \"We need to be a Westlife 2.0, a better version of ourselves. We wanted to come back and recreate Westlife's sound, but better, and be a better band, and the most important thing about any band is music.\" Few seconds of the new single was heard on their 2019 concert tour The Twenty Tour advertisements on British and Irish radio stations in October 2018. On 19 November 2018, band manager Louis Walsh confirmed the title on The Irish News, calling it their first comeback single and an introduction to their new sound. He added, \"They're just pulling together the final promo details.\"\n\nOn 7 January 2019, they officially announced the release date of the single would be 10 January 2019 on all of their social media accounts, with a short official audio clip of the song. On 8 January 2019, they revealed the official photo cover (in GIF format on their social accounts) of the single with a caption \"8:30am #HelloMyLove\" which means was the single's time of premiere on 10 January 2019 (GMT time).[8] At the same day, several British radio stations and some regional social network accounts of Universal Music reported the date of the first play of the new single. China, Malaysia, Mexico, Poland, Singapore, and Thailand confirmed the first play of the single on the same day. BBC Radio 2 in the UK and 2FM in Ireland will play the track earlier with at least a 15-minute and 5-minute differences respectively. Sweden's RIX FM said they would premiere it on 0930 GMT on the same day. On 9 January 2019, Filan revealed a part of the lyrics of the single after the Official Charts Company revealed some parts of the lyrics to the song on 8 January 2019. <a href=\"http:\/\/www.last.fm\/music\/Westlife\/_\/Hello+My+Love\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}