{
  "created_at": "2025-05-03T14:41:24.362979+00:00",
  "elapsed": 0.217074,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:41:24.362979+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4995",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:41:24 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Tinashe&format=json&method=track.getInfo&track=Nasty"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Tinashe&format=json&method=track.getInfo&track=Nasty",
  "_decoded_content": {
    "track": {
      "name": "Nasty",
      "url": "https:\/\/www.last.fm\/music\/Tinashe\/_\/Nasty",
      "duration": "176000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "483427",
      "playcount": "4960004",
      "artist": {
        "name": "Tinashe",
        "mbid": "396a9525-0994-4542-b480-c4587feeb476",
        "url": "https:\/\/www.last.fm\/music\/Tinashe"
      },
      "album": {
        "artist": "Tinashe",
        "title": "Nasty",
        "url": "https:\/\/www.last.fm\/music\/Tinashe\/Nasty",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/06fba2f1288e4aa4c12ab372cb03c230.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/06fba2f1288e4aa4c12ab372cb03c230.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/06fba2f1288e4aa4c12ab372cb03c230.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/06fba2f1288e4aa4c12ab372cb03c230.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "rnb",
            "url": "https:\/\/www.last.fm\/tag\/rnb"
          },
          {
            "name": "pop rap",
            "url": "https:\/\/www.last.fm\/tag\/pop+rap"
          },
          {
            "name": "contemporary rnb",
            "url": "https:\/\/www.last.fm\/tag\/contemporary+rnb"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "hyphy",
            "url": "https:\/\/www.last.fm\/tag\/hyphy"
          }
        ]
      },
      "wiki": {
        "published": "18 Apr 2024, 23:59",
        "summary": "\"Nasty\" is a song by American singer and songwriter Tinashe. It was released on April 12, 2024, via her independent record label, Tinashe Music Inc., and Nice Life Recording Company. The release of the song coincided with her performance at the 2024 Coachella Valley Music & Arts Festival. Serving as the lead single from her upcoming seventh studio album, Quantum Baby, \"Nasty\" was written by Tinashe, Ricky Reed, and produced by Zack Sekoff alongside Reed. <a href=\"http:\/\/www.last.fm\/music\/Tinashe\/_\/Nasty\">Read more on Last.fm<\/a>.",
        "content": "\"Nasty\" is a song by American singer and songwriter Tinashe. It was released on April 12, 2024, via her independent record label, Tinashe Music Inc., and Nice Life Recording Company. The release of the song coincided with her performance at the 2024 Coachella Valley Music & Arts Festival. Serving as the lead single from her upcoming seventh studio album, Quantum Baby, \"Nasty\" was written by Tinashe, Ricky Reed, and produced by Zack Sekoff alongside Reed. The track is characterized by its uptempo R&B club vibe, blending elements of electro and trap music.\n\nThe song's lyrical content and beat encapsulate a bold exploration of confidence and self-empowerment, with the chorus declaring a provocative stance: \"I've been a nasty girl (nasty!).\" The lyrics, infused with themes of assertiveness and allure, explore the notion of embracing one's desires and identity unapologetically. The production features a pulsating rhythm with sharp synths and a trap-influenced beat, creating an infectious, danceable atmosphere that has resonated strongly with audiences.\n\n\"Nasty\" gained viral popularity on X, formerly known as Twitter, after a user posted a video of a British dancer performing to soca music with his instructor, with \"Nasty\" replacing the original audio. This video quickly went viral, leading the song to gain significant traction on TikTok, where it was featured in over 300,000 videos by June 2024. The track's catchy hook and energetic beat made it a favorite for dance challenges and lip-syncing videos, further amplifying its reach and popularity across social media platforms.\n\nOn the chart dated June 15, 2024, \"Nasty\" debuted at number 90 on the Billboard Hot 100, marking Tinashe's fifth entry on the chart, her second as a lead artist, and her first solo entry in almost eight years. This milestone underscores the song's impact and Tinashe's enduring appeal in the music industry. The entry also highlights a significant comeback for Tinashe, showcasing her ability to captivate a new generation of listeners while maintaining her established fan base.\n\nCritically, \"Nasty\" has been praised for its bold production and Tinashe's commanding vocal performance. Reviewers have highlighted the song's catchy melody and its seamless blend of R&B, electro, and trap elements, which have made it a standout track in Tinashe's discography. The song's lyrical bravado and infectious beat have been lauded for their ability to inspire confidence and energy, making it a compelling addition to the contemporary pop and R&B landscape.\n\nOverall, \"Nasty\" represents a significant moment in Tinashe's career, showcasing her growth as an artist and her ability to innovate within the R&B and pop genres. The song's success on digital platforms and its strong debut on the Billboard Hot 100 reaffirm Tinashe's status as a formidable force in the music industry. With its release, \"Nasty\" not only sets the tone for her upcoming album, Quantum Baby, but also solidifies Tinashe's place in the current musical zeitgeist. <a href=\"http:\/\/www.last.fm\/music\/Tinashe\/_\/Nasty\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}