{
  "created_at": "2025-05-03T14:42:43.019760+00:00",
  "elapsed": 0.178173,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:42:43.019760+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5797",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:42:43 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Gorillaz&format=json&method=track.getInfo&track=Feel+Good+Inc."
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Gorillaz&format=json&method=track.getInfo&track=Feel+Good+Inc.",
  "_decoded_content": {
    "track": {
      "name": "Feel Good Inc.",
      "mbid": "5660558a-bfa7-416f-99d9-a34ca0a34515",
      "url": "https:\/\/www.last.fm\/music\/Gorillaz\/_\/Feel+Good+Inc.",
      "duration": "222000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "3066781",
      "playcount": "33315950",
      "artist": {
        "name": "Gorillaz",
        "mbid": "e21857d5-3256-4547-afb3-4b6ded592596",
        "url": "https:\/\/www.last.fm\/music\/Gorillaz"
      },
      "album": {
        "artist": "Gorillaz",
        "title": "Demon Days",
        "mbid": "ad0a377b-6c7c-30ff-921d-a47edae073e2",
        "url": "https:\/\/www.last.fm\/music\/Gorillaz\/Demon+Days",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/271483e955d2b255160f3361a7f5fb78.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/271483e955d2b255160f3361a7f5fb78.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/271483e955d2b255160f3361a7f5fb78.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/271483e955d2b255160f3361a7f5fb78.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "6"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "alternative",
            "url": "https:\/\/www.last.fm\/tag\/alternative"
          },
          {
            "name": "electronic",
            "url": "https:\/\/www.last.fm\/tag\/electronic"
          },
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          },
          {
            "name": "rock",
            "url": "https:\/\/www.last.fm\/tag\/rock"
          },
          {
            "name": "gorillaz",
            "url": "https:\/\/www.last.fm\/tag\/gorillaz"
          }
        ]
      },
      "wiki": {
        "published": "17 Mar 2009, 18:22",
        "summary": "\"Feel Good Inc.\" is a song by British virtual band Gorillaz, featuring American hip-hop group De La Soul. The song was released as the lead single from the band's second studio album \"Demon Days\" on 9 May 2005. The single peaked at No. 2 in the United Kingdom and Europe, and No. 14 in the United States. \"Feel Good Inc.\" made the US Billboard year-end top songs chart in 2005 and 2006. It also topped Billboard's Alternative Songs chart in the U.S. for eight consecutive weeks, a first for the band. <a href=\"http:\/\/www.last.fm\/music\/Gorillaz\/_\/Feel+Good+Inc.\">Read more on Last.fm<\/a>.",
        "content": "\"Feel Good Inc.\" is a song by British virtual band Gorillaz, featuring American hip-hop group De La Soul. The song was released as the lead single from the band's second studio album \"Demon Days\" on 9 May 2005. The single peaked at No. 2 in the United Kingdom and Europe, and No. 14 in the United States. \"Feel Good Inc.\" made the US Billboard year-end top songs chart in 2005 and 2006. It also topped Billboard's Alternative Songs chart in the U.S. for eight consecutive weeks, a first for the band. This is the only song in Damon Albarn's career to reach the top 40 on the Billboard Hot 100. It peaked in the top 10 in 17 countries, reaching No. 1 in Spain and Greece. It surpassed \"Clint Eastwood\" to become Gorillaz's most successful single worldwide. \"Feel Good Inc.\" has been certified platinum in Australia and double-platinum in the United Kingdom.\n\nThe song was listed in Pitchfork Media and Rolling Stone's Best Songs of the 2000s. It was nominated for three Grammys at the 2006 Grammy Awards, including Record of the Year, but winning for Best Pop Collaboration. Popdose ranked it 26th on their list of 100 best songs of the decade.\n\nMusic video\nThe main themes of the video are intellectual freedom and the media's dumbing down of mass culture.\n\nAt the beginning of the video, the camera rises up to the top of the Feel Good Inc. tower, and a sample of the Spacemonkeyz dub of \"Clint Eastwood\", entitled \"A Fistful of Peanuts\", can be heard. The camera focuses into the tower, where 2-D yearns for the freedom to join Noodle on her floating island. The characters lying on the floor represent those who have already been \"dumbed down\", while the band members are the ones who have awakened. 2-D is trying to wake all the people from their half-dead state by yelling at them through his megaphone, in the style of a political activist. The floating island is chased by ominous helicopters, which closely resemble Korean War era Bell H-13s, monitoring the behaviour inside and ensuring that no one escapes. It is unclear whether they are preventing Noodle's escape or are chasing her away. Back in the tower, De La Soul appear as larger-than life, seemingly omnipotent images on surrounding television screens, laughing at the Gorillaz band members. Their taunting drives 2-D into a wild, hypnotic frenzy as he tries to resist the urge to be dumbed down. At the end of the video, 2-D, beaten by his surroundings, returns to the state he was in when the video began, repeating the words \"Feel good\" until the video finally ends, in an exact reversal of the intro. The repetition of \"Feel good\" represents that 2-D is convincing himself that everything is OK (as if he is brainwashing himself to believe it), instead of facing the harsh truth of the situation. The music video for \"El Mañana\" is a continuation of this video, depicting two helicopter gunships catching up to Noodle's floating windmill island and attacking it.\n\nJamie Hewlett said in an interview that the inspiration for some scenes in the video came from Hayao Miyazaki; specifically, the windmill-powered landmass, which has been compared to that of Miyazaki's \"Castle in the Sky\".\n\nUsage in media\nThe track was included in the respective soundtracks of SingStar Pop, Dance Dance Revolution Hottest Party 3, DJ Hero, Guitar Hero 5, Fantasia: Music Evolved, Grand Theft Auto V, and Watch Dogs: Legion; the single has also been included as downloadable content for the soundtracks of Rock Band and SingStar. Additionally, the track was utilized in one of Apple's \"silhouette style\" iPod television advertisements. <a href=\"http:\/\/www.last.fm\/music\/Gorillaz\/_\/Feel+Good+Inc.\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}