{
  "created_at": "2025-05-03T14:43:35.790452+00:00",
  "elapsed": 0.227131,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:43:35.790452+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5250",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:43:36 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Queen&format=json&method=track.getInfo&track=Don%27t+Stop+Me+Now+-+Remastered+2011"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Queen&format=json&method=track.getInfo&track=Don%27t+Stop+Me+Now+-+Remastered+2011",
  "_decoded_content": {
    "track": {
      "name": "Don't Stop Me Now - Remastered 2011",
      "url": "https:\/\/www.last.fm\/music\/Queen\/_\/Don%27t+Stop+Me+Now+-+Remastered+2011",
      "duration": "209000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1281032",
      "playcount": "9925119",
      "artist": {
        "name": "Queen",
        "mbid": "420ca290-76c5-41af-999e-564d7c71f1a7",
        "url": "https:\/\/www.last.fm\/music\/Queen"
      },
      "album": {
        "artist": "Queen",
        "title": "Jazz (2011 Remaster)",
        "url": "https:\/\/www.last.fm\/music\/Queen\/Jazz+(2011+Remaster)",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/d9645ba9592445b1c5c35e1990c6964f.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/d9645ba9592445b1c5c35e1990c6964f.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/d9645ba9592445b1c5c35e1990c6964f.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/d9645ba9592445b1c5c35e1990c6964f.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "rock",
            "url": "https:\/\/www.last.fm\/tag\/rock"
          },
          {
            "name": "Queen",
            "url": "https:\/\/www.last.fm\/tag\/Queen"
          },
          {
            "name": "classic rock",
            "url": "https:\/\/www.last.fm\/tag\/classic+rock"
          },
          {
            "name": "classic",
            "url": "https:\/\/www.last.fm\/tag\/classic"
          },
          {
            "name": "hard rock",
            "url": "https:\/\/www.last.fm\/tag\/hard+rock"
          }
        ]
      },
      "wiki": {
        "published": "11 Apr 2022, 13:48",
        "summary": "\"Don't Stop Me Now\" is a song by the British rock band Queen featured on their 1978 album \"Jazz\" that was released as a single in 1979. Written by lead singer Freddie Mercury, it was recorded in August 1978 at Super Bear Studios in Berre-les-Alpes (Alpes-Maritimes), France, and is the twelfth track on the album.\n\nMusically, the song builds on Mercury's piano playing, with John Deacon and Roger Taylor providing a bass guitar and drums backing track. <a href=\"http:\/\/www.last.fm\/music\/Queen\/_\/Don%27t+Stop+Me+Now+-+Remastered+2011\">Read more on Last.fm<\/a>.",
        "content": "\"Don't Stop Me Now\" is a song by the British rock band Queen featured on their 1978 album \"Jazz\" that was released as a single in 1979. Written by lead singer Freddie Mercury, it was recorded in August 1978 at Super Bear Studios in Berre-les-Alpes (Alpes-Maritimes), France, and is the twelfth track on the album.\n\nMusically, the song builds on Mercury's piano playing, with John Deacon and Roger Taylor providing a bass guitar and drums backing track. The song also provides an example of Queen's trademark style of multitrack harmony vocals for the chorus lines.\n\nThe song also appears in the band's 1981 compilation album \"Greatest Hits\", and in June 2011, as part of Queen's 40th anniversary celebrations, an old take of the song containing more guitar parts was included on the bonus EP of the re-released and remastered \"Jazz\" album. Featuring in films, commercials, and television shows, the song has grown in popularity in the four decades since its release. Bobby Olivier of Billboard attributes its initial rebirth to its appearance in the 2004 cult classic zombie apocalypse film Shaun of the Dead. In 2014, Rolling Stone readers voted it their third-favourite song by Queen.\n\nThe single reached number 9 in the UK charts but only number 86 in the US; as the album was a top-10 hit, the song got some airplay on U.S. album-oriented rock stations despite its low chart ranking as a single. Despite this, the song has grown in stature with time and has been popularised not only by consistent airplay, but by its use in advertisements, television programmes and films, and through cover versions. It has subsequently become one of Queen's most popular songs. The song was voted as the third-best Queen song by readers of Rolling Stone, who noted that \"time has also been very kind to it and it's widely seen now as one of the group's best works.\" The single also has reached Platinum status in the United Kingdom. In a March 2019 Billboard magazine article titled, \"The Evolution of Queen's 'Don't Stop Me Now': How a Minor Hit Became One of The Band's Most Beloved (And Inescapable) Songs\", Bobby Olivier writes:\n\n\"You might have noticed a new commercial promoting the new season of American Idol. It was a 90-second music video featuring a dozen or so bright-eyed contestants, all of whom gleefully belted lines from a beloved song that has felt particularly ubiquitous as of late. No, it wasn't \"Shallow,\" or \"Thank U, Next\"—it was Queen's \"Don't Stop Me Now,\" a classic-rock energizer that has, in the last six months alone, also been featured in commercials for Toyota, Silk almond milk, Amazon and L'Oreal. In the latter spot, Camila Cabello lip-syncs to the 41-year-old song as she dances and applies her lipstick. \"Don't Stop Me Now\" is not only one of the band's most treasured cuts, but one of the most popular songs of its entire era. On Sunday, March 3, it eclipsed 500 million plays on Spotify—nearly double that of any Rolling Stones, U2 or Led Zeppelin song on the service.\"\n\nThe video for the song was directed by J. Kliebenstein and filmed at the Forest National, Brussels, Belgium on 26 January 1979. <a href=\"http:\/\/www.last.fm\/music\/Queen\/_\/Don%27t+Stop+Me+Now+-+Remastered+2011\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}