{
  "created_at": "2025-05-03T14:33:46.301119+00:00",
  "elapsed": 0.236648,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:33:46.301119+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "3152",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:33:46 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Megan+Thee+Stallion&format=json&method=track.getInfo&track=Girls+in+the+Hood"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Megan+Thee+Stallion&format=json&method=track.getInfo&track=Girls+in+the+Hood",
  "_decoded_content": {
    "track": {
      "name": "Girls In The Hood",
      "url": "https:\/\/www.last.fm\/music\/Megan+Thee+Stallion\/_\/Girls+In+The+Hood",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "366683",
      "playcount": "3344739",
      "artist": {
        "name": "Megan Thee Stallion",
        "url": "https:\/\/www.last.fm\/music\/Megan+Thee+Stallion"
      },
      "toptags": {
        "tag": [
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          },
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "trap",
            "url": "https:\/\/www.last.fm\/tag\/trap"
          },
          {
            "name": "Southern Hip Hop",
            "url": "https:\/\/www.last.fm\/tag\/Southern+Hip+Hop"
          },
          {
            "name": "2020",
            "url": "https:\/\/www.last.fm\/tag\/2020"
          }
        ]
      },
      "wiki": {
        "published": "25 Oct 2020, 09:49",
        "summary": "\"Girls in the Hood\" serves as a confident anthem for young women who embrace their sexuality and independence. The song sends a message of empowerment to women who refuse to conform to societal expectations and choose to live life on their own terms. In the first verse, Megan tells listeners that she is tired of people trying to control her and that she is unapologetic about her behavior. She also warns other women to stay away from their men because she will have fun with them. <a href=\"http:\/\/www.last.fm\/music\/Megan+Thee+Stallion\/_\/Girls+In+The+Hood\">Read more on Last.fm<\/a>.",
        "content": "\"Girls in the Hood\" serves as a confident anthem for young women who embrace their sexuality and independence. The song sends a message of empowerment to women who refuse to conform to societal expectations and choose to live life on their own terms. In the first verse, Megan tells listeners that she is tired of people trying to control her and that she is unapologetic about her behavior. She also warns other women to stay away from their men because she will have fun with them. In the chorus, she emphasizes that she is a \"hot girl\", meaning that she is confident in her sexuality, and she spends her own money on her fashion choices. She refuses to be seen as \"thirsty\" and emphasizes that other women are jealous and want to \"hurt\" her.\n\nIn the second verse, Megan dismisses rumors about her by addressing them head-on and makes it clear that she is not shy about her sexuality. She also compares herself to a cartoon character from \"anime\" and enjoys watching her partner go down on her. She describes herself as a \"rich nigga magnet\" and contradicts the idea that standing out is a bad thing. In the third verse, she talks about working since she was 16 to become successful and to become wealthy. She urges others to check her throwback pictures to see that she has always been confident in herself and her abilities.\n\nOverall, \"Girls in the Hood\" is a celebration of self-confidence and independence. Megan Thee Stallion encourages young women to be proud of their sexuality and to unapologetically live life on their terms. The song is a modern-day anthem for women who are becoming less apologetic about who they are and what they want. <a href=\"http:\/\/www.last.fm\/music\/Megan+Thee+Stallion\/_\/Girls+In+The+Hood\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}