{
  "created_at": "2025-05-03T14:36:31.559703+00:00",
  "elapsed": 0.189003,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:36:31.559703+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5233",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:36:31 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=MKTO&format=json&method=track.getInfo&track=Classic"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=MKTO&format=json&method=track.getInfo&track=Classic",
  "_decoded_content": {
    "track": {
      "name": "Classic",
      "mbid": "6399c732-2c8f-4c69-ad6a-ee99cf313b2d",
      "url": "https:\/\/www.last.fm\/music\/MKTO\/_\/Classic",
      "duration": "174000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "910578",
      "playcount": "7106485",
      "artist": {
        "name": "MKTO",
        "mbid": "aa25521e-3848-4ff7-ab09-545cc95b8a36",
        "url": "https:\/\/www.last.fm\/music\/MKTO"
      },
      "album": {
        "artist": "MKTO",
        "title": "MKTO",
        "mbid": "4f4b7614-e8b0-4157-87a1-157426b26e7a",
        "url": "https:\/\/www.last.fm\/music\/MKTO\/MKTO",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/dfa4529045db4d4dcd33b3e93bac6740.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/dfa4529045db4d4dcd33b3e93bac6740.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/dfa4529045db4d4dcd33b3e93bac6740.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/dfa4529045db4d4dcd33b3e93bac6740.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "2"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "2014",
            "url": "https:\/\/www.last.fm\/tag\/2014"
          },
          {
            "name": "best of 2014",
            "url": "https:\/\/www.last.fm\/tag\/best+of+2014"
          },
          {
            "name": "classic",
            "url": "https:\/\/www.last.fm\/tag\/classic"
          },
          {
            "name": "dance",
            "url": "https:\/\/www.last.fm\/tag\/dance"
          }
        ]
      },
      "wiki": {
        "published": "27 Oct 2022, 15:48",
        "summary": "\"Classic\" is a song by American pop duo MKTO. Written by Evan \"Kidd\" Bogart, Andrew Goldstein, Emanuel Kiriakou, and Lindy Robbins, \"Classic\" was first released on June 20, 2013 as the second single from the duo's self-titled debut album.\n\nAfter securing a recording contract with Columbia Records in 2012, MKTO began recording material for their self-titled debut album in 2013, with American singer-songwriter, Ne-Yo and Swedish record producer, Max Martin among some of their collaborators. <a href=\"http:\/\/www.last.fm\/music\/MKTO\/_\/Classic\">Read more on Last.fm<\/a>.",
        "content": "\"Classic\" is a song by American pop duo MKTO. Written by Evan \"Kidd\" Bogart, Andrew Goldstein, Emanuel Kiriakou, and Lindy Robbins, \"Classic\" was first released on June 20, 2013 as the second single from the duo's self-titled debut album.\n\nAfter securing a recording contract with Columbia Records in 2012, MKTO began recording material for their self-titled debut album in 2013, with American singer-songwriter, Ne-Yo and Swedish record producer, Max Martin among some of their collaborators. \"Classic\" was eventually chosen as the follow-up to the duo's top ten hit, \"Thank You\" and released as the second single from their debut album in June 2013. In the lead-up to the single's release in the United States, MKTO served as the opening act for Emblem3 during their tour in the summer and also made a visit to the Billboard office, where they previewed tracks from their debut album, which had not yet been released at the time.\n\nThe song received positive reviews from critics and fans. BrentMusicReviews gave it 5\/5 stars and called it \"MKTO don’t reinvent the wheel, but deliver worthwhile pop music\". Matt Collar from AllMusic gave a positive review and stated \"Featuring the talents of actor\/musicians Malcolm Kelly and Tony Oller, MKTO's full-length debut album, 2014's eponymous MKTO, is an exuberant and catchy mix of dancey, hip-hop-infused pop, rock, and R&B.\" The song featured on the American version of Now That's What I Call Music! 47 almost a whole year before it reached national success. The song sold 76,000 downloads in the US in 2013 according to Nielsen SoundScan. It has sold 742,000 downloads in the US up to date.\n\nThe song's accompanying music video was directed by Josh Forbes and was released on June 20, 2013. In MKTO: The Making of Classic, the duo reveals that the video explores \"bringing back the classic feel\". Band member Tony Oller elaborates further by saying, \"The whole concept is about going back in time and reliving those great classic moments\". The video begins with MKTO walking into a club, where they meet a few girls and take them to a magical photo booth that transforms the girls into dresses that were worn back in the different “classical” eras.\n\n\"Classic\" was a commercial success in Oceania, peaking at number eight in New Zealand and number nine in Australia, becoming the duo's second top 10 hit in both nations. It has been certified Gold by Recorded Music NZ (RMNZ) for sales in excess of 7,500 copies and 2× Platinum by the Australian Recording Industry Association (ARIA), denoting shipments in excess of 140,000 copies. In the United States, \"Classic\" debuted at number 96 on the US Billboard Hot 100, becoming MKTO's first single to chart in North America. It peaked at number 14, becoming the group's first top 20 hit in the US. In addition to the Hot 100, \"Classic\" has also peaked at number eight on the US Mainstream Top 40, becoming the duo's first top 10 hit on this chart. In June 2014, the song surpassed the one million mark in digital sales and was subsequently certified Double Platinum by the Recording Industry Association of America (RIAA). <a href=\"http:\/\/www.last.fm\/music\/MKTO\/_\/Classic\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}