{
  "created_at": "2025-05-03T14:38:55.984527+00:00",
  "elapsed": 0.188176,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:38:55.984527+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "16055",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:38:56 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Eminem&format=json&method=track.getInfo&track=Love+the+Way+You+Lie"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Eminem&format=json&method=track.getInfo&track=Love+the+Way+You+Lie",
  "_decoded_content": {
    "track": {
      "name": "Love The Way You Lie",
      "url": "https:\/\/www.last.fm\/music\/Eminem\/_\/Love+The+Way+You+Lie",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1407591",
      "playcount": "10681985",
      "artist": {
        "name": "Eminem",
        "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4",
        "url": "https:\/\/www.last.fm\/music\/Eminem"
      },
      "toptags": {
        "tag": [
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          },
          {
            "name": "Eminem",
            "url": "https:\/\/www.last.fm\/tag\/Eminem"
          },
          {
            "name": "Love",
            "url": "https:\/\/www.last.fm\/tag\/Love"
          },
          {
            "name": "emotional",
            "url": "https:\/\/www.last.fm\/tag\/emotional"
          }
        ]
      },
      "wiki": {
        "published": "27 Oct 2012, 18:20",
        "summary": "\"Love the Way You Lie\" is the second single from American rapper Eminem's seventh studio album \"Recovery\". Singer Skylar Grey was inspired to write and record the demo with Alex da Kid when she felt she was in an abusive romantic relationship with the music industry. Eminem wrote the verses and chose Barbadian singer Rihanna to sing the chorus; their past experiences of domestic violence influenced the collaboration. Recording sessions were held in Ferndale, Michigan, and Dublin, Ireland. <a href=\"http:\/\/www.last.fm\/music\/Eminem\/_\/Love+The+Way+You+Lie\">Read more on Last.fm<\/a>.",
        "content": "\"Love the Way You Lie\" is the second single from American rapper Eminem's seventh studio album \"Recovery\". Singer Skylar Grey was inspired to write and record the demo with Alex da Kid when she felt she was in an abusive romantic relationship with the music industry. Eminem wrote the verses and chose Barbadian singer Rihanna to sing the chorus; their past experiences of domestic violence influenced the collaboration. Recording sessions were held in Ferndale, Michigan, and Dublin, Ireland. Backed by guitar, piano and violin, the track is a midtempo hip hop ballad with a pop refrain and describes two lovers who refuse to separate despite being in an abusive love–hate relationship.\n\nInterscope Records released the single in August 2010. Critics praised its melody but were divided on thematic aspects such as poignancy and accuracy. Eminem promoted the song with performances at the 2010 Electronic Entertainment Expo, the MTV Video Music Awards and festivals. The music video, directed by Joseph Kahn, stars Dominic Monaghan and Megan Fox in a violent relationship and shows Eminem and Rihanna in front of a burning house. The clip had a mixed reception due to scenes of domestic violence. Critics suggested that the song and its accompanying video were influenced by Eminem's and Rihanna's respective relationships with ex-lovers Kimberly Scott and Chris Brown.\n\nMagazines listed \"Love the Way You Lie\" among the best of 2010 and of Eminem's work. The song won awards and received five Grammy nominations. His best-selling single, it was number one on 26 weekly record charts, including the United States' Billboard Hot 100 for seven weeks. The single sold more than 5 million copies in the US and was the best-selling song of 2010 in the United Kingdom. Musical acts such as Cher Lloyd and The Band Perry performed cover versions. Rihanna has said that a theme of domestic violence, a topic on which she claims many people do not have insight, is what makes the song effective. She later recorded \"Love the Way You Lie (Part II)\", narrated mostly from the female perspective.\n\nDevelopment of \"Love the Way You Lie\" began with the backing track and hook melody, which was created by the British hip hop producer Alex da Kid. When making a track, he said he spends hours making loops and produces an electronic drum rhythm before adding live instrumentation. The drums are sampled from live recordings he saves. Alex da Kid recorded an acoustic guitar for the verses with a Georg Neumann U87 microphone and an Avid Mbox audio interface. He told Sound on Sound magazine that this song had given him an opportunity to reintroduce live guitar in hip hop music. During the session, he used Waves RVerb and REQ equalization on his main kick track and a MaxxBass plug-in on two others.\n\nWriting began in late 2009, when the American singer Holly Hafermann resided at the Artula Retreat in Bandon, Oregon  and composed songs.Later, in New York City, under her new stage name Skylar Grey, she visited her Universal Music publisher, Jennifer Blakeman, to seek help presenting her work; Blakeman suggested she collaborate with Alex da Kid. The producer emailed Grey his track, which suggested a theme of abusive romantic relationships to her as she spontaneously sang lyrics to the melody. She told the Los Angeles Times that she was in an abusive relationship with the music industry: \"I love it so much, and I give it all that I have, yet it beats me down. This idea inspired her writing, a process she found came naturally, as if she were creating an alternative pop song for herself. She wrote the chorus to \"Love the Way You Lie\" in fifteen minutes and recorded vocals for Alex da Kid's demo.\n\nIn early 2010, Alex da Kid offered the Shady Records Senior Director Rigo \"Riggs\" Morales some backing tracks. Morales enjoyed the tracks and sent them to Eminem, who was seeking a different musical approach for his next album. Impressed with Alex da Kid's work, Eminem asked for more tracks and subsequently heard \"Love the Way You Lie\". He chose it and told his manager Paul Rosenberg he wanted to collaborate with the Barbadian singer Rihanna. Eminem told Skyrock, \"It's one of those tracks that I felt like only she could pull it off.\" Rosenberg sent the track to Rihanna, who accepted Eminem's request \"at the last moment. Eminem then wrote the rapped verses.\n\nRihanna said she joined the collaboration because she could relate to the theme of the song, as she and Eminem had been in difficult relationships on \"different ends of the table\". Eminem had released the songs \"'97 Bonnie & Clyde\" (1998) and \"Kim\" (2000), in which he fantasizes, respectively, about murdering and verbally abusing his then-wife Kimberly Scott. They had divorced in 2001 and again in 2006 after a remarriage. In February 2009, Rihanna's relationship with the American singer Chris Brown had ended following his felony assault on her. Rihanna described \"Love the Way You Lie\" as unique, realistic and deep, saying that it \"broke down the cycle of domestic violence\" because few people had insight on the topic.\n\nOn May 27, 2010, Eminem revealed the title of \"Love the Way You Lie\" as part of the track list of his seventh studio album Recovery, which came out on June 21. Initially a radio single,[37] the song was released later by Polydor Records as a CD in the United Kingdom on August 9, 2010. Interscope Records distributed it in Germany on August 20.\n\n\"Love the Way You Lie\" received generally favorable reviews. An editor for Rap-Up listed it among the four best tracks from the album. New York Times writer Jon Caramanica considered it \"one of the album's most engaging songs\" and praised Eminem's ability to assess issues from the perspectives of both sexes. MTV's Rodriguez wrote that the song echoes content from Eminem's earlier albums, but finds him \"sober\" and \"more mature\". He added that the lyrics allude to Eminem's relationship with Scott and that \"Love the Way You Lie\" is his closest approach to a love song. Editors of The A.V. Club compared the single with \"Kim\" and \"'97 Bonnie & Clyde\"; they found he is more tempered in \"Love the Way You Lie\" when discussing a \"mutually destructive relationship\" and that Rihanna's involvement creates an eerie mood.\n\nCritics especially praised Rihanna's contribution. Michael Menachem of Billboard complimented her \"exquisitely melodic and surprisingly hopeful\" vocal performance and \"Eminem's dark, introspective\" rapping. He noted that the percussion complements both artists and that Alex da Kid gave the classical arrangement a mainstream touch. Kyle Anderson, writing for MTV, remarked that the song showcases Rihanna's emotional vocals and Eminem's \"most intense rhymes about his tumultuous relationships\". He regarded \"Love the Way You Lie\" as an honest, \"well-constructed pop song with a killer hook\" and likened the \"slow-burning\" music to that of \"Someone like You\", a 2011 single by the British singer Adele. The Houston Chronicle pop critic Joey Guerra commented that Rihanna brought a \"sandpaper and silk sheen\" to the track.\n\nCritics have commented on the message in the lyrics. Anderson noted a dark theme, while Nick Levine of Digital Spy, Allie Townsend of Time magazine and Jocelyn Noveck of the Associated Press suggested the previous relationships of both artists influenced the song. Levine gave it four stars out of five. According to Eric Hayden of The Atlantic Wire, the song refers to an alcoholic couple, possibly inspired by Rihanna's relationship with Brown. McAlphine awarded \"Love the Way You Lie\" four stars out of five. According to him, the song would not have been effective if it had featured only Eminem's point of view and feelings of regret; he wrote that Rihanna's representing the opposite side of the relationship shows \"proper storytelling\" and \"sends a message\" because of her breakup with Brown. McAlphine wrote that as a result the song depicts a more realistic abusive relationship and could be featured in a campaign for women's shelters. He praised Eminem's accuracy and understanding of the topic. Winston Robbins from Consequence of Sound attributed the song's poignancy to Rihanna's past abusive relationship, and a theme of infidelity and abuse.\n\nOn the critical side, The Daily Telegraph's Jenny McCartney dismissed the metaphors in the chorus and thought the song's topic was over-hyped. She disagreed with the critical praise, arguing that women accept abusive relationships for deeper reasons than sexual and emotional pleasure, such as family and financial issues and helplessness. In an NPR article, the writer Maura Johnston commented that the lyrics portray Rihanna as the subject of Eminem's violence. Jay Smooth, a New York radio personality, responded that \"while Eminem explores the psyche of the abuser with an almost disturbing amount of depth and detail,\" Rihanna's perspective is downplayed and not explained fully. Johnston and Smooth wrote that such imbalances are a prevalent issue in popular music duets. To Sady Doyle, although \"Love the Way You Lie\" is one of Eminem's most affecting tracks and finds him remorseful, it does not make up for his past misogynistic actions and hateful songs. Noveck questioned whether the lyrics are \"a treatise against (or apology for) domestic violence, or an irresponsible glorification of it? Or, is it something uncomfortable in between?\n\nMarjorie Gilberg, executive director of the anti-teenage violence group Break the Cycle, commented that \"Love the Way You Lie\" can teach listeners about the dangers of abusive relationships if interpreted correctly. She believed that because popular culture often depicts what is socially acceptable, people may accept such violence more easily. She added, \"One problem, though, ... is that the song reflects myths about domestic violence—myths that lead to blaming the victim. Gilberg said the victim is often accused of being as guilty as the partner but wants to be loved, not abused. Terry O'Neill, a feminist and the president of the National Organization for Women, criticized the lyric, \"But your temper's just as bad as mine is \/ You're the same as me\", saying it is a typical excuse used by abusive men for aggression and that \"it's only 2-year-olds and violent men who use violence to get what they want. She added that Rihanna unintentionally glorifies domestic violence in the song despite attempting to fight it\n\n\"Love the Way You Lie\" ranked in various best-of-2010 lists. Claire Suddath of Time placed it at number five on her top-ten list and wrote, \"That this song didn't come across sounding clichéd or tasteless is a testament to both artists' skill. AOL Radio considered the song the best of 2010 hip hop music, regarding Eminem as imaginative and passionate. It ranked ninth on MTV News' top-twenty-five list. Its editor James Montgomery attributed the song's success to its theme and relation to the artists' past abusive relationships. He concluded, \"You cannot write a song any better than that, because that's how this kind of thing happens in real life. The New York Post placed the song at second place on their \"top 210 songs from 2010\" list and regarded it as a \"comeback club anthem. In April 2011, Gabriel Alvarez of Complex magazine ranked it at number 100 on their \"100 Best Eminem Songs\" list, calling it a love song and praising Rihanna's vocals as beautiful.  \"Love the Way You Lie\" and its accompanying music video were nominated for five Grammy Awards at the 2011 ceremony, including \"Record of the Year\", \"Song of the Year\" and \"Best Short Form Music Video\". It won the People's Choice Awards for \"Favorite Music Video\" and \"Favorite Song\".\n\n\"Love the Way You Lie\" reached number one on several record charts worldwide.  It entered the United States' Billboard Hot 100 at number two in the issue dated July 10, 2010.[59] The single debuted at number one on the US Digital Songs after selling 338,000 digital copies in its first week. From July 31 to September 11, 2010, it had a seven-week run at the top of the Hot 100, giving Eminem his fourth, and Rihanna her seventh, number-one US hit. The single sold more than 300,000 digital copies in the week of August 14, 2010, rising to number two on the Pop Songs and Radio Songs charts. In the Billboard issue for August 21, 2010, Nielsen Broadcast Data Systems recognized the single with the BDS Certified Award for 50,000 radio spins. It topped the Pop Songs chart in the same issue,[64] giving Eminem his third number-one track on the chart and Rihanna her sixth. \"Love the Way You Lie\" was the first number-one hit on the Rap Songs chart with Eminem as the lead artist since his 2000 single \"The Real Slim Shady\".[66] With sales of 4,245,000 copies, \"Love the Way You Lie\" was the third-best-selling single of 2010 in the US. There, it sold 6 million copies by October 2013 and 6.5 million copies by October 2015.\n\nThe song entered the Australian Singles Chart on July 4, 2010, at number fourteen. It rose to the top three weeks later, occupying the position for six weeks and staying on the chart for 38 weeks in total. In Austria, \"Love the Way You Lie\" debuted at number 31, on July 2, 2010, and ascended to number one on September 4. After making a final consecutive appearance on March 4, 2011, it reappeared at number 75 on August 26. The song spent 47 weeks on the chart. \"Love the Way You Lie\" charted for 30 weeks in France, where debuted and peaked at number three on July 2, 2010.  It was South Korea's third-best-selling song in 2010 by a foreign artist, with 1,200,653 downloads.\n\nOn the UK Singles Chart, the song debuted at number seven on June 27, 2010, and peaked at number two four weeks later. By the end of 2010,\"Love the Way You Lie\" had sold 854,000 copies in the UK, making it the country's biggest-selling song of the year. It is the only song to top the year-end chart without topping the weekly charts. In October 2011, it became the 109th song to reach 1 million sales there. By November 2012, the single had sold 1.05 million copies in the UK, placing at number 100 on the Official Charts Company's \"The Million Sellers\" list. As of June 2015, it is the 17th best-selling single of the 2010s in the UK. According to the International Federation of the Phonographic Industry, \"Love the Way You Lie\" sold 9.3 million copies worldwide in 2010. In December 2011, it was certified as Eminem's best-selling single. <a href=\"http:\/\/www.last.fm\/music\/Eminem\/_\/Love+The+Way+You+Lie\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}