{
  "created_at": "2025-05-03T14:42:50.411089+00:00",
  "elapsed": 0.21305,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:42:50.411089+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4328",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:42:50 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Laufey&format=json&method=track.getInfo&track=Santa+Baby"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Laufey&format=json&method=track.getInfo&track=Santa+Baby",
  "_decoded_content": {
    "track": {
      "name": "Santa Baby",
      "url": "https:\/\/www.last.fm\/music\/Laufey\/_\/Santa+Baby",
      "duration": "182000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "211658",
      "playcount": "879578",
      "artist": {
        "name": "Laufey",
        "url": "https:\/\/www.last.fm\/music\/Laufey"
      },
      "album": {
        "artist": "Laufey",
        "title": "A Very Laufey Holiday: The Santa Baby Edition",
        "url": "https:\/\/www.last.fm\/music\/Laufey\/A+Very+Laufey+Holiday:+The+Santa+Baby+Edition",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/6d56b230fab4489e193040c67c14a88c.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/6d56b230fab4489e193040c67c14a88c.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/6d56b230fab4489e193040c67c14a88c.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/6d56b230fab4489e193040c67c14a88c.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "christmas",
            "url": "https:\/\/www.last.fm\/tag\/christmas"
          },
          {
            "name": "xmas",
            "url": "https:\/\/www.last.fm\/tag\/xmas"
          },
          {
            "name": "holiday",
            "url": "https:\/\/www.last.fm\/tag\/holiday"
          },
          {
            "name": "gen z singer-songwriter",
            "url": "https:\/\/www.last.fm\/tag\/gen+z+singer-songwriter"
          }
        ]
      },
      "wiki": {
        "published": "08 Nov 2024, 18:46",
        "summary": "Laufey, an Icelandic-Chinese singer-songwriter and multi-instrumentalist known for blending jazz with pop and classical influences, released her rendition of the holiday classic \"Santa Baby\" in 2023. Originally written by Joan Javits and Philip Springer in 1953 and popularized by Eartha Kitt, \"Santa Baby\" has become a timeless Christmas staple, known for its playful, sultry tone and unique jazz arrangement. Laufey's cover brings a fresh, contemporary spin to the track <a href=\"http:\/\/www.last.fm\/music\/Laufey\/_\/Santa+Baby\">Read more on Last.fm<\/a>.",
        "content": "Laufey, an Icelandic-Chinese singer-songwriter and multi-instrumentalist known for blending jazz with pop and classical influences, released her rendition of the holiday classic \"Santa Baby\" in 2023. Originally written by Joan Javits and Philip Springer in 1953 and popularized by Eartha Kitt, \"Santa Baby\" has become a timeless Christmas staple, known for its playful, sultry tone and unique jazz arrangement. Laufey's cover brings a fresh, contemporary spin to the track, balancing her signature jazz stylings with a nostalgic nod to the song's original charm.\n\nLaufey's version of \"Santa Baby\" follows a trend she’s established of reinterpreting classic standards with a modern, personal twist, highlighting her rich vocal tone and accomplished musicianship. Her background as a jazz cellist and vocalist adds layers to the arrangement, which leans into the genre's classic textures while showcasing her distinctive blend of jazz and pop. Laufey's cover of \"Santa Baby\" underscores her growing reputation for revitalizing jazz music, particularly among a younger audience drawn to her retro yet contemporary sound.\n\nProduced in collaboration with her frequent producer Spencer Stewart, Laufey's \"Santa Baby\" features lush instrumentals and a smooth, minimal arrangement that allows her vocals to shine. Known for her attention to detail in production, Laufey co-produced the track to highlight the song’s cheeky, flirtatious lyrics without overshadowing the melody’s classic simplicity. The song was released as a holiday single in November 2023 and became a seasonal favorite among fans, quickly finding a place on Christmas playlists alongside other renditions of the iconic tune.\n\n\"Santa Baby\" has been covered by numerous artists across genres since Eartha Kitt's original release, with notable versions by Madonna, Kylie Minogue, and Ariana Grande, each bringing their own interpretation to the song's playful spirit. Laufey’s version, however, stands out for its commitment to jazz roots while infusing a warm, intimate vocal delivery that has resonated with both long-time jazz enthusiasts and newer fans alike. Critics praised Laufey's nuanced performance and her ability to give a timeless classic a refreshingly personal touch, further cementing her role in bringing jazz influences into the mainstream pop sphere. <a href=\"http:\/\/www.last.fm\/music\/Laufey\/_\/Santa+Baby\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}