{
  "created_at": "2025-05-03T14:31:27.720921+00:00",
  "elapsed": 0.235335,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:31:27.720921+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "10281",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:31:28 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Lizzo&format=json&method=track.getInfo&track=Truth+Hurts"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Lizzo&format=json&method=track.getInfo&track=Truth+Hurts",
  "_decoded_content": {
    "track": {
      "name": "Truth Hurts",
      "url": "https:\/\/www.last.fm\/music\/Lizzo\/_\/Truth+Hurts",
      "duration": "173000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "636955",
      "playcount": "6134573",
      "artist": {
        "name": "Lizzo",
        "mbid": "50d06c43-5392-4393-ba2d-f091d8167227",
        "url": "https:\/\/www.last.fm\/music\/Lizzo"
      },
      "album": {
        "artist": "Lizzo",
        "title": "Truth Hurts",
        "url": "https:\/\/www.last.fm\/music\/Lizzo\/Truth+Hurts",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/15034a6ac592d2706b4ef61d334e410d.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/15034a6ac592d2706b4ef61d334e410d.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/15034a6ac592d2706b4ef61d334e410d.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/15034a6ac592d2706b4ef61d334e410d.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          },
          {
            "name": "rnb",
            "url": "https:\/\/www.last.fm\/tag\/rnb"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "trap",
            "url": "https:\/\/www.last.fm\/tag\/trap"
          }
        ]
      },
      "wiki": {
        "published": "08 Oct 2019, 17:54",
        "summary": "\"Truth Hurts\" is a song released by American singer and rapper Lizzo. It was originally released on September 19, 2017, by Nice Life Recording Company and Atlantic Records, but then re-released as a radio single in mid March 2019. It was written by Lizzo, Jesse Saint John, Steven Cheung (better known as Tele), and Ricky Reed, the latter two having co-produced the track.\n\nMusic journalists have defined \"Truth Hurts\" as trap, hip-hop, and pop. Though it did not chart at the time of its release <a href=\"http:\/\/www.last.fm\/music\/Lizzo\/_\/Truth+Hurts\">Read more on Last.fm<\/a>.",
        "content": "\"Truth Hurts\" is a song released by American singer and rapper Lizzo. It was originally released on September 19, 2017, by Nice Life Recording Company and Atlantic Records, but then re-released as a radio single in mid March 2019. It was written by Lizzo, Jesse Saint John, Steven Cheung (better known as Tele), and Ricky Reed, the latter two having co-produced the track.\n\nMusic journalists have defined \"Truth Hurts\" as trap, hip-hop, and pop. Though it did not chart at the time of its release, it later became a viral sleeper hit in 2019 after gaining popularity on the TikTok video sharing app and being used on the Netflix movie Someone Great. The song was included as a bonus track on the deluxe version of Lizzo's third studio album \"Cuz I Love You\" and reached number one on the Billboard Hot 100, becoming Lizzo's first song to do so. She followed Lauryn Hill and Cardi B as the only female rappers to achieve that with a solo song. It spent seven weeks at number one, becoming the longest-running number-one for a solo song by a female rapper, earning her a Guinness World Record. The accompanying music video stars Lizzo playing a bride that marries herself.\n\nDespite being released in 2017, the song was eligible for the 62nd Annual Grammy Awards in 2020, being nominated for three awards, including Record of the Year and Song of the Year, winning the remaining award for Best Pop Solo Performance. The song has been certified 7× platinum by the Recording Industry Association of America (RIAA). Rolling Stone listed it as the 24th best song of the decade, and Billboard included it among the 100 songs that defined the decade. In 2021 it was included in Rolling Stone's 500 Greatest Songs of All Time.\n\nIn the United States \"Truth Hurts\" became a sleeper hit two years after its release; the song was originally released in September 2017 and eventually charted in the spring of 2019. On the US Billboard Hot 100 chart, the song debuted at number 50 on the week ending May 18, 2019. Its high debut was due to a Billboard rule that affects songs older than one year from entering the Hot 100 unless obtaining a substantial number of chart points. The track reached number one in September 2019, becoming Lizzo's first number one song in the United States. \"Truth Hurts\" became the third solo song by a female rapper to top the Hot 100, following Lauryn Hill's \"Doo Wop (That Thing)\" and Cardi B's \"Bodak Yellow\". On its fourth week at number one, it became the longest-leading rap number one single by a female artist unaccompanied by another act in the chart's history, surpassing Cardi B's three-week reign with \"Bodak Yellow\" in October 2017. It spent seven non-consecutive weeks at number one, tying Iggy Azalea's \"Fancy\", featuring Charli XCX, for the longest-leading rap song by a female artist on the chart.[15] On November 2, 2019, it was replaced by \"Someone You Loved\" by Lewis Capaldi.\n\n\"Truth Hurts\" debuted at number 33 on Mainstream Top 40 following its entry on the Hot 100 and reached number one, giving Lizzo her first chart topper on that chart. The song also hit number one on the US Rhythmic chart, where it became Lizzo's first Billboard chart topper; and one of five songs to reach number one with a 5-1 jump on that chart since its October 1992 inception. On Billboard's Dance\/Mix Show Airplay, the single became her first top 10, and also reached number one in September 2019 (spending nine weeks, the most ever for a Rap song recorded by a female Rap artist since its 2003 inception), eclipsing \"Juice\" which peaked at number 25 in May 2019. In Canada, \"Truth Hurts\" opened at number 43 on the Hot 100 for the week ending May 18, 2019; it has since peaked at number seven.\n\nIn the United Kingdom, \"Truth Hurts\" has debuted at number 67 on the UK Singles Chart on the week ending May 9, 2019, later peaking at number 29 on the week ending September 19, 2019. In Belgium, the song entered the top 10 of the Belgian Singles Chart, at number two, becoming Lizzo's first and highest-charting entry in the country. The song also entered the top 10 of the Belgium Urban Singles Chart, at number nine, also becoming her first and highest-charting entry on the chart, respectively.\n\nIn New Zealand, \"Truth Hurts\" peaked at number five on the New Zealand Singles Chart. In Australia, the song entered the top 30, at number 21 on the week ending May 25, 2019. It has since reached number 15 there.\n\nAshley Monaé, writing for Pitchfork, stated the song contains \"sobering moments of truth where Lizzo’s charisma wins us over and sets her apart.\" DIY magazine wrote that the song \"continues to show off her relatable rap.\" Rolling Stone staff stated that \"yes, 'Truth Hurts' came out in 2017, but there's no denying the song's effect on not just Lizzo's career but the entire year in culture\", and added that Lizzo \"exhibits the ultimate form of self-care\" on an \"unstoppable breakup anthem.\"\n\nA music video was released to accompany \"Truth Hurts\", styled by Brooke Candy. It depicts the singer at a wedding, then leaving the groom at the altar. The video finishes with the singer marrying herself, followed by a dance party. Scenes of the singer in lingerie are interspersed throughout the video. As of July 2022, the music video has amassed more than 290 million views on YouTube.\n\nLizzo performed \"Truth Hurts\" at the 2019 BET Awards. She opened the number on top of a big wedding cake wearing a white veil and a lacy white teddy, surrounded by dancers also wearing wedding dresses with bouquets in hands. The performance included a flute solo; \"two bright trills\" according to Classic FM. She also performed at the 2019 MTV Video Music Awards in a medley. She opened the VMAs performance wearing a cowgirl attire surrounded by dancers in front of an \"inflatable ass\" bouncing to the beat. Then, wearing a neon yellow leotard, she transitioned into \"Good as Hell\" with digital clouds in the background. In Rolling Stone, Rob Sheffield opined that Taylor Swift, Missy Elliott and Lizzo \"saved\" the ceremony, further adding that Lizzo \"stole the show\". Writing for Esquire, Matt Miller said that, \"If there was a star-making performance of the night it was this one, an unforgettable moment that I'm hoping we'll see at more award shows\".\n\nLizzo performed \"Truth Hurts\" on December 22, 2019, on Saturday Night Live accompanied by an all-female live band. For the intro, her guitarist Celisse Henderson paid homage to Sister Rosetta Tharpe by playing an altered version of the song's lead melody on a cream-colored Gibson SG Custom.\n\nOn January 26, 2020, Lizzo opened the 62nd Annual Grammy Awards with a medley of \"Cuz I Love You\" and \"Truth Hurts\". After performing \"Cuz I Love You\", ballerinas wearing do-rags appeared on stage as she changed into a Tron-esque, glow-in-the-dark bodysuit to perform \"Truth Hurts\". The Washington Post editors considered it \"a classic Lizzo number, as she also dazzled the crowd by breaking out her flute for a solo\". In USA Today, Patrick Ryan opined that the performance showed that \"she's one of the most joyful entertainers in music right now\". Rolling Stone editors opined that she \"topped the whole thing off with five words that made the performance a mic-drop for the ages: \"Welcome to the Grammys, bitch!\"\". The three publications ranked it among the best performances of the ceremony. She also performed a medley of \"Cuz I Love You\", \"Truth Hurts\", \"Good as Hell\" and \"Juice\" at the 2020 Brit Awards.\n\nLizzo performed the song on the season 45 episode of Saturday Night Live hosted by former cast member Eddie Murphy.\n\nThe song's lyrics in which she references the Minnesota Vikings were edited out by one station: Top 40\/CHR WIXX in Green Bay, due to the Packers' rivalry with them and the station broadcasting games on the Packers Radio Network. Atlantic allowed the station to make changes to the song and was ultimately \"cool with it\" when it came to the adjustment.\n\nIn a 2020 episode of the American game show Jeopardy!, host Alex Trebek recited the lyrics as a clue in the category \"Lyrics of Today.\" Once a contestant gave the correct answer, Trebek quipped, \"I did it exactly like (Lizzo) does, didn't I?\" <a href=\"http:\/\/www.last.fm\/music\/Lizzo\/_\/Truth+Hurts\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}