{
  "created_at": "2025-05-03T14:42:30.696644+00:00",
  "elapsed": 0.325329,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:42:30.696644+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "3903",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:42:31 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Tate+McRae&format=json&method=track.getInfo&track=Purple+lace+bra"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Tate+McRae&format=json&method=track.getInfo&track=Purple+lace+bra",
  "_decoded_content": {
    "track": {
      "name": "purple lace bra",
      "url": "https:\/\/www.last.fm\/music\/Tate+McRae\/_\/purple+lace+bra",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "204114",
      "playcount": "2464585",
      "artist": {
        "name": "Tate McRae",
        "url": "https:\/\/www.last.fm\/music\/Tate+McRae"
      },
      "toptags": {
        "tag": [
          {
            "name": "amazing",
            "url": "https:\/\/www.last.fm\/tag\/amazing"
          },
          {
            "name": "fav",
            "url": "https:\/\/www.last.fm\/tag\/fav"
          },
          {
            "name": "soty",
            "url": "https:\/\/www.last.fm\/tag\/soty"
          },
          {
            "name": "diet pepsi",
            "url": "https:\/\/www.last.fm\/tag\/diet+pepsi"
          },
          {
            "name": "rhodacore",
            "url": "https:\/\/www.last.fm\/tag\/rhodacore"
          }
        ]
      },
      "wiki": {
        "published": "22 Feb 2025, 20:40",
        "summary": "Tate McRae wants to be heard on “Purple lace bra,” even if it means sexualizing herself to do so. To the average listener, the track may just be about another relationship, but if you take a closer look, “Purple lace bra” describes the media’s misperception of Tate.\n\nIn collaboration with Amy Allen, Tate “dances on the fine line of sensual but heartbreaking.”\n\n“Well, ‘Purple lace bra,’ I actually was on a, I had taken my first break of the year on tour <a href=\"http:\/\/www.last.fm\/music\/Tate+McRae\/_\/purple+lace+bra\">Read more on Last.fm<\/a>.",
        "content": "Tate McRae wants to be heard on “Purple lace bra,” even if it means sexualizing herself to do so. To the average listener, the track may just be about another relationship, but if you take a closer look, “Purple lace bra” describes the media’s misperception of Tate.\n\nIn collaboration with Amy Allen, Tate “dances on the fine line of sensual but heartbreaking.”\n\n“Well, ‘Purple lace bra,’ I actually was on a, I had taken my first break of the year on tour, and I had written in my diary, I was sitting in front of the ocean, and I had written in my diary like, ‘Would you hear me more if I acted like this? Would you hear me more if I was?’ And I was like, ‘What does that mean? What am I feeling right now?’ And what I realized that I was feeling after being on tour all year and after seeing so many videos of my face and my body and just everything, I felt like my relationship with the media had been really fucked up in my brain, being like sometimes feeling like the most, you know, craziest clips would be of me dancing. And then you just see people put all their opinions on it. And then I’d be like, Okay, but you’re missing the point of the show or you’re missing 95% of the show or you’re missing the point of the song,‘ and I just sometimes felt like people weren’t hearing me. And they were just like looking at me and making an assumption and they weren’t hearing me. And then I feel like I released a music video and also just experienced for the first time me being like, 'Oh, this is, felt like just art to me,’ I was looking at the camera shots and the lighting and the dancing and the feeling of it. And then you see another person who just, like, takes it in a completely different way as a girl. And I was just like, ‘Oh, like, wow, I’m really frustrated. Because I feel like I’m getting nowhere with this, and no one’s actually understanding what I’m trying to say.’ And so this song was kind of just, we kind of took it into a relationship, me and Amy Allen, of being like, ‘Would you hear me more if I talked to you? We’re having sex.’ And it was a really interesting concept to tap into, to be like, ‘I’ve been giving you everything and I’ve been telling you everything and you’re still not hearing me, so how can I make it so you finally hear me?’ So it was like, it’s so funny because it’s such a sensual song, but really, like, heartbreaking.“\n\n—via Track By Track <a href=\"http:\/\/www.last.fm\/music\/Tate+McRae\/_\/purple+lace+bra\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}