{
  "created_at": "2025-05-03T14:43:27.814113+00:00",
  "elapsed": 0.197258,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:43:27.814113+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4541",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:43:28 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=TINI&format=json&method=track.getInfo&track=La+Loto"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=TINI&format=json&method=track.getInfo&track=La+Loto",
  "_decoded_content": {
    "track": {
      "name": "La Loto",
      "url": "https:\/\/www.last.fm\/music\/tINI\/_\/La+Loto",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "89347",
      "playcount": "1120792",
      "artist": {
        "name": "tINI",
        "mbid": "57da1b6b-808d-4f87-9528-dc5e2023eab6",
        "url": "https:\/\/www.last.fm\/music\/tINI"
      },
      "toptags": {
        "tag": [
          {
            "name": "Reggaeton",
            "url": "https:\/\/www.last.fm\/tag\/Reggaeton"
          },
          {
            "name": "neoperreo",
            "url": "https:\/\/www.last.fm\/tag\/neoperreo"
          }
        ]
      },
      "wiki": {
        "published": "11 Mar 2023, 01:18",
        "summary": "\"La Loto\" (transl. \"The Lotto\") is a song by Argentine singer Tini, American singer Becky G and Brazilian singer Anitta. It was released on July 6, 2022 by Sony Music Latin and Hollywood Records as the seventh single from Tini's upcoming fourth studio album, Cupido (2023). The song was written by the three singers alongside Elena Rose, while Andrés Torres and Mauricio Rengifo handled composition and production.\n\nLyrically, the song revolves around sex, or \"sinning\" as the girls call it in the chorus, with themes of female empowerment. <a href=\"http:\/\/www.last.fm\/music\/tINI\/_\/La+Loto\">Read more on Last.fm<\/a>.",
        "content": "\"La Loto\" (transl. \"The Lotto\") is a song by Argentine singer Tini, American singer Becky G and Brazilian singer Anitta. It was released on July 6, 2022 by Sony Music Latin and Hollywood Records as the seventh single from Tini's upcoming fourth studio album, Cupido (2023). The song was written by the three singers alongside Elena Rose, while Andrés Torres and Mauricio Rengifo handled composition and production.\n\nLyrically, the song revolves around sex, or \"sinning\" as the girls call it in the chorus, with themes of female empowerment. Tini opens the song by singing about being in a party, saying : \"Today we're sweating off all the makeup [...] This now looks like our runway\". Anitta takes the second verse: \"I fly directly from Miami to Rio [...] I brought Tini, we're gonna make a tremendous mess\" before stating \"Diamonds shining from head to toe\/ The one that's with me won the lotto\". Finally, Gomez sings the third verse: \"We got all the drip, drip, all of Gucci-cci\", and referencing the couple Lele Pons and Guaynaa, followed by \"Short dress with nothing under\/ This is what I work for\". In the chorus, the girls state that they don't care about other people's opinions, and that \"Tonight it seems we're sinning\/ Tomorrow we go confess\". The line \"The baby with me won the lotto\" expresses female empowerment, with the girls alluding to being the biggest and best prize their partners could have.\n\nThe music video for \"La Loto\" was shoot in Los Angeles. It was directed by Argentine director Diego Peskins and Venezuelan director Daniel Duran, who have worked with the singers on their previous songs. The music video include the golden, vintage-style. In interview with Rolling Stone, Tini described the video as a “burlesque”-style visual and add: \"This video has an aesthetic that is quite vintage, like a burlesque, like Moulin Rouge, as in the old times. The song makes you feel powerful and I think that’s what each of us wants to convey on the set.”, while Becky G said: “This video is so 'fire'. The concept, the visuals, the outfits, the hair, the looks, the makeup, it’s serving for sure.”\n\nAt the beginning of the music video, we see Tini sitting in front of the mirror doing her makeup. She then starts walking and behind her are shown Becky G and Anitta who are also arranged. Then we see Tini in a reflective black outfit with golden sunglasses and a pink fur coat walking into a bar. A few dancers come up to her and help her take off her fur coat, while she glamorously walks in the bar, greeting the rest of the dancers. She then finds herself on stage and begins to dance where she is joined by dancers. Then comes Anitta dancing at the bar, and around her we can see dancers and waiters offering her a drink. Then comes Becky G sitting on the sofa surrounded by pearls and jewellery, with masqueraded backup dancers. The thre three Latinas are shown together, decked in an all-gold wardrobe, mirroring each other as they cross their legs in unison, showing off their signature 'badass attitude', and getting glammed up over the reggaetón beat. The trio is also shown dancing on stage, giving us a taste of what winning the lottery must feel like. <a href=\"http:\/\/www.last.fm\/music\/tINI\/_\/La+Loto\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}