{
  "created_at": "2025-05-03T14:30:21.368821+00:00",
  "elapsed": 0.207343,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:30:21.368821+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5479",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:30:21 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Eminem&format=json&method=track.getInfo&track=Killshot"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Eminem&format=json&method=track.getInfo&track=Killshot",
  "_decoded_content": {
    "track": {
      "name": "KILLSHOT",
      "url": "https:\/\/www.last.fm\/music\/Eminem\/_\/KILLSHOT",
      "duration": "253000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "277456",
      "playcount": "2441555",
      "artist": {
        "name": "Eminem",
        "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4",
        "url": "https:\/\/www.last.fm\/music\/Eminem"
      },
      "album": {
        "artist": "Eminem",
        "title": "KILLSHOT",
        "url": "https:\/\/www.last.fm\/music\/Eminem\/KILLSHOT",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/8362b83675cfb9999891488c9bcdb9c7.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/8362b83675cfb9999891488c9bcdb9c7.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/8362b83675cfb9999891488c9bcdb9c7.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/8362b83675cfb9999891488c9bcdb9c7.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          },
          {
            "name": "Diss",
            "url": "https:\/\/www.last.fm\/tag\/Diss"
          },
          {
            "name": "Eminem",
            "url": "https:\/\/www.last.fm\/tag\/Eminem"
          },
          {
            "name": "MySpotigramBot",
            "url": "https:\/\/www.last.fm\/tag\/MySpotigramBot"
          }
        ]
      },
      "wiki": {
        "published": "14 Jul 2021, 01:00",
        "summary": "\"Killshot\" (stylized in all caps) is a diss track by American rapper Eminem and produced by IllaDaProducer.[1] The song is Eminem's response to Machine Gun Kelly's \"Rap Devil\" that was released in 2018 after Eminem dissed MGK in his song \"Not Alike\" from his tenth studio album Kamikaze. The song received positive reception for its lyrics and production. Following the release of \"Killshot\" Machine Gun Kelly admitted he could not respond to the song with an additional diss track and criticized it in interviews. <a href=\"http:\/\/www.last.fm\/music\/Eminem\/_\/KILLSHOT\">Read more on Last.fm<\/a>.",
        "content": "\"Killshot\" (stylized in all caps) is a diss track by American rapper Eminem and produced by IllaDaProducer.[1] The song is Eminem's response to Machine Gun Kelly's \"Rap Devil\" that was released in 2018 after Eminem dissed MGK in his song \"Not Alike\" from his tenth studio album Kamikaze. The song received positive reception for its lyrics and production. Following the release of \"Killshot\" Machine Gun Kelly admitted he could not respond to the song with an additional diss track and criticized it in interviews.\n\nBackground and release\nIn 2012, Machine Gun Kelly made a tweet about Eminem's daughter, Hailie Mathers (who was then sixteen). The tweet read, \"ok so I just saw a picture of Eminem's daughter...and I have to say, she is hot as fuck, in the most respectful way possible cuz Em is king\". MGK claimed to apologize to Eminem behind the scenes. After this, in 2015, Eminem allegedly banned him from going to Shade 45, a radio station owned by Eminem. In 2017, MGK was on Power 106 FM and did a freestyle with The LA Leakers. During this, he again claimed Eminem had banned him from Shade 45. MGK also collaborated on a song with Tech N9ne in March 2018, and sent subliminal disses towards Eminem. On August 31, 2018, Eminem released a surprise album Kamikaze in which he dissed several artists, including MGK.\n\nOn the song \"Not Alike\" from Eminem's album Kamikaze, Eminem made several disses aimed at MGK. 2 days later, MGK responded to \"Not Alike\" with the song \"Rap Devil\", releasing a music video for the song as well on September 3, 2018. After MGK's response, Eminem released an interview with Sway Calloway, in which Eminem was asked about the feud. Eminem explained that he did not want to respond initially, because it would just benefit MGK's exposure. On September 14, 2018, Eminem released \"Killshot\". On September 19, 2018, the song was officially released as a single.\n\nCommercial performance\n\"Killshot\" debuted at number three on the US Billboard Hot 100 in its first week[3] after gaining over 38.1 million views within the first 24 hours of releasing on YouTube, making it the nineteenth most-viewed video in the first 24 hours, and the most for an audio only release on the YouTube platform.[4] It also held the biggest YouTube debut for a hip hop video ever, surpassing Kanye West's and Lil Pump's \"I Love It\", beating the record just the week before.[5] This was beaten by 6ix9ine's debut of \"Gooba\" in 2020.[6][7]\n\nAs of June 29, 2021, \"Killshot\" has been viewed on YouTube over 395 million times.\n\nResponse\nMachine Gun Kelly responded in a tweet, criticizing Eminem for what he perceived as a slow response. Rapper Jay Electronica criticized Eminem for a line in the song where he jokingly accused Diddy of having Tupac killed. After this, Electronica deactivated his social media profiles. Rapper Iggy Azalea's name was dropped in the song and she let out a series of tweets reacting to and criticizing the lyrics, calling the bars \"lazy\". Halsey also responded to her name being dropped in reference to her relationship with rapper G-Eazy in a tweet saying, \"I'm jus saying my pops had to hear a grown man talk about his daughter getting f**ked while that man simultaneously defended his own daughter.\" She later added, \"I'm not proud. I just don't care. They can argue about record sales. My album sold more copies than each of theirs\". referring to her album Hopeless Fountain Kingdom, <a href=\"http:\/\/www.last.fm\/music\/Eminem\/_\/KILLSHOT\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}