{
  "created_at": "2025-05-03T14:33:20.444748+00:00",
  "elapsed": 0.19466,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:33:20.444748+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4294",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:33:20 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=twenty+one+pilots&format=json&method=track.getInfo&track=Level+of+Concern"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=twenty+one+pilots&format=json&method=track.getInfo&track=Level+of+Concern",
  "_decoded_content": {
    "track": {
      "name": "Level Of Concern",
      "url": "https:\/\/www.last.fm\/music\/Twenty+One+Pilots\/_\/Level+Of+Concern",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "341318",
      "playcount": "3960506",
      "artist": {
        "name": "Twenty One Pilots",
        "mbid": "a6c6897a-7415-4f8d-b5a5-3a5e05f3be67",
        "url": "https:\/\/www.last.fm\/music\/Twenty+One+Pilots"
      },
      "toptags": {
        "tag": [
          {
            "name": "2020",
            "url": "https:\/\/www.last.fm\/tag\/2020"
          },
          {
            "name": "2020s",
            "url": "https:\/\/www.last.fm\/tag\/2020s"
          },
          {
            "name": "indie",
            "url": "https:\/\/www.last.fm\/tag\/indie"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "alternative",
            "url": "https:\/\/www.last.fm\/tag\/alternative"
          }
        ]
      },
      "wiki": {
        "published": "09 Apr 2020, 22:42",
        "summary": "\"Level of Concern\" is a song written by Tyler Joseph and performed by Twenty One Pilots (Tyler Joseph and Josh Dun) for the fans in light of recent events caused by the COVID-19 pandemic, acknowledging the helplessness many feel during quarantine. \n\nAccording to a Twitter thread by radio station KISS 107.1 Cincinnati about the backstory of the song, Joseph's mother was the initial inspiration for the song. With the pandemic and his experience as a new dad now in lockdown in mind <a href=\"http:\/\/www.last.fm\/music\/Twenty+One+Pilots\/_\/Level+Of+Concern\">Read more on Last.fm<\/a>.",
        "content": "\"Level of Concern\" is a song written by Tyler Joseph and performed by Twenty One Pilots (Tyler Joseph and Josh Dun) for the fans in light of recent events caused by the COVID-19 pandemic, acknowledging the helplessness many feel during quarantine. \n\nAccording to a Twitter thread by radio station KISS 107.1 Cincinnati about the backstory of the song, Joseph's mother was the initial inspiration for the song. With the pandemic and his experience as a new dad now in lockdown in mind, Joseph decided to write about \"the last time he felt this out of control.\" Choosing to turn the song into a love song about his wife, Jenna Joseph, Joseph \"compares this time of little control to that moment when he decided to commit to a life with Jenna & that uneasy feeling of realizing that when you make that kind of a commitment to someone else, you give up a good portion of control.\"\n\nThe song was first introduced in a Twitter thread by Joseph on April 5th, 2020, saying that he was \"always writing, but this one feels like it should just come out now.\" More information was revealed quickly afterwards in the thread, including the fact that this is the first song Joseph ever wrote on the electric guitar, and that the song wasn't entirely done yet, but would be released in the coming days. Additionally, Joseph announced that he wanted a portion of the proceeds made by \"Level of Concern\" to go to Crew Nation, a charity that provides funding for people who work in the live music industry but currently don't have a job. Joseph also expressed his hopes for live music to \"get back on its feet\" and for the song to help people in some way.\n\nThe release date of the song was announced in another tweet by Joseph on April 8th, 2020, along with a photo of a black USB wrapped in yellow tape and decorated with the title of the new song in stylized font. This would also be used as the album artwork. It was also revealed in the same tweet that a video would be accompanying the release. The exact time of release was not revealed, but multiple radio stations said the new song was expected to premiere at 9am Pacific Time \/ 12pm Eastern Time.\n\nBoth the video and the song premiered on YouTube and other music-listening platforms on April 9th, 2020 at 9am Pacific Time \/ 12pm Eastern Time. \n\nThe single does not currently seem to be part of a new album or explicitly related to the Dema storyline, and seems to instead be a standalone single, similar to Twenty One Pilots' \"Heathens\" release. However, the yellow tape on the USB is a clear callback to Trench (2018) and the red of the band logos in the announcement image is reminiscent of Blurryface (2015). Many surmise that this could be a transition period between two albums\/eras, just like \"Heathens\" was in 2016. <a href=\"http:\/\/www.last.fm\/music\/Twenty+One+Pilots\/_\/Level+Of+Concern\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}