{
  "created_at": "2025-05-03T14:39:21.688894+00:00",
  "elapsed": 0.223956,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:39:21.688894+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "6874",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:39:22 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Florence+%2B+The+Machine&format=json&method=track.getInfo&track=Dog+Days+Are+Over"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Florence+%2B+The+Machine&format=json&method=track.getInfo&track=Dog+Days+Are+Over",
  "_decoded_content": {
    "track": {
      "name": "Dog Days Are Over",
      "mbid": "772ea437-45b3-4868-b3c0-b80526ef0fa3",
      "url": "https:\/\/www.last.fm\/music\/Florence+%252B+the+Machine\/_\/Dog+Days+Are+Over",
      "duration": "252000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "2028308",
      "playcount": "22573757",
      "artist": {
        "name": "Florence + the Machine",
        "mbid": "5fee3020-513b-48c2-b1f7-4681b01db0c6",
        "url": "https:\/\/www.last.fm\/music\/Florence+%252B+the+Machine"
      },
      "album": {
        "artist": "Florence + the Machine",
        "title": "Lungs",
        "mbid": "11572329-7330-36eb-bcfb-787987c783be",
        "url": "https:\/\/www.last.fm\/music\/Florence+%252B+the+Machine\/Lungs",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/46def4fa25d2821f092448be01e639ea.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/46def4fa25d2821f092448be01e639ea.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/46def4fa25d2821f092448be01e639ea.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/46def4fa25d2821f092448be01e639ea.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "1"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "indie",
            "url": "https:\/\/www.last.fm\/tag\/indie"
          },
          {
            "name": "female vocalists",
            "url": "https:\/\/www.last.fm\/tag\/female+vocalists"
          },
          {
            "name": "alternative",
            "url": "https:\/\/www.last.fm\/tag\/alternative"
          },
          {
            "name": "indie pop",
            "url": "https:\/\/www.last.fm\/tag\/indie+pop"
          },
          {
            "name": "british",
            "url": "https:\/\/www.last.fm\/tag\/british"
          }
        ]
      },
      "wiki": {
        "published": "31 Aug 2009, 11:29",
        "summary": "\"Dog Days Are Over\" is a song by English indie rock band Florence and the Machine from their debut album \"Lungs\". It was originally scheduled for release on 24 November 2008 through Moshi Moshi Records in the UK as the album's second single, but was later pushed back for release on 1 December 2008. A day later on 2 December 2008 the single was released in download and seven-inch vinyl format through IAMSOUND Records in the US. The B-side to the single <a href=\"http:\/\/www.last.fm\/music\/Florence+%252B+the+Machine\/_\/Dog+Days+Are+Over\">Read more on Last.fm<\/a>.",
        "content": "\"Dog Days Are Over\" is a song by English indie rock band Florence and the Machine from their debut album \"Lungs\". It was originally scheduled for release on 24 November 2008 through Moshi Moshi Records in the UK as the album's second single, but was later pushed back for release on 1 December 2008. A day later on 2 December 2008 the single was released in download and seven-inch vinyl format through IAMSOUND Records in the US. The B-side to the single is a cover of \"You Got the Love\" by The Source featuring Candi Staton which later was confirmed as a track on their debut album and the band's fifth single. The single reached the top 30 in Canada, Ireland, the United Kingdom, and the United States.\n\nA demo version of \"Dog Days Are Over\" is featured on disc two of the deluxe edition of \"Lungs\". A six-minute, forty-second-long Optimo remix of \"Dog Days Are Over\" has also been made available. An acoustic version of the song was performed live on BBC Radio 1's Big Weekend. The track has been performed at a great number of high-profile festivals through 2008 and 2009, including the Reading and Leeds festivals. The band also performed the song on the Mercury Prize 2009 awards show and BBC Introducing.\n\n\"Dog Days Are Over\" was recorded with no instruments in a studio the \"size of a loo\". The song was inspired by a giant text installment titled \"Dog Days Are Over\" by artist Ugo Rondinone, which lead singer Florence Welch used to see every day, riding her bike over Waterloo Bridge. The song was produced and mixed by James Ford of Simian Mobile Disco and The Last Shadow Puppets, who is also famous for producing for the likes of Bloc Party and the Arctic Monkeys. He is also credited as playing piano and guitar on the record.\n\nWelch co-wrote the song with Isabella Summers, who is also credited as the song's co-producer, and played piano on the record. Welch and Summers also teamed up for the percussion on the track, together with Charlie Hugall. \"Dog Days Are Over\" also features musicians Tom \"Moth\" Monger (harp), Bruce White (viola), Everton Nelson (violin), Christopher Lloyd Hayden (drums) and Rob Ackroyd (guitar). Jimmy Robertson, extensively involved in the recording of the band's debut record Lungs, recorded and mixed \"Dog Days\" as well.\n\nThe song was re-released into the UK market on 11 April 2010, accompanied with a new video.\n\nOn 6 December 2008, \"Dog Days Are Over\" debuted at number 89 on the UK Singles Chart. The following week it dropped one place to number 90 before dropping out of the top 100. It then re-entered the chart a month later on 17 January 2009 at number 93 before dropping out of the chart again. Approximately four months later the single made another re-entry on 23 May 2009, this time at number 91.\n\nFollowing performances on Top of the Pops, Jools Holland and uses in television advertisement for Slumdog Millionaire and Eat, Pray, Love, \"Dog Days Are Over\" began to receive increasing amounts of digital downloads, despite not having been re-released. On 10 January 2010, \"Dog Days Are Over\" re-entered the UK Singles Chart at number 23, marking its highest peak to date. However, the following week, on 17 January 2010, the single fell one place to number 24. Following the single's official re-release in March 2010, it re-entered the UK Singles Chart at number 34 on 4 April 2010. The following week, the single rose to number 24 before dropping again.\n\nOn 15 January 2010, \"Dog Days Are Over\" entered the Irish Singles Chart for the first time, reaching a peak of number 35. This was the third Top 40 hit for Florence in Ireland. Following its re-release in March 2010, the single once again entered the Irish Singles Chart, this time climbing to number 24 and a week later to number 17. The following week, the single rose to number 15, and the week after, number 13. On 15 April 2010, the single entered the Top 10 at its peak position, number 6, making \"Dog Days Are Over\" Florence's fourth highest-charting single in Ireland, after \"Cosmic Love\" (number 3), \"Shake It Out\" (number 2), and \"Spectrum (Say My Name)\" (number 1).\n\nOn the week ending 25 September 2010, \"Dog Days Are Over\" debuted at number 93 on the Billboard Hot 100. Following the performance of \"Dog Days Are Over\" on the 2010 MTV Video Music Awards, the track sold 96,000 digital downloads which signified a 257% increase over the previous week and leaped to number 21 giving Florence her first top 30 hit on the Billboard Hot 100. As of June 2016, the song has sold over 3,151,000 downloads in the United States alone. <a href=\"http:\/\/www.last.fm\/music\/Florence+%252B+the+Machine\/_\/Dog+Days+Are+Over\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}