{
  "created_at": "2025-05-03T14:35:39.091167+00:00",
  "elapsed": 0.21641,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:35:39.091167+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4699",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:35:39 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Stray+Kids&format=json&method=track.getInfo&track=MIROH"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Stray+Kids&format=json&method=track.getInfo&track=MIROH",
  "_decoded_content": {
    "track": {
      "name": "MIROH",
      "url": "https:\/\/www.last.fm\/music\/STRAY+KIDS\/_\/MIROH",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "273065",
      "playcount": "5634119",
      "artist": {
        "name": "STRAY KIDS",
        "url": "https:\/\/www.last.fm\/music\/STRAY+KIDS"
      },
      "toptags": {
        "tag": [
          {
            "name": "Korean",
            "url": "https:\/\/www.last.fm\/tag\/Korean"
          },
          {
            "name": "k-pop",
            "url": "https:\/\/www.last.fm\/tag\/k-pop"
          },
          {
            "name": "EDM",
            "url": "https:\/\/www.last.fm\/tag\/EDM"
          },
          {
            "name": "Kpop",
            "url": "https:\/\/www.last.fm\/tag\/Kpop"
          },
          {
            "name": "dance",
            "url": "https:\/\/www.last.fm\/tag\/dance"
          }
        ]
      },
      "wiki": {
        "published": "18 Jun 2023, 13:56",
        "summary": "“미로 (lit. maze)”, known by the English title “MIROH” is the second track and lead-single track from Stray Kids’ fourth extended play Clé 1 : MIROH.\n\nUnbeknownst to majority of listeners, the song’s instrumental is a sample of producer DANK’s 2018 single “Jungle Boogie”. After Stray Kids purchased the song, DANK teamed up with them in order to make the song “MIROH”, in which they added vocals over the original song. DANK mentions the collab here.  <a href=\"http:\/\/www.last.fm\/music\/STRAY+KIDS\/_\/MIROH\">Read more on Last.fm<\/a>.",
        "content": "“미로 (lit. maze)”, known by the English title “MIROH” is the second track and lead-single track from Stray Kids’ fourth extended play Clé 1 : MIROH.\n\nUnbeknownst to majority of listeners, the song’s instrumental is a sample of producer DANK’s 2018 single “Jungle Boogie”. After Stray Kids purchased the song, DANK teamed up with them in order to make the song “MIROH”, in which they added vocals over the original song. DANK mentions the collab here. \n\n“MIROH” is an upbeat song about overcoming obstacles and persevering towards one's goals and dreams. The lyrics talk about traversing through difficult terrain, such as mountains, rivers, and jungles, metaphors for the obstacles life will throw your way in the pursuit of success. It shows the challenges and uncertainties that come with setting out on a new journey or venture. \nThe members describe being unsure of what to do at first, but they gain confidence and strength from pushing through these initial obstacles. They encourage listeners not to be discouraged by the traps and pitfalls that may come their way, and to keep moving forward no matter what. The overall theme co-insides with Stray Kids’ storyline; multiple youths trying to find their meaning and calling in life. In the music video, Stray Kids are depicted as rightful anarchists, overthrowing a seemingly evil government and reclaiming their own freedom.\n\nInterestingly, in the lyrics, member HAN name-drops British survival expert Bear Grylls OBE, who is infamous for eating grub and other kinds of live vermin in the means of teaching survival skills in the wild. \n“Imma Bear Grylls anything that blocks my dream, I'm going to eat it up”; only hours after the song’s release, Bear Grylls quote tweeted a post about the lyric made by a Bear Grylls fan, where he said “😁 nice song”. HAN responded to this tweet via Stray Kids’ Twitter account, saying “Thank you for the compliment Bear! Such a great honor.. Stray Kids are big fans of yours so you left us breathless for a moment! Glad you enjoyed the song, would you like to give the MIROH CHALLENGE a try? Haha”.\n\n“Everyone has their own ‘MIROH’. Such is the harsh reality, such is the unknown tomorrow, and perhaps such is the confused mind of a person. However, here are boys who have greater faith and courage in themselves than their fear of 'MIROH' - Stray Kids. The specialness that only a moment of ‘first’ holds, and the strong courage and confidence that the members will shine through. This song overflows with the spirit and ambition of Stray Kids, as they take their first steps into the rugged jungle-like 'MIROH' ahead of them. DANK, who produced the track, is a veteran DJ under Ultra Music who has officially remixed and released music from world-renowned artists such as Daft Punk, Charli XCX, Britney Spears, Rihanna, Shakira, Iggy Azalea, Rita Ora, Yoko Ono, Pitbull, and Avicii, just to name a few. Additionally, [url=https:\/\/www.philtan.com[\/url] Phil Tan, a three-time Grammy Award-winning mix engineer, created an exquisite blend of hip-hop and EDM in the mix.” — Stray Kids\n\nThe song was re-distributed via their 2020 compilation album “SKZ2020”, in which Stray Kids re-recorded the parts of the group’s former member who left the group months prior. <a href=\"http:\/\/www.last.fm\/music\/STRAY+KIDS\/_\/MIROH\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}