{
  "created_at": "2025-05-03T14:43:45.444748+00:00",
  "elapsed": 0.235938,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:43:45.444748+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4296",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:43:45 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Twenty+One+Pilots&format=json&method=track.getInfo&track=Shy+Away"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Twenty+One+Pilots&format=json&method=track.getInfo&track=Shy+Away",
  "_decoded_content": {
    "track": {
      "name": "Shy Away",
      "url": "https:\/\/www.last.fm\/music\/Twenty+One+Pilots\/_\/Shy+Away",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "382230",
      "playcount": "5954264",
      "artist": {
        "name": "Twenty One Pilots",
        "mbid": "a6c6897a-7415-4f8d-b5a5-3a5e05f3be67",
        "url": "https:\/\/www.last.fm\/music\/Twenty+One+Pilots"
      },
      "toptags": {
        "tag": [
          {
            "name": "indie pop",
            "url": "https:\/\/www.last.fm\/tag\/indie+pop"
          },
          {
            "name": "indie rock",
            "url": "https:\/\/www.last.fm\/tag\/indie+rock"
          },
          {
            "name": "new wave",
            "url": "https:\/\/www.last.fm\/tag\/new+wave"
          },
          {
            "name": "Post-punk revival",
            "url": "https:\/\/www.last.fm\/tag\/Post-punk+revival"
          },
          {
            "name": "indie",
            "url": "https:\/\/www.last.fm\/tag\/indie"
          }
        ]
      },
      "wiki": {
        "published": "17 Jan 2022, 17:41",
        "summary": "“Shy Away” is the lead single from twenty one pilots' sixth studio album, \"Scaled And Icy\". The song is based on a conversation frontman Tyler Joseph had with his younger brother where he walked him through his creative process for writing a song. It eventually turned into a letter of advice for his brother, encouraging him to pursue his dreams in the music industry. While Tyler did not specify which brother he was referring to in his interview <a href=\"http:\/\/www.last.fm\/music\/Twenty+One+Pilots\/_\/Shy+Away\">Read more on Last.fm<\/a>.",
        "content": "“Shy Away” is the lead single from twenty one pilots' sixth studio album, \"Scaled And Icy\". The song is based on a conversation frontman Tyler Joseph had with his younger brother where he walked him through his creative process for writing a song. It eventually turned into a letter of advice for his brother, encouraging him to pursue his dreams in the music industry. While Tyler did not specify which brother he was referring to in his interview, it is likely he was speaking about Jay Joseph since Jay dropped his first solo music, Drywall, one month prior to “Shy Away’s” release.\n\nThe track was revealed after multiple posters for the band’s Livestream Experience concert were found on the dmaorg.info website, similar to the way Trench was announced.\n\nTyler Joseph:\n\n\"'My brother said, ‘Hey, I just want you to show me, from the beginning, how you start a record. How do you start writing a song?’ So I had him over at the studio. A lot of times when I sit down to start, I’ll tap into my phone and I’ll have a bunch of voice memos of ideas that have hit me randomly. Sometimes it’s just a single word, sometimes it’s a melody. I started to build up the track from there, and it turned out that it was talking about wanting him to pursue his dream of chasing music. Most of my songs are very inward, but this is one of the few that I feel like the message is outward, coming from me. The only thing harder than figuring out what your purpose and identity is, is watching someone that you love trying to figure out theirs.'\"\n\n—via Apple Music\n\nOn BBC Radio 1’s Future Sounds—where the song received its global premiere—Tyler told Jack Saunders:\n\n\"'I’ve just been having a good time, playing some guitar for the first time, ever. I think nothing is more inspiring than learning a new instrument that I’ve never played before, specifically, the electric guitar and I had my younger brother over, he’s like “Hey, I wanna watch your process from start to finish, how do you start a song, how do you record a song, how to you write a song?”  just kinda came up with the beginnings of the song, almost as a tutorial for him on how to lay out a song, how to start it, how to record it, how to produce it out.\n\nLyrically, it kinda turned out to talk about being an older brother and how the only tougher than trying to figure out what your own purpose is, is watching someone you love try to figure out their purpose.\n\nThis track means a lot to me for a few other reasons as well, the majority of this record was written and produced in my own studio. And specifically for Josh, […] this is the first time that he’s recorded drums all on his own, no engineer, no one helping him at all […]. We were working from across the country at the time.'\" <a href=\"http:\/\/www.last.fm\/music\/Twenty+One+Pilots\/_\/Shy+Away\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}