{
  "created_at": "2025-05-03T14:40:15.478406+00:00",
  "elapsed": 0.180159,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:40:15.478406+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "3723",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:40:15 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Stray+Kids&format=json&method=track.getInfo&track=MEGAVERSE"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Stray+Kids&format=json&method=track.getInfo&track=MEGAVERSE",
  "_decoded_content": {
    "track": {
      "name": "MEGAVERSE",
      "url": "https:\/\/www.last.fm\/music\/STRAY+KIDS\/_\/MEGAVERSE",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "133634",
      "playcount": "3477849",
      "artist": {
        "name": "STRAY KIDS",
        "url": "https:\/\/www.last.fm\/music\/STRAY+KIDS"
      },
      "toptags": {
        "tag": [
          {
            "name": "k-pop",
            "url": "https:\/\/www.last.fm\/tag\/k-pop"
          },
          {
            "name": "electronic",
            "url": "https:\/\/www.last.fm\/tag\/electronic"
          },
          {
            "name": "hip hop",
            "url": "https:\/\/www.last.fm\/tag\/hip+hop"
          },
          {
            "name": "Awesome",
            "url": "https:\/\/www.last.fm\/tag\/Awesome"
          },
          {
            "name": "Korean",
            "url": "https:\/\/www.last.fm\/tag\/Korean"
          }
        ]
      },
      "wiki": {
        "published": "10 Jan 2024, 18:37",
        "summary": "“MEGAVERSE” is the introductory track from Stray Kids’ eighth extended play 樂-STAR.\n\nThis track mixes heavy bass and trap beats with EDM, and showcases their confidence and uniqueness within the music industry. The lyrics emphasize their unstoppable presence and impact, comparing themselves to gods and stating that they are breaking all boundaries. Throughout, they imply that their talent and artistry surpass the boundaries of the ordinary music scene. <a href=\"http:\/\/www.last.fm\/music\/STRAY+KIDS\/_\/MEGAVERSE\">Read more on Last.fm<\/a>.",
        "content": "“MEGAVERSE” is the introductory track from Stray Kids’ eighth extended play 樂-STAR.\n\nThis track mixes heavy bass and trap beats with EDM, and showcases their confidence and uniqueness within the music industry. The lyrics emphasize their unstoppable presence and impact, comparing themselves to gods and stating that they are breaking all boundaries. Throughout, they imply that their talent and artistry surpass the boundaries of the ordinary music scene.\n\nIn the first verse, they chant the words “Jump Force” - which is a Japanese crossover fighting video game featuring characters from various manga series’, similar to that of the game “Super Smash Bros.”.\nThe mention of this video game co-insides with the song’s overall theme; that Stray Kids are capable of crossing through different multiverses. Their self-acclaimed comparison to Jump Force is a testimony to their ability to effortlessly navigate through different genres and styles, further highlighting their versatility and creativity. It suggests that they are not confined by any limitations and are ready to explore new territories and universes. \n\nThe lyrics also express their absolute confidence in their skills, claiming an \"unbeatable score,\" implying their superiority over others in terms of their composition and artistic talent.\nThey mention how their composition brings competition, but regardless of any rivals, they state that they have already won in this \"megaverse.\" This line signifies their determination and drive to succeed, regardless of the challenges they face. It showcases their ability to conquer any stage or platform, leaving a lasting impact wherever they go. This anthem symbolizes their confidence, ambition, and uniqueness in the music industry. They embrace their individuality and artistic vision, aiming to surpass boundaries and make their mark in the industry.\n\n“This song exudes restrained yet cohesive energy based on simple rhythm and strong bass sounds. You will be able to feel the two meanings all at once: the 'multi-facetted universe' created with Stray Kids' unique and powerful lyrics, and the 'diverse and unique worldview'. Please enjoy our own ‘MEGAVERSE’, complete with tempo changes and multidimensional audio which displays voices swinging left and right!” — Stray Kids <a href=\"http:\/\/www.last.fm\/music\/STRAY+KIDS\/_\/MEGAVERSE\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}