{
  "created_at": "2025-05-03T14:38:47.754347+00:00",
  "elapsed": 0.229122,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:38:47.754347+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5949",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:38:48 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=FLO&format=json&method=track.getInfo&track=Cardboard+Box"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=FLO&format=json&method=track.getInfo&track=Cardboard+Box",
  "_decoded_content": {
    "track": {
      "name": "Cardboard Box",
      "url": "https:\/\/www.last.fm\/music\/FLO\/_\/Cardboard+Box",
      "duration": "161000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "188904",
      "playcount": "2728988",
      "artist": {
        "name": "FLO",
        "mbid": "95e12b1c-921a-4de2-a624-bf9e8fe523eb",
        "url": "https:\/\/www.last.fm\/music\/FLO"
      },
      "album": {
        "artist": "FLO",
        "title": "Cardboard Box",
        "url": "https:\/\/www.last.fm\/music\/FLO\/Cardboard+Box",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/a0313ec2db44abf032f1d386860b9b5b.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/a0313ec2db44abf032f1d386860b9b5b.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/a0313ec2db44abf032f1d386860b9b5b.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/a0313ec2db44abf032f1d386860b9b5b.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "rnb",
            "url": "https:\/\/www.last.fm\/tag\/rnb"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "dancehall",
            "url": "https:\/\/www.last.fm\/tag\/dancehall"
          },
          {
            "name": "contemporary rnb",
            "url": "https:\/\/www.last.fm\/tag\/contemporary+rnb"
          },
          {
            "name": "dance-pop",
            "url": "https:\/\/www.last.fm\/tag\/dance-pop"
          }
        ]
      },
      "wiki": {
        "published": "21 Apr 2022, 00:22",
        "summary": "“Cardboard Box” is the debut single by British girl group FLO, released on March 24, 2022. Written by MNEK, Jamal Woon, and FLO members Renée Downer, Jorja Douglas, and Stella Quaresma, the song introduced FLO’s throwback R&B style to the world and quickly garnered widespread acclaim for its polished sound and confident attitude.\n\nBackground\nFLO was formed in 2019, and after honing their sound and building chemistry as a group, they released “Cardboard Box” as their first single. <a href=\"http:\/\/www.last.fm\/music\/FLO\/_\/Cardboard+Box\">Read more on Last.fm<\/a>.",
        "content": "“Cardboard Box” is the debut single by British girl group FLO, released on March 24, 2022. Written by MNEK, Jamal Woon, and FLO members Renée Downer, Jorja Douglas, and Stella Quaresma, the song introduced FLO’s throwback R&B style to the world and quickly garnered widespread acclaim for its polished sound and confident attitude.\n\nBackground\nFLO was formed in 2019, and after honing their sound and building chemistry as a group, they released “Cardboard Box” as their first single. The track was produced by MNEK, a prominent figure in UK pop and R&B, who helped craft its sleek, nostalgic vibe.\n\nThe song’s lyrics tell the story of a breakup and the empowerment that comes from moving on—drawing comparisons to classic R&B break-up anthems of the late 1990s and early 2000s. FLO’s harmonies and effortless vocal blend immediately stood out, and the song’s viral success helped establish them as one of the most promising new acts in contemporary R&B.\n\nMusical style\n“Cardboard Box” is an uptempo R&B track with elements of UK garage and pop. Its production is characterized by tight harmonies, a bouncing bassline, crisp percussion, and layered backing vocals, reminiscent of early 2000s girl groups like Destiny’s Child and TLC.\n\nThe track’s playful energy is complemented by its polished production, highlighting FLO’s vocal chemistry and confident delivery.\n\nLyrical analysis\nThe song uses the metaphor of packing an ex-partner’s belongings in a cardboard box as a symbol of emotional closure and moving forward. Lines like “I’ma put your shit in a cardboard box \/ Changing my number and I’m changing the locks” underscore the no-nonsense attitude of someone reclaiming their independence after a breakup.\n\nThe lyrics balance sass and empowerment, reflecting modern R&B’s trend of self-assured storytelling.\n\nChart performance\nWhile “Cardboard Box” did not initially chart on major singles charts, it achieved viral success:\n\nThe song gained millions of streams on platforms like Spotify and YouTube within weeks of release.\n\nIt became a viral sensation on TikTok, with fans and influencers using it in countless videos, further boosting its popularity.\n\nIts growing momentum led to major media coverage and widespread critical praise, setting the stage for FLO’s breakout.\n\nMusic video\nThe music video for “Cardboard Box”, directed by Avesta Keshtmand, features stylish choreography and aesthetic nods to 1990s and early 2000s R&B videos. The group is shown performing coordinated dance moves in vibrant, minimalist settings, showcasing their charisma and strong visual identity.\n\nLive performances\nFLO has performed “Cardboard Box” at various live showcases and music events, including BBC Radio 1Xtra Live and TV appearances, where the song’s harmonies and upbeat vibe translate well to live settings. Their live performances have been praised for their tight vocal delivery and stage presence.\n\nPersonnel\nRenée Downer – vocals, songwriting\n\nJorja Douglas – vocals, songwriting\n\nStella Quaresma – vocals, songwriting\n\nMNEK – production, songwriting\n\nJamal Woon – songwriting\n\nReception\n“Cardboard Box” was met with critical acclaim, hailed as a refreshing return to the classic R&B girl group sound with a modern twist. Reviewers praised the song’s production, catchy hook, and the group’s vocal ability, noting FLO as a standout new act in contemporary R&B.\n\nPublications such as The Guardian, NME, and Clash listed FLO as rising stars to watch, citing “Cardboard Box” as a key reason for their rapid rise.\n\nTrivia\nThe song’s viral success led to FLO signing a record deal with Island Records.\n\nAn acoustic version and a remix featuring Nigerian artist Oxlade were later released, broadening the song’s reach.\n\n“Cardboard Box” was included in FLO’s debut EP The Lead, released in 2022. <a href=\"http:\/\/www.last.fm\/music\/FLO\/_\/Cardboard+Box\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}