{
  "created_at": "2025-05-03T14:36:39.391729+00:00",
  "elapsed": 0.183713,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:36:39.391729+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "6362",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:36:39 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Taylor+Swift&format=json&method=track.getInfo&track=22"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Taylor+Swift&format=json&method=track.getInfo&track=22",
  "_decoded_content": {
    "track": {
      "name": "22",
      "mbid": "acedac8b-dc8a-4a0c-9a07-36298239bd6d",
      "url": "https:\/\/www.last.fm\/music\/Taylor+Swift\/_\/22",
      "duration": "291000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "756088",
      "playcount": "6665957",
      "artist": {
        "name": "Taylor Swift",
        "mbid": "20244d07-534f-4eff-b4d4-930878889970",
        "url": "https:\/\/www.last.fm\/music\/Taylor+Swift"
      },
      "album": {
        "artist": "Taylor Swift",
        "title": "Red",
        "mbid": "90d96ad7-ca44-41f2-bc47-cbc9c762be3b",
        "url": "https:\/\/www.last.fm\/music\/Taylor+Swift\/Red",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/ad99371a89ed925f63ee3737b4bf9908.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/ad99371a89ed925f63ee3737b4bf9908.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/ad99371a89ed925f63ee3737b4bf9908.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/ad99371a89ed925f63ee3737b4bf9908.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "6"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "taylor swift",
            "url": "https:\/\/www.last.fm\/tag\/taylor+swift"
          },
          {
            "name": "country",
            "url": "https:\/\/www.last.fm\/tag\/country"
          },
          {
            "name": "love at first listen",
            "url": "https:\/\/www.last.fm\/tag\/love+at+first+listen"
          },
          {
            "name": "female vocalists",
            "url": "https:\/\/www.last.fm\/tag\/female+vocalists"
          }
        ]
      },
      "wiki": {
        "published": "03 Feb 2013, 22:09",
        "summary": "\"22\" is a song by American singer-songwriter Taylor Swift from her fourth studio album \"Red\". Swift wrote the song with its producers Max Martin and Shellback. It was released as the album's fourth single on March 12, 2013, by Big Machine Records. Musically, \"22\" combines pop styles such as dance-pop and bubblegum pop with a disco production and pulsing synthesizers. The track begins with a twangy acoustic guitar riff and progresses into an upbeat refrain. <a href=\"http:\/\/www.last.fm\/music\/Taylor+Swift\/_\/22\">Read more on Last.fm<\/a>.",
        "content": "\"22\" is a song by American singer-songwriter Taylor Swift from her fourth studio album \"Red\". Swift wrote the song with its producers Max Martin and Shellback. It was released as the album's fourth single on March 12, 2013, by Big Machine Records. Musically, \"22\" combines pop styles such as dance-pop and bubblegum pop with a disco production and pulsing synthesizers. The track begins with a twangy acoustic guitar riff and progresses into an upbeat refrain. The lyrics celebrate being 22-years-old while acknowledging the heartache that the narrator experienced in the past; some media noted that \"22\" became a cultural phenomenon resulting in the prominence of 22nd birthdays.\n\nMusic critics complimented the single's catchy production and retrospectively considered it one of Swift's best pop songs. \"22\" peaked at number 20 on the US Billboard Hot 100 and was certified triple platinum by the Recording Industry Association of America (RIAA). It received platinum or higher certifications in Australia, Canada, and the United Kingdom, peaking in the top 10 on the single chart in the lattermost country. The accompanying music video was shot in Malibu, California, depicting Swift having a house party with friends. Swift included the song in the set list of the Red Tour (2013–2014) and performed it live at the 2013 Billboard Music Awards.\n\nA re-recorded version of \"22\", titled \"22 (Taylor's Version)\", was released as part of Swift's second re-recorded album \"Red (Taylor's Version)\" on November 12, 2021, by Republic Records. \"22 (Taylor's Version)\" peaked within the top 40 on singles charts of Australia, Canada, and Singapore; and peaked at number 52 on the US Billboard Hot 100.\n\nAfter writing her third studio album \"Speak Now\" entirely solo, Taylor Swift opted to collaborate with different songwriters and producers for \"Red\". Thus, she called Max Martin and Shellback, two songwriters and producers whose work she admired, to discuss a possible collaboration. She told Billboard magazine: \"For me, being 22 has been my favorite year of my life. I like all the possibilities of how you're still learning, but you know enough. You still know nothing, but you know that you know nothing. You're old enough to start planning your life, but you're young enough to know there are so many unanswered questions. That brings about a carefree feeling that is sort of based on in-decision and fear and at the same time letting loose. Being 22 has taught me so much\".\n\nThe song was officially supposed to impact contemporary hit radio in the United States on March 5, 2013, before being pushed back by one week to March 12, 2013, and in the UK on March 31, 2013. An exclusive limited edition individually numbered CD single was also released exclusively to Swift's store on March 13, 2013, the same day the music video was released. The CD single was sold by itself or via an exclusive package with the Red Tour items and a T-shirt.\n\nThe music video for \"22\" was filmed in February 2013, and premiered on March 13, 2013. It was directed by Anthony Mandler, who had previously directed the music video for Swift's \"I Knew You Were Trouble\". The video, presented in a 4:3 aspect ratio format, shows Swift bouncing on trampolines, playing on the beach and having a house party with her friends. As of January 2022, the video has more than 600 million views on YouTube. The music video was shot in Malibu, California. Actress Jessica Szohr cameos.\n\nSeveral songs from \"Red\", including \"22\", charted in different countries due to strong digital sales following the release of the album. \"22\" debuted at number 44 on United States Billboard Hot 100 chart, as well as at number seven on Billboard Hot Digital Songs chart with sales of 108,000. It later re-entered the Hot 100 at number 84 on the chart week of January 12, 2013. When it was again released as a single, it reentered the charts at number 64. \"22\" also debuted at number 29 on the Billboard Canadian Hot 100 chart and peaked at number 20. It also managed to reach number nine on the UK Singles Chart. It reached 2 million in sales by 2014. As of November 2017, the song had sold 2.3 million copies in the United States. <a href=\"http:\/\/www.last.fm\/music\/Taylor+Swift\/_\/22\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}