{
  "created_at": "2025-05-03T14:31:03.546700+00:00",
  "elapsed": 0.184282,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:31:03.546700+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4251",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:31:03 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Ariana+Grande&format=json&method=track.getInfo&track=NASA"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Ariana+Grande&format=json&method=track.getInfo&track=NASA",
  "_decoded_content": {
    "track": {
      "name": "Nasa",
      "url": "https:\/\/www.last.fm\/music\/Ariana+Grande\/_\/Nasa",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "522096",
      "playcount": "7198890",
      "artist": {
        "name": "Ariana Grande",
        "mbid": "f4fdbb4c-e4b7-47a0-b83b-d91bbfcfa387",
        "url": "https:\/\/www.last.fm\/music\/Ariana+Grande"
      },
      "toptags": {
        "tag": [
          {
            "name": "rnb",
            "url": "https:\/\/www.last.fm\/tag\/rnb"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "female vocalists",
            "url": "https:\/\/www.last.fm\/tag\/female+vocalists"
          },
          {
            "name": "trap",
            "url": "https:\/\/www.last.fm\/tag\/trap"
          },
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          }
        ]
      },
      "wiki": {
        "published": "18 Dec 2019, 16:25",
        "summary": "\"NASA\" is a song by American singer Ariana Grande, from her fifth studio album, thank u next. It was released on February 8, 2019 through Republic Records. It was written by Grande, Victoria Monét, Tayla Parx, and its producers Tommy Brown and Charles Anderson.\n\nCommercially, it reached the top 20 in Greece, Australia, Canada, Malaysia, Singapore, and the United States.\n\nThe track features a spoken introduction by Shangela, an American drag queen. <a href=\"http:\/\/www.last.fm\/music\/Ariana+Grande\/_\/Nasa\">Read more on Last.fm<\/a>.",
        "content": "\"NASA\" is a song by American singer Ariana Grande, from her fifth studio album, thank u next. It was released on February 8, 2019 through Republic Records. It was written by Grande, Victoria Monét, Tayla Parx, and its producers Tommy Brown and Charles Anderson.\n\nCommercially, it reached the top 20 in Greece, Australia, Canada, Malaysia, Singapore, and the United States.\n\nThe track features a spoken introduction by Shangela, an American drag queen. She says, \"One small step for woman, one giant leap for womankind\", a variation on Neil Armstrong's quote, \"That's one small step for a man, one giant leap for mankind.\"\n\n\"NASA\" was ranked as one of the best songs of 2019 by several publications. Pitchfork stated that \"on an album largely about the joys of being unattached, \"NASA\" offers a nuance: the freedom to be attached, just not right now. “I can’t really miss you if I’m with you,” Grande offers, gently reminding a lover that intimacy doesn’t mean constant proximity. While Grande’s refrain of “I’m a star, I’ma need space” verges on cutesy, the delicate harmonies and airy production of “NASA” make its blown-out bass and trap drums feel weightless.\" Rolling Stone said the song was \"a deeply empathetic (and devastatingly catchy) ode to wanting to be alone and letting absence make hearts grow fonder. The beat, courtesy of producers Tommy Brown and Charles Anderson, is the standout on an album with stiff competition, based around a whistling, underwater-sounding synth. The writing, which took place in a marathon New York recording run, is some of Grande’s sharpest to date. And on top of all that, the song’s basic thesis is correct: If you haven’t listened to it in a while, throw it on right now. You’ll like it even more than you used to.\" Uproxx ranked 'NASA' at number 18 on their year-end list, saying that \"more songs about self-sufficiency within relationships can only be a good thing for Ariana’s young fans, and those of still floundering through codependency issues in our thirties.\" Stereogum ranked it at number 19 on their Top 40 Pop Songs of 2019 list.\nShangela has said of the origins of her contribution to the track:\n\n\"The song ['NASA'] was amazing, and when the song ended, she was like, 'What do you think?' And I was like, 'Oh girl, I live! I love it, and it's amazing! I'm already thinking of how I'm going to perform it for my drag number, when I do my version.' And she looked at me and said, 'Your version?' And I said, 'I'm just going to put a fun intro on it for drag, and I'm going to be in a spacesuit with like space-Titties and I'm going to come out in a moon man suit and I'm going to lift the mask and say, 'This is one small step for woman, one giant leap for womankind.' And she was like, 'Oh my God! I love that!'\" <a href=\"http:\/\/www.last.fm\/music\/Ariana+Grande\/_\/Nasa\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}