{
  "created_at": "2025-05-03T14:35:43.363928+00:00",
  "elapsed": 0.196379,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:35:43.363928+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "6308",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:35:43 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Kanye+West&format=json&method=track.getInfo&track=Black+Skinhead"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Kanye+West&format=json&method=track.getInfo&track=Black+Skinhead",
  "_decoded_content": {
    "track": {
      "name": "Black Skinhead",
      "mbid": "2e48f30b-7ad2-4fea-97f1-edef65565d7c",
      "url": "https:\/\/www.last.fm\/music\/Kanye+West\/_\/Black+Skinhead",
      "duration": "194000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1188421",
      "playcount": "14753488",
      "artist": {
        "name": "Kanye West",
        "mbid": "164f0d73-1234-4e2c-8743-d77bf2191051",
        "url": "https:\/\/www.last.fm\/music\/Kanye+West"
      },
      "album": {
        "artist": "Kanye West",
        "title": "Yeezus",
        "mbid": "e1cd2cd9-3cd6-40bf-9802-9aa2d231fc2d",
        "url": "https:\/\/www.last.fm\/music\/Kanye+West\/Yeezus",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/71d8c1f84d67e60c5dda039d6fb3653f.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/71d8c1f84d67e60c5dda039d6fb3653f.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/71d8c1f84d67e60c5dda039d6fb3653f.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/71d8c1f84d67e60c5dda039d6fb3653f.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "2"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          },
          {
            "name": "industrial",
            "url": "https:\/\/www.last.fm\/tag\/industrial"
          },
          {
            "name": "hip hop",
            "url": "https:\/\/www.last.fm\/tag\/hip+hop"
          },
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "death grips",
            "url": "https:\/\/www.last.fm\/tag\/death+grips"
          }
        ]
      },
      "wiki": {
        "published": "19 Jul 2013, 22:00",
        "summary": "“Black Skinhead“ (also stylized as \"BLKKK SKKKN HEAD\") is a song by American rapper Kanye West, from his sixth studio album, Yeezus. It was produced by West and Daft Punk. The song's lyrics center on racial tensions and the crumbling mental state of the character West portrays on the album.\n\nThe song premiered on Saturday Night Live in May 2013, with West performing it in front of a projected backdrop. He has since performed the song live on various occasions, including at the Glastonbury Festival and the Billboard Music Awards in 2015. <a href=\"http:\/\/www.last.fm\/music\/Kanye+West\/_\/Black+Skinhead\">Read more on Last.fm<\/a>.",
        "content": "“Black Skinhead“ (also stylized as \"BLKKK SKKKN HEAD\") is a song by American rapper Kanye West, from his sixth studio album, Yeezus. It was produced by West and Daft Punk. The song's lyrics center on racial tensions and the crumbling mental state of the character West portrays on the album.\n\nThe song premiered on Saturday Night Live in May 2013, with West performing it in front of a projected backdrop. He has since performed the song live on various occasions, including at the Glastonbury Festival and the Billboard Music Awards in 2015. It was universally praised by music critics and ranked by numerous sites, including Rolling Stone and NME, as one of the best tracks of 2013. The song's accompanying music video was directed by Nick Knight and features computer-generated imagery of West, with interactive options including \"screen grabbing\" and adjusting the speed of his vocals. The video was released in July 2013 and has received positive reviews from critics.\n\nAlthough West initially said Yeezus would have no singles, “Black Skinhead“ became the first single released from the album. It was serviced to contemporary hit radio stations in the United Kingdom one day after the album's release. On July 2, 2013, the single was sent to urban contemporary radio stations in the United States. The song charted in the United States, the United Kingdom, Scotland, Ireland, France, Canada, Belgium and Australia in 2013 and 2014. It has since been certified platinum in the United States, the United Kingdom and Denmark. American singer Jack White covered the song in June 2014. A remix featuring Miley Cyrus, recorded shortly after the 2013 MTV Video Music Awards, leaked online in January 2016.\n\nThe song's title uses \"skinhead\", which originated as a description of a 1960s British working-class male subculture whose members often had closely cropped hair. It revolved around fashion and music and went on to inspire the punk rock scene. Despite attracting young males across the political spectrum, the term had come to be popularly associated with neo-Nazis at the time of single's release. Travis Scott said of his initial reaction to the song: \"I jumped off the stairs onto the couch. I was going HAM. That was when I heard the 'na na na na' part for the first time, I lost my fucking mind. That's some soccer anthem-type shit.\" According to co-producer Mike Dean, the song was almost left off Yeezus for sounding \"too much like a soccer song.\" In November 2013, co-writer Lupe Fiasco still felt unsure what the song was supposed to be about. He described it as \"a lot of emotional, a lot of this, a lot of cliché, a lot of kinda stuff balled in together, and it's just supposed to be presented as a package and you digest it.\"\n\nAfter its release as a single in the United States, \"Black Skinhead\" entered charts in North America. The track debuted at number 69 on the US Billboard Hot 100. In the same week as its Hot 100 debut, the track also entered at number 21 on the US Hot R&B\/Hip-Hop Songs chart. On the Canadian Hot 100, the song reached number 66.\n\nThe track charted in several countries worldwide. After being released as a single in the United Kingdom on June 19, 2013, the song debuted at number 48 on the UK Singles Chart and eventually peaked at number 34. It remained there for a total of 16 weeks and ranked as the 197th best-selling single of 2013 in the United Kingdom. In Scotland, the track also reached the top 40, charting at number 31 on the Scottish Singles Chart. The track reached number 55 on the Irish Singles Chart and charted at number 58 and 59 on the ARIA Singles Chart and the Belgium Ultratip Flanders chart respectively. Its lowest chart position was in France at number 105 on the SNEP chart.\n\nOn October 17, 2014, “Black Skinhead“ was certified Platinum in Denmark, and in the United States by the RIAA on October 13, 2015. “Black Skinhead“ went Platinum in the United Kingdom on November 23, 2018.\n\nAs of 2017, “Black Skinhead“ is the 89th best-selling hip-hop song of all-time in the UK. <a href=\"http:\/\/www.last.fm\/music\/Kanye+West\/_\/Black+Skinhead\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}