{
  "created_at": "2025-05-03T14:30:05.180534+00:00",
  "elapsed": 0.214473,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:30:05.180534+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "6327",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:30:05 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=LANY&format=json&method=track.getInfo&track=Thru+These+Tears"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=LANY&format=json&method=track.getInfo&track=Thru+These+Tears",
  "_decoded_content": {
    "track": {
      "name": "Thru These Tears",
      "url": "https:\/\/www.last.fm\/music\/Lany\/_\/Thru+These+Tears",
      "duration": "204000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "114157",
      "playcount": "1069016",
      "artist": {
        "name": "Lany",
        "url": "https:\/\/www.last.fm\/music\/Lany"
      },
      "album": {
        "artist": "Various Artists",
        "title": "This Is Pop Music",
        "url": "https:\/\/www.last.fm\/music\/Various+Artists\/This+Is+Pop+Music",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/a4ed687cfe933b324aa7880d202f0fc3.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/a4ed687cfe933b324aa7880d202f0fc3.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/a4ed687cfe933b324aa7880d202f0fc3.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/a4ed687cfe933b324aa7880d202f0fc3.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "chill",
            "url": "https:\/\/www.last.fm\/tag\/chill"
          },
          {
            "name": "indie pop",
            "url": "https:\/\/www.last.fm\/tag\/indie+pop"
          },
          {
            "name": "sad",
            "url": "https:\/\/www.last.fm\/tag\/sad"
          },
          {
            "name": "american",
            "url": "https:\/\/www.last.fm\/tag\/american"
          },
          {
            "name": "2018 single",
            "url": "https:\/\/www.last.fm\/tag\/2018+single"
          }
        ]
      },
      "wiki": {
        "published": "26 Mar 2023, 16:20",
        "summary": "“Thru These Tears” comes as LANY’s first release since 2017’s LANY. According to frontman Paul Klein, the song was finished on January 29, 2018, and represents “the worst 45 days of my life.”\n\nHe expands on that idea:\n\n\"I’m so proud of how I walked through that season. I made the absolute most of it. I’m not just a better writer and a better artist, I’m a better person. I feel so much more in touch with who I am and how I think and feel.. It’s been the most productive 45 days of my life.\" <a href=\"http:\/\/www.last.fm\/music\/Lany\/_\/Thru+These+Tears\">Read more on Last.fm<\/a>.",
        "content": "“Thru These Tears” comes as LANY’s first release since 2017’s LANY. According to frontman Paul Klein, the song was finished on January 29, 2018, and represents “the worst 45 days of my life.”\n\nHe expands on that idea:\n\n\"I’m so proud of how I walked through that season. I made the absolute most of it. I’m not just a better writer and a better artist, I’m a better person. I feel so much more in touch with who I am and how I think and feel.. It’s been the most productive 45 days of my life.\"\n\nThe song is the official first look into the “moon era” for the band.\n\nFrontman Paul Klein said the following in the band’s newsletter:\n\nthe beginning of 2018 was crazy and kind of awful but also kind of amazing and i threw myself into an environment to write a song every monday thru friday up until valentine’s day. it was the worst of times, it was the best of times… but actually it was the most special of times. i got to spill my guts, talk my face off, gather myself, and write songs that were honest to a fault and cathartic to a saving degree for my soul.\n\n\"“thru these tears” is especially important. at the time – i was writing it for me. but now that i’m healed and whole, it’s for you. i am 1 in like 7 billion that have experienced some sort of disappointment or pain. but i know more than anyone that therapy is just talking it out. and if i can put into words what most can’t, and give people something they can sing along to and hear themselves “talk it out” to, then maybe i can do my part in making this world a better place.\"\n\nHe also said the following in this Instagram caption:\n\n\"this song and the others on “malibu nights” are pieces of music and art that i have dreamt of making since i was a kid. we’ve pushed ourselves to the absolute limit, dug deeper than ever before, and come out with something so pure and honest and powerful. i’m proud of us\"\n\n”Thru These Tears” was made and produced in May 2018, during the 50 days set aside to write material for the new LANY record.\n\nIn an interview with Music News, lead singer Paul Klein said:\n\n“It was a real labor of love but we got it there and I’m really proud of it.\"\n\n\"I started writing and I didn’t know at the time if it was for album two or if it was just to kind of keep me sane or to help me through this like kind of rough patch I was going through but, I think this was like the fifth song during the process of throwing myself in a room almost every single day and trying to write a song. During this season there was two ways my day would go. Either after a day in the studio I would feel like I was on top of the world and I would drive all the way back home to Malibu listening to what I had just written on repeat and just feeling like all right because there’s like nothing better. There’s no better feeling than having like something up your sleeve that you’re really proud of or, you want to drive just straight into the ocean and just kind of like end it all. So this is one of those days where I was feeling really nice and sometimes after I finished a song and I feel really good about it I want to go and like eat by myself and I put my headphones in and just listen and so that’s what I did and I went had dinner by myself around like 10:30. I drove home to Malibu and during this time when I was just kind of pretty broken up inside, I hadn’t really cried because you know when you’re super upset and you really just feel like more sick at your stomach then you’re not really ever able to cry, I hadn’t really cried yet. I was driving home and I was listening “I Don’t Want to Love You Anymore,” another song off the album, and something hit me and I had to pull my car over and I basically wept. I like cried myself dry for like ten or fifteen minutes I pulled myself together and I had this thought I was like, Paul like you know this road. You’ve been down this road you know how to get home you just can’t see it because you’re crying like dude you’re gonna be alright. Like you’re definitely gonna be alright you just can’t see it right now through your tears. I was like damn that’s what I’m gonna do tomorrow I’m gonna write a song called “Thru These Tears.”\" <a href=\"http:\/\/www.last.fm\/music\/Lany\/_\/Thru+These+Tears\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}