{
  "created_at": "2025-05-03T14:31:15.723423+00:00",
  "elapsed": 0.227121,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:31:15.723423+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5003",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:31:16 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Alan+Walker&format=json&method=track.getInfo&track=On+My+Way"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Alan+Walker&format=json&method=track.getInfo&track=On+My+Way",
  "_decoded_content": {
    "track": {
      "name": "On My Way",
      "url": "https:\/\/www.last.fm\/music\/Alan+Walker\/_\/On+My+Way",
      "duration": "193000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "318954",
      "playcount": "2158746",
      "artist": {
        "name": "Alan Walker",
        "url": "https:\/\/www.last.fm\/music\/Alan+Walker"
      },
      "album": {
        "artist": "Various Artists",
        "title": "Club Sounds, Vol. 89",
        "url": "https:\/\/www.last.fm\/music\/Various+Artists\/Club+Sounds,+Vol.+89",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/0e2618b53924a379b0fb96d1e9afc550.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/0e2618b53924a379b0fb96d1e9afc550.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/0e2618b53924a379b0fb96d1e9afc550.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/0e2618b53924a379b0fb96d1e9afc550.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "dance",
            "url": "https:\/\/www.last.fm\/tag\/dance"
          },
          {
            "name": "electronic",
            "url": "https:\/\/www.last.fm\/tag\/electronic"
          },
          {
            "name": "dancehall",
            "url": "https:\/\/www.last.fm\/tag\/dancehall"
          },
          {
            "name": "EDM",
            "url": "https:\/\/www.last.fm\/tag\/EDM"
          }
        ]
      },
      "wiki": {
        "published": "18 Nov 2022, 17:00",
        "summary": "\"On My Way\" is a song by English-Norwegian DJ Alan Walker, American singer Sabrina Carpenter and Puerto Rican singer Farruko, released as a single on March 21, 2019, through MER and Sony Music. Farruko also contributes a Spanish verse.\n\nThe song was written by Julia Karlsson, Gunnar Greve, Franklin Jovani Martinez, Marcos G. Pérez, Fredrik Borch Olsen, Jesper Borgen, Øyvind Sauvik, Anders Frøen, and Anton Rundberg alongside Walker, Carpenter, and Farruko. <a href=\"http:\/\/www.last.fm\/music\/Alan+Walker\/_\/On+My+Way\">Read more on Last.fm<\/a>.",
        "content": "\"On My Way\" is a song by English-Norwegian DJ Alan Walker, American singer Sabrina Carpenter and Puerto Rican singer Farruko, released as a single on March 21, 2019, through MER and Sony Music. Farruko also contributes a Spanish verse.\n\nThe song was written by Julia Karlsson, Gunnar Greve, Franklin Jovani Martinez, Marcos G. Pérez, Fredrik Borch Olsen, Jesper Borgen, Øyvind Sauvik, Anders Frøen, and Anton Rundberg alongside Walker, Carpenter, and Farruko. The production was done by Alan Walker and Big Fred. Karlsson and Carpenter previously worked together on Carpenter's song \"Bad Time\".\n\nOn March 9, 2019, Alan Walker began teasing the song via his social media. On March 14, 2019, Alan Walker formally announced the song along with its release date. After the announcement of the song, rumors circulated that Sabrina Carpenter and Farruko would feature on the song. Alan Walker confirmed their involvement in the song on March 19, 2019. On March 20, 2019, Walker announced that he partnered with PUBG Mobile for the first anniversary of the game and that the song would be the event's theme song.\n\nThe music video accompanied the song's release and features a female protagonist (Susanne Karin Moe) searching for \"mysterious stones\" in order to uncover a lost ancient civilization. It was directed by Kristian Berg and reached 80 million views more than a month after the video was released on YouTube. As of November 2022, it has amassed over 485 million views and 9.1 million likes.\n\nIt was later revealed that the video, alongside the music videos of Walker's later songs \"Alone, pt. II\" and \"Heading Home\", are tied to the events of the previous World of Walker tetralogy that consists of \"Tired\", \"All Falls Down\", \"Darkside\", and \"Diamond Heart\" respectively. Despite this, the trilogy of the later videos is depicted as a prequel to the original tetralogy. \"Paradise\"'s music video is set between the two trilogies.\n\nOn May 10, 2019, the alternative video was posted on Alan Walker's YouTube channel, encouraging viewers to \"choose their path\" of either two video versions of Carpenter and Farruko in the official alternative music video, both were posted on their respective channels that same day. The two versions of the alternative music video indicated different searches, pieces of evidence, and artifacts that the female protagonist was searching for (depending on the viewer's choice) which led to each version ending with the same outcome, which is the scene where tombstones with stone formations which were laid on the site, that took place a month before the events of the official music video when the artifacts were being unearthed and discovered.\n\nAlan Walker's interactive alternative video received over 1.7 million views (as of December 30, 2020), while Carpenter and Farruko's alternative music videos received over 13 million views and 65 million views, respectively. Carpenter and Walker performed the song on Good Morning America's Summer Concert Series. <a href=\"http:\/\/www.last.fm\/music\/Alan+Walker\/_\/On+My+Way\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}