{
  "created_at": "2025-05-03T14:30:42.998339+00:00",
  "elapsed": 0.3059,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:30:42.998339+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "6629",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:30:43 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Queen&format=json&method=track.getInfo&track=Somebody+to+Love"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Queen&format=json&method=track.getInfo&track=Somebody+to+Love",
  "_decoded_content": {
    "track": {
      "name": "Somebody to Love",
      "mbid": "a0460df0-e45a-441f-b692-a5972ae29d23",
      "url": "https:\/\/www.last.fm\/music\/Queen\/_\/Somebody+to+Love",
      "duration": "295000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "911523",
      "playcount": "5416952",
      "artist": {
        "name": "Queen",
        "mbid": "420ca290-76c5-41af-999e-564d7c71f1a7",
        "url": "https:\/\/www.last.fm\/music\/Queen"
      },
      "album": {
        "artist": "Queen",
        "title": "Greatest Hits",
        "mbid": "e510d91f-f1dc-469c-9927-e7f2e31fdbd3",
        "url": "https:\/\/www.last.fm\/music\/Queen\/Greatest+Hits",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/1aec5cac8403fbda275b8200b77c8318.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/1aec5cac8403fbda275b8200b77c8318.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/1aec5cac8403fbda275b8200b77c8318.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/1aec5cac8403fbda275b8200b77c8318.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "11"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "classic rock",
            "url": "https:\/\/www.last.fm\/tag\/classic+rock"
          },
          {
            "name": "rock",
            "url": "https:\/\/www.last.fm\/tag\/rock"
          },
          {
            "name": "Queen",
            "url": "https:\/\/www.last.fm\/tag\/Queen"
          },
          {
            "name": "70s",
            "url": "https:\/\/www.last.fm\/tag\/70s"
          },
          {
            "name": "british",
            "url": "https:\/\/www.last.fm\/tag\/british"
          }
        ]
      },
      "wiki": {
        "published": "09 Sep 2008, 14:34",
        "summary": "\"Somebody to Love\" is a song by British rock  band Queen. Written by singer Freddie Mercury, the track featured on their 1976 album A Day at the Races, from which it was also released as the lead single.\n\nLike \"Bohemian Rhapsody\", the major hit from Queen's previous album A Night At The Opera, \"Somebody to Love\" has a complex melody and deep layering of vocal tracks, this time based on a gospel choir arrangement. It was the first single off the album A Day at the Races. <a href=\"http:\/\/www.last.fm\/music\/Queen\/_\/Somebody+to+Love\">Read more on Last.fm<\/a>.",
        "content": "\"Somebody to Love\" is a song by British rock  band Queen. Written by singer Freddie Mercury, the track featured on their 1976 album A Day at the Races, from which it was also released as the lead single.\n\nLike \"Bohemian Rhapsody\", the major hit from Queen's previous album A Night At The Opera, \"Somebody to Love\" has a complex melody and deep layering of vocal tracks, this time based on a gospel choir arrangement. It was the first single off the album A Day at the Races. It is a rock ballad on which band members Freddie Mercury, Brian May and Roger Taylor multitracked their voices to create the impression of a 100-voice gospel choir.\n\n The lyrics, especially combined with the gospel influence, create a song about faith, desperation and soul-searching; the singer questions both the lack of love he's experiencing and the role of God in helping to provide this disparately needed in his life. He's passionately pondering what the use of it all is without having somebody to love in his life. Staying true to Queen's guitar-driven style, it was also filled with intricate harmonies and a notable guitar solo by Brian May, and it went to number 2 on the UK charts and number 13 on the U.S. singles chart.\n\nA promotional video was made combining a staged recording session at Sarm East Studios (where the A Day at the Races album was recorded) and film footage of the band's performance at Hyde Park that September.\n\nThe song was included on their first Greatest Hits, released in 1981.\n\nAt the 1992 Freddie Mercury Tribute Concert held at Wembley Stadium, the song was performed by George Michael, and this was later rereleased in 1993 as the lead track of an EP called Five Live which went to #1 in the UK. This version is also available on Greatest Hits III, released in 1999.\n\nRoger Taylor  spoke briefly on the song during a  31\/01\/1977 interview with Circus Magazine.\n\n Taylor:  \"'Somebody To Love' is Aretha Franklin-influenced. Freddie's very much into that. We tried to keep the track in a loose, gospel-type feel. I think it's the loosest track we've ever done.\"\n\nThis was also one of few tracks where John Deacon sang backing vocals when performed live. His voice was clearly heard on bootlegs from the band's performance at Earls Court in June, 1977 and at the Houston Summit in December, 1977. From 1977 to 1978, it was played about every show. For the Jazz and Live Killer tours, it was only played sometimes. In The Game Tour, it was only played early in the tour. It was also played for South America Bites The Dust, Live at the Bowl and Queen Rock Montreal. Later in The Works Tour, a shortened version was played as a medley preceding \"Killer Queen\".\n\nWhen performed live, Mercury would often alter the melodies of the song, but would generally hit the sustained A♭4 notes throughout the song. The A♭4 at the peak of the building line \"can anybody find me\" on the studio version was not part of Mercury's original melody, but the other band members felt that it worked better than his: Mercury reverted to his original melody for this line when live.\n\nAt the 1992 Freddie Mercury Tribute Concert held at Wembley Stadium, the song was performed by George Michael, and this was later rereleased in 1993 as the lead track of an EP called Five Live which went to #1 in the UK. This version is also available on Greatest Hits III, released in 1999.\n\n    * George Michael performed the song with Queen's surviving members at the Freddie Mercury Tribute Concert in April 1992\n    * G4 sang this on 27 November during The X Factor 2004.\n    * Anne Hathaway sang this song in her role as Ella in the movie Ella Enchanted\n    * Elliott Yamin, who placed third in season five of American Idol, sang this song on Week 8 of live performances\n    * Brittany Murphy sings this song in the movie Happy Feet as her penguin character Gloria.\n    * Ben Mills sang this on 2 December during Barry Manilow and contestant's choice week of The X Factor 2006.\n    * Rhydian Roberts sang it on 1 December during Best of British week of The X Factor 2007.\n    * The cast of Glee covered it in the episode \"The Rhodes Not Taken\" (2009); it hit #26 on the UK Singles Chart.\n    * Joe McElderry sang this on 14 November during Queen week of The X Factor 2009.\n    * In the film Late Last Night, Steven Weber's character sings the song during a drug-infused dreamy scene.\n    * Todrick Hall performed this song on the ninth season of American Idol during the top 16. <a href=\"http:\/\/www.last.fm\/music\/Queen\/_\/Somebody+to+Love\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}