{
  "created_at": "2025-05-03T14:33:13.553468+00:00",
  "elapsed": 0.247561,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:33:13.553468+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "6018",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:33:13 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Dua+Lipa&format=json&method=track.getInfo&track=Boys+Will+Be+Boys"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Dua+Lipa&format=json&method=track.getInfo&track=Boys+Will+Be+Boys",
  "_decoded_content": {
    "track": {
      "name": "Boys Will Be Boys",
      "url": "https:\/\/www.last.fm\/music\/Dua+Lipa\/_\/Boys+Will+Be+Boys",
      "duration": "166000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "394193",
      "playcount": "3595524",
      "artist": {
        "name": "Dua Lipa",
        "url": "https:\/\/www.last.fm\/music\/Dua+Lipa"
      },
      "album": {
        "artist": "Dua Lipa",
        "title": "Future Nostalgia (Deluxe)",
        "url": "https:\/\/www.last.fm\/music\/Dua+Lipa\/Future+Nostalgia+(Deluxe)",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/de0e9d7f78d163a3ac5c69139ea57749.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/de0e9d7f78d163a3ac5c69139ea57749.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/de0e9d7f78d163a3ac5c69139ea57749.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/de0e9d7f78d163a3ac5c69139ea57749.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "Disco",
            "url": "https:\/\/www.last.fm\/tag\/Disco"
          },
          {
            "name": "electronic",
            "url": "https:\/\/www.last.fm\/tag\/electronic"
          },
          {
            "name": "electropop",
            "url": "https:\/\/www.last.fm\/tag\/electropop"
          },
          {
            "name": "dance",
            "url": "https:\/\/www.last.fm\/tag\/dance"
          }
        ]
      },
      "wiki": {
        "published": "06 Jul 2021, 13:23",
        "summary": "\"Boys Will Be Boys\" is a song by English singer Dua Lipa from her second studio album \"Future Nostalgia\", serving as the album's closing track. Lipa wrote the song with Kennedi, Justin Tranter and Jason Evigan, while the production was handled by Koz. It is a baroque pop and chamber pop ballad set to orchestral strings and marching band drums with backing vocals from the Stagecoach Epsom Performing Arts Choir. Intending to start a conversation with the song <a href=\"http:\/\/www.last.fm\/music\/Dua+Lipa\/_\/Boys+Will+Be+Boys\">Read more on Last.fm<\/a>.",
        "content": "\"Boys Will Be Boys\" is a song by English singer Dua Lipa from her second studio album \"Future Nostalgia\", serving as the album's closing track. Lipa wrote the song with Kennedi, Justin Tranter and Jason Evigan, while the production was handled by Koz. It is a baroque pop and chamber pop ballad set to orchestral strings and marching band drums with backing vocals from the Stagecoach Epsom Performing Arts Choir. Intending to start a conversation with the song, \"Boys Will Be Boys\" has themes of feminism and addresses the growing pains girls experience, needing to grow up faster than boys. She condemns toxic masculinity and how society treats women as inferior.\n\nSeveral critics commended the message and lyrics of \"Boys Will Be Boys\" however many found it to be too unlike other tracks on \"Future Nostalgia\" and thought that Lipa did not get her point across correctly. The song appeared on year-end lists published by The New York Times and Nylon while commercially peaking at number 78 in Lithuania and 148 in Portugal. A remix of the song by Zach Witness that samples \"Think (About It)\" by Lyn Collins appears on Lipa and the Blessed Madonna's remix album \"Club Future Nostalgia\". The latter musician played the remix at Lipa's Studio 2054 livestream concert while Lipa performed the song at the 2020 Billboard Women in Music ceremony.\n\nDua Lipa has often used her platform to advocate for issues she believes in, including feminism; of that she usually mentioned female equality in the workplace. The singer condemned the use of the term \"boys will be boys\" in a 2018 interview with GQ. \"Boys Will Be Boys\" was written by Lipa, Kennedi, Justin Tranter and Jason Evigan, while the production was handled by Koz. The song came about during a studio session between Lipa and the team she created \"Physical\" with, when they began talking about Lipa's experiences with men growing up as a female. The singer felt compelled to write the song as it stems from personal experiences and growing pains she faced and after talking about them with her friends and seeing posts on social media, she realized they were universal. These experiences revolved around her feeling powerless or intimidated in public spaces and doing things to avoid sexual harassment, catcalling and confrontation from men. Some of the experiences included putting keys through her knuckles, covering up her body, pretending as if she is on the phone with someone while walking alone, walking home before nightfall, self-policing friends by making sure she knew their location at all times and vice versa, and several other coping mechanisms. Lipa stated that she never thought twice about these experiences and thought they were just something she had to do.\n\nWith \"Boys Will Be Boys\", Lipa desired to start a conversation about issues women and girls face and how they change themselves to fit the lifestyle of men. She stated that much of women's human experience revolves around men and how they make them feel. The singer described that girls are made to feel uncomfortable at a young age with being taught that the way boys treat them is normal and playing a school game such as \"Kiss Chase\". She continued by explaining that it is difficult to change once one has a fixed mindset, so if young listeners could ask questions about these issues are if they are talked about in school, it would make a great impact on society. Additionally, Lipa confirmed that she did not want to offend anyone or point any fingers but she wanted the lyrics to be \"cutting\" for the sake of the conversation. She also wanted to show solidarity with other girls to express comfort that it happens to all girls. \"Boys Will Be Boys\" was recorded at Masterlink Studios in Surrey, RAK Studios in London and Modulator Music in Toronto while the vocals were recorded at TaP Studio in London. The mixing was handled by Jay Reynolds at Long Island Studios and the mixing was done by Chris Gehringer at Sterling Sound in Edgewater, New Jersey. <a href=\"http:\/\/www.last.fm\/music\/Dua+Lipa\/_\/Boys+Will+Be+Boys\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}