{
  "created_at": "2025-05-03T14:32:25.261798+00:00",
  "elapsed": 0.31729,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:32:25.261798+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "3791",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:32:25 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Ufo361&format=json&method=track.getInfo&track=YKKE"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Ufo361&format=json&method=track.getInfo&track=YKKE",
  "_decoded_content": {
    "track": {
      "name": "YKKE",
      "url": "https:\/\/www.last.fm\/music\/Ufo361\/_\/YKKE",
      "duration": "264000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "17183",
      "playcount": "225115",
      "artist": {
        "name": "Ufo361",
        "url": "https:\/\/www.last.fm\/music\/Ufo361"
      },
      "album": {
        "artist": "Ufo361",
        "title": "Lights Out",
        "url": "https:\/\/www.last.fm\/music\/Ufo361\/Lights+Out",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/8bd96bdf316940b24828c3157a0823a2.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/8bd96bdf316940b24828c3157a0823a2.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/8bd96bdf316940b24828c3157a0823a2.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/8bd96bdf316940b24828c3157a0823a2.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": []
      },
      "wiki": {
        "published": "06 Nov 2019, 18:59",
        "summary": "Türkçe: “YKKE” isimli şarkı, Almanya'da yaşamını sürdüren Ufo361'in ve türkçe Rap'in önemli isimlerinden Ezhel'in 15 Kasım 2019'da çikacak olan Lights Out isimli albümlerinin ikinci single ve video çalışmasıdır. Şarkıda her iki sanatçı unutamadıkları bir aşkı konuyu açmakta. Ne kadar sarhoş edici maddeler kullansalar bile, o kişi kafalarından ve hayallerinden çıkmamakta. Ama her ne kadar kendilerini duygusal açıdan çıkmazda hissetseler bile <a href=\"http:\/\/www.last.fm\/music\/Ufo361\/_\/YKKE\">Read more on Last.fm<\/a>.",
        "content": "Türkçe: “YKKE” isimli şarkı, Almanya'da yaşamını sürdüren Ufo361'in ve türkçe Rap'in önemli isimlerinden Ezhel'in 15 Kasım 2019'da çikacak olan Lights Out isimli albümlerinin ikinci single ve video çalışmasıdır. Şarkıda her iki sanatçı unutamadıkları bir aşkı konuyu açmakta. Ne kadar sarhoş edici maddeler kullansalar bile, o kişi kafalarından ve hayallerinden çıkmamakta. Ama her ne kadar kendilerini duygusal açıdan çıkmazda hissetseler bile, yağmurdan sonra elbet güneş doğar ve insan onun için hayatından kopmaması lazım.\n\nŞarkının “YKKE” ismi Türk asıllı Alman Rapçiler olan Yung Kafa & Küçük Efendi'nin isimlerinin başharfleridir ve onlara dayanmakta. Ufo361 ve Ezhel bu şarkıyı Yung Kafa & Küçük Efendi'ye adamış oldular, ki Ufo361'in bir çok sevenleri, bu kadar yüksek bir sesle bir şarkı yapmadığını ve “YKKE” ile bir ilk yapmıştır. Yung Kafa & Küçük Efendi bu tür yüksek ses ile 2015 yılından beri Cloud Rap'i Almanya'ya yerleştiren ilk sanatçılardır, Ufo361 bu şarkıda onların tarzından esinlenmiştir.\n\n\nDeutsch: „YKKE“ ist die zweite Single- und Videoauskopplung der beiden Künstler Ufo361 und Ezhel aus ihrem erstmaligen Kollaborationsalbum Lights Out, welcher voraussichtlich am 15. November 2019 veröffentlicht wird.\nDie Künstler thematisieren im Song ihre Sehnsucht nach ihrer (alten) Liebe, die sie trotz des Konsums berauschender Mittel nicht vergessen können, da sie gemeinsam viele schöne, aber auch schwierige Momente durchlebt haben. Nichtsdestotrotz geht für sie das Leben weiter, da stets die Sonne aufgeht nachdem es geregnet hat.\n\nWas den Songtitel „YKKE“ angeht, handelt es sich hierbei um die jeweiligen Initialien der beiden Künstler Yung Kafa & Küçük Efendi handelt. Ufo361 und Ezhel widmen quasi den beiden den Song, da es für viele Hörer ungewohnt ist, dass Ufos Stimmlange auf diese Art hochgepitcht ist und er somit etwas neues ausprobiert hat, welches genau Yung Kafa & Küçük Efendis Sound entspricht, da sie seit 2015 die ersten in Deutschland waren, die diese Art von Cloudrap etabliert haben. <a href=\"http:\/\/www.last.fm\/music\/Ufo361\/_\/YKKE\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}