{
  "created_at": "2025-05-03T14:29:44.695935+00:00",
  "elapsed": 0.182186,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:29:44.695935+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "12088",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:29:45 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Childish+Gambino&format=json&method=track.getInfo&track=This+Is+America"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Childish+Gambino&format=json&method=track.getInfo&track=This+Is+America",
  "_decoded_content": {
    "track": {
      "name": "This Is America",
      "url": "https:\/\/www.last.fm\/music\/Childish+Gambino\/_\/This+Is+America",
      "duration": "225000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "761555",
      "playcount": "6032605",
      "artist": {
        "name": "Childish Gambino",
        "mbid": "7fb57fba-a6ef-44c2-abab-2fa3bdee607e",
        "url": "https:\/\/www.last.fm\/music\/Childish+Gambino"
      },
      "album": {
        "artist": "Various Artists",
        "title": "So Fresh: The Hits Of Summer 2019 + The Best Of 2018",
        "url": "https:\/\/www.last.fm\/music\/Various+Artists\/So+Fresh:+The+Hits+Of+Summer+2019+%252B+The+Best+Of+2018",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/47ad7bf424f1bcc2340159ba28b3ac94.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/47ad7bf424f1bcc2340159ba28b3ac94.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/47ad7bf424f1bcc2340159ba28b3ac94.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/47ad7bf424f1bcc2340159ba28b3ac94.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          },
          {
            "name": "trap",
            "url": "https:\/\/www.last.fm\/tag\/trap"
          },
          {
            "name": "hip hop",
            "url": "https:\/\/www.last.fm\/tag\/hip+hop"
          },
          {
            "name": "2018",
            "url": "https:\/\/www.last.fm\/tag\/2018"
          }
        ]
      },
      "wiki": {
        "published": "06 May 2018, 18:20",
        "summary": "\"This Is America\" is a song by American rapper Donald Glover, under his musical stage name Childish Gambino. Written by Glover, Ludwig Göransson, and Jeffery Lamar Williams, and produced by Glover and Göransson, it was released on May 5, 2018, at the same time that Gambino was hosting an episode of Saturday Night Live. The song features background vocals by American rappers Young Thug (who also has writing credit as Williams), Slim Jxmmi of Rae Sremmurd, BlocBoy JB, Quavo of Migos, and 21 Savage. <a href=\"http:\/\/www.last.fm\/music\/Childish+Gambino\/_\/This+Is+America\">Read more on Last.fm<\/a>.",
        "content": "\"This Is America\" is a song by American rapper Donald Glover, under his musical stage name Childish Gambino. Written by Glover, Ludwig Göransson, and Jeffery Lamar Williams, and produced by Glover and Göransson, it was released on May 5, 2018, at the same time that Gambino was hosting an episode of Saturday Night Live. The song features background vocals by American rappers Young Thug (who also has writing credit as Williams), Slim Jxmmi of Rae Sremmurd, BlocBoy JB, Quavo of Migos, and 21 Savage. The song addresses the wider issue of gun violence in the United States, the high rate of mass shootings in the United States, along with other social issues like longstanding racism and discrimination.\n\nThe song's accompanying music video was directed by filmmaker Hiro Murai, a frequent Gambino collaborator. \"This Is America\" became the 31st song to debut at number one on the US Billboard Hot 100, becoming both Gambino's first number one and top ten single in the country. It has also topped the charts in Australia, Canada, and New Zealand. The song won in all four of its nominated categories at the 61st Annual Grammy Awards: Record of the Year, Song of the Year, Best Rap\/Sung Performance and Best Music Video. This made Gambino the first hip-hop artist to win Record of the Year and Song of the Year, and \"This Is America\" the first rap song to win these awards.\n\nComposition\nThe song features a gospel-style choir and background contributions from various American rappers. Young Thug, Slim Jxmmi, BlocBoy JB, 21 Savage and Quavo each deliver an ad-lib. Young Thug returns to supply the song's outro. The lyrics primarily address black culture in the United States and gun violence in the country. It also touches on the subject of police brutality and misconduct. Pitchfork's Stephen Kearse described the song as a representation of the \"tightrope of being black\", with the song \"built on the sharp contrast between jolly, syncretic melodies and menacing trap cadences\". Bryan Rolli of Forbes calls it \"a vicious, urgent take on modern trap music, as Glover adopts the clipped, percussive flow of his contemporaries atop crackling 808s and rumbling bass.\"\n\nMedia outlets reported that a number of listeners accused Gambino of plagiarism over \"This Is America\", pointing out the similarities between the song and \"American Pharaoh\" by Jase Harley. CBS News stated, \"The tracks have a similar sound, and share similar themes in the lyrics.\" Harley stated that he felt \"This Is America\" was influenced by his song, but that he does not have an issue with it. Glover's manager, Fam Rothstein, denied any plagiarism.\n\nMusic video\nThe music video was directed by Hiro Murai and released on YouTube simultaneously with Gambino's performance of the song on Saturday Night Live. The video received about 12.9 million views in 24 hours, and has over 868 million views as of February 2023. In an interview with the New York Times, Murai discussed his upcoming season for Atlanta, a show created by and starring Glover. He stated, \"There's sort of a world-weariness in both this season and the music video. They're both reactions to what's happening in the world.\"\n\nThe video contains many scenes involving violence. It starts off with a shirtless Gambino dancing through a warehouse, interacting with a series of chaotic scenes. According to Murai, the video was inspired by the films Mother! and City of God. Prettyman states \"The video tests us, taunting us to keep pace as we try to decode every gesture and calculation\". Choreographed by Sherrie Silver, Gambino and his entourage of young dancers perform several viral dance moves including the South African Gwara Gwara and \"Shoot\" popularized by BlocBoy JB, who is one of the ad-lib contributors on the song. Gambino's dancing is contrasted against moments of violence. Only 53 seconds into the video, Gambino shoots a man in the back of the head with a handgun, while assuming a comical stance similar to a Jim Crow caricature. The first person depicted as being shot in the video, a guitarist who had been accompanying Gambino's singing up to that point, was musician Calvin the Second, but was initially mistaken by many viewers to be the father of 17-year-old gun violence victim Trayvon Martin. This first shooting also marks a transition in the music, from an African \"folk-inspired melody\" to \"dark, pulsing trap\".\n\nAt a later point, Childish Gambino uses a Kalashnikov patterned automatic weapon to gun down a church choir, which viewers have interpreted as a reference to the 2015 Charleston church shooting. In both instances, a child appears from off-screen holding a red cloth, on which Gambino gently lays the weapon used, while the bodies are simply dragged away, which viewers have interpreted \"as a reference to Americans' willingness to protect gun rights over people\". In one of the moves while dancing, Gambino positions his arms as though he is threatening others with a gun. The music stops and people run away in fear, after which Gambino lights a joint. Scenes also involved children using their cell phones to record the chaos happening in the video, while Gambino sings the lyrics \"This a celly \/ That's a tool\". Martha Tesema, writer for website Mashable, stated that \"cell phones have been used as tools to broadcast police shooting, rioting against, or choking black people in this country\". Throughout the video, numerous vehicles from several decades ago are featured, many of them with their hazard lights flashing and the driver's side door ajar, which critics interpreted as representing fatal police shootings during traffic stops, particularly the shooting of Philando Castile, who was shot while in a 1997 Oldsmobile; others have interpreted that the older model cars represent the relative lack of upward mobility of African Americans. American singer SZA makes a cameo appearance towards the end of the video, seated atop one of these vehicles. The video ends with Gambino in a darkened portion of the warehouse, fearfully running towards the camera while being chased by several white people. Viewers have said this resembles scenes from the 2017 film Get Out.\n\nThe dance moves were based on various African dances such as Angolan gyrations, the Ghanaian Azonto, as well as the Nigerian Ashoko and the South African gwara gwara.\n\nCritical reception\nSpencer Kornhaber of The Atlantic described the initial reaction on Twitter as \"a gushing river of well-deserved praise\" and the video as \"the most talked-about music video of recent memory.\" Daniel Kreps of Rolling Stone commented that the video \"is a surreal, visceral statement about gun violence in America\". Pitchfork awarded the song the distinction of \"Best New Track\". Billboard critics ranked it 10th among the \"greatest music videos of the 21st century.\" Mahita Gajanan of Time quoted music history professor Guthrie Ramsey at the University of Pennsylvania:\n\nHe's talking about the contradictions of trying to get money, the idea of being a black man in America. It comes out of two different sound worlds. Part of the brilliance of the presentation is that you go from this happy major mode of choral singing that we associate with South African choral singing, and then after the first gunshot it moves right into the trap sound.\n\nWill Gompertz, arts editor of the BBC, asserted that \"This Is America\" was a \"powerful and poignant allegorical portrait of 21st Century America, which warrants a place among the canonical depictions of the USA from Grant Wood's American Gothic to Edward Hopper's Nighthawks, from Emanuel Leutze's Washington Crossing the Delaware to America the Beautiful by Norman Lewis\".\n\nIn December 2018, Billboard ranked \"This Is America\" as the 6th best song of the year.\n\nThe music video won the International Film Festival of the Art of Cinematography Camerimage Award for Best Cinematography in a Music Video, as well as the Grammy Award for Best Music Video at the 61st Grammy Awards.\n\nCover versions and media appearances\nGlover hosted the May 5 episode of the 43rd season of Saturday Night Live, and performed two new songs as Childish Gambino on the same episode, the second of which was \"This Is America\". Daniel Kaluuya, best known as the star of the film Get Out which the music video reportedly references, introduced the song's performance.\n\nSeveral artists attracted attention and millions of views for creating covers of the song and music video with altered lyrics and themes, retaining the song's instrumental and the general structure of its music video. Nigerian rapper Falz released \"This Is Nigeria\" on May 25, highlighting the nation's issues with corruption and organized crime among others.\n\nThe music video also spawned popular Internet memes, particularly those in which the audio was replaced so that Childish Gambino appeared to be dancing in time to another song. Versions using Carly Rae Jepsen's \"Call Me Maybe\" and Earth, Wind & Fire's \"September\" were some of the most viewed.\n\nThe song is interpolated into a scene in the film Guava Island.\n\nChart performance\n\"This Is America\" debuted at number one on the US Billboard Hot 100, becoming the 31st song to do so in the chart's history. It debuted with 78,000 downloads sold and 65.3 million US streams in the first week. Its music video accounted for 68% of the song's streaming total. \"This Is America\" is also Gambino's first top 10; he previously reached number 12 in August 2017 with \"Redbone\". \"This Is America\" overtook Drake's \"Nice for What\" from the top position for two weeks. Gambino is also the second Emmy Award-winning actor to reach number one on the Hot 100, the first being Justin Timberlake, who topped the chart with \"Can't Stop the Feeling!\" in 2016. It topped the Hot 100 for two weeks, and left the top ten after five weeks. <a href=\"http:\/\/www.last.fm\/music\/Childish+Gambino\/_\/This+Is+America\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}