{
  "created_at": "2025-05-03T14:32:03.202296+00:00",
  "elapsed": 0.190046,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:32:03.202296+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4884",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:32:03 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=5+Seconds+of+Summer&format=json&method=track.getInfo&track=Teeth"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=5+Seconds+of+Summer&format=json&method=track.getInfo&track=Teeth",
  "_decoded_content": {
    "track": {
      "name": "Teeth",
      "url": "https:\/\/www.last.fm\/music\/5+Seconds+of+Summer\/_\/Teeth",
      "duration": "204000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "619705",
      "playcount": "7862995",
      "artist": {
        "name": "5 Seconds of Summer",
        "mbid": "830e5c4e-6b7d-431d-86ab-00c751281dc5",
        "url": "https:\/\/www.last.fm\/music\/5+Seconds+of+Summer"
      },
      "album": {
        "artist": "5 Seconds of Summer",
        "title": "Teeth",
        "url": "https:\/\/www.last.fm\/music\/5+Seconds+of+Summer\/Teeth",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/82f15d432f2715149fc82f1de2a48710.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/82f15d432f2715149fc82f1de2a48710.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/82f15d432f2715149fc82f1de2a48710.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/82f15d432f2715149fc82f1de2a48710.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "rock",
            "url": "https:\/\/www.last.fm\/tag\/rock"
          },
          {
            "name": "alternative rock",
            "url": "https:\/\/www.last.fm\/tag\/alternative+rock"
          },
          {
            "name": "pop rock",
            "url": "https:\/\/www.last.fm\/tag\/pop+rock"
          },
          {
            "name": "2010s",
            "url": "https:\/\/www.last.fm\/tag\/2010s"
          },
          {
            "name": "2019",
            "url": "https:\/\/www.last.fm\/tag\/2019"
          }
        ]
      },
      "wiki": {
        "published": "03 Mar 2022, 03:06",
        "summary": "\"Teeth\" is a song by Australian pop rock band 5 Seconds of Summer, released on 21 August 2019 as the second single from the band's fourth studio album \"CALM\". It also appears on the third season soundtrack of the Netflix series \"13 Reasons Why\". Written by band members Luke Hemmings and Ashton Irwin with Ali Tamposi, and produced by Andrew Watt and Louis Bell, the track features guitar from Tom Morello of Rage Against the Machine, and its music video was released the same day. <a href=\"http:\/\/www.last.fm\/music\/5+Seconds+of+Summer\/_\/Teeth\">Read more on Last.fm<\/a>.",
        "content": "\"Teeth\" is a song by Australian pop rock band 5 Seconds of Summer, released on 21 August 2019 as the second single from the band's fourth studio album \"CALM\". It also appears on the third season soundtrack of the Netflix series \"13 Reasons Why\". Written by band members Luke Hemmings and Ashton Irwin with Ali Tamposi, and produced by Andrew Watt and Louis Bell, the track features guitar from Tom Morello of Rage Against the Machine, and its music video was released the same day. The track's instrumental samples \"So What\", an unreleased song by late American rapper Juice Wrld and also produced by Bell and Watt, which was recorded in 2018 during the sessions for Wrld on \"Drugs\", Juice Wrld's collaborative mixtape with American rapper Future.\n\nSimilarly to the band's previous single \"Easier\", an alternate \"Live from the Vault\" version of the song was released. \"Teeth – Live from the Vault\" was released on 29 October 2019 and was accompanied by a video directed by Thibaut Duverneix.\n\nAt the APRA Music Awards of 2020, \"Teeth\" was nominated for Song of the Year, while it won Song of the Year at the 2020 ARIA Music Awards.\n\nThe song was announced on the band's social media on 16 August 2019, along with a 15-second teaser that Alternative Press called \"ominous\". The song was used as the official theme song for WWE Survivor Series 2019 in addition to appearing in ESPN's 2019 Saturday Night Football season.\n\nThe music video, directed by Thibaut Duverneix and also released on 21 August 2019, features the band \"subjected to an experiment-gone-wrong resulting in each member's personal hellscape\", and was called \"dark\" and \"creepy\" by Rolling Stone. It starts with the 4 members in what seems to be like a dentist's office. In their dreams, the members successfully escape their hellscape. Luke is in a foggy room, Ashton is in a room where the walls are made of linen blown by a big fan, Calum tries to pull a big brick using chains, and Michael climbs a tall ladder. As of September 2021, it has more than 85 million views.\n\n\"I love that song. It has that driving kick and that bass; we tried to make a song without having a snare. It has a few in it, but it’s mainly kick and it’s my breath doing all of the other beats. Tom Morello plays the guitar solo at the end. He’s almost imitating a snare with his guitar.\" - Luke Hemmings via Apple Music\n\nIn an email sent to subscribers, Calum said the following:\n\n\"My perfect balance of finding vulnerability with aggression. I wasn’t a part of writing this song, so when I did hear it, I knew Ashton and Luke found another part of the soul of this band. I hope you sincerely love it as much as I do. We are in another growing phase…this time I see it more segregated instead of a collective; in a positive way.\" <a href=\"http:\/\/www.last.fm\/music\/5+Seconds+of+Summer\/_\/Teeth\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}