{
  "created_at": "2025-05-03T14:38:57.450028+00:00",
  "elapsed": 0.194694,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:38:57.450028+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "12347",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:38:57 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Kanye+West&format=json&method=track.getInfo&track=All+of+the+Lights"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Kanye+West&format=json&method=track.getInfo&track=All+of+the+Lights",
  "_decoded_content": {
    "track": {
      "name": "All of the Lights",
      "mbid": "a4c4457b-577e-4fac-b820-713bb91dbb6c",
      "url": "https:\/\/www.last.fm\/music\/Kanye+West\/_\/All+of+the+Lights",
      "duration": "299000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1599430",
      "playcount": "17330042",
      "artist": {
        "name": "Kanye West",
        "mbid": "164f0d73-1234-4e2c-8743-d77bf2191051",
        "url": "https:\/\/www.last.fm\/music\/Kanye+West"
      },
      "album": {
        "artist": "Kanye West",
        "title": "My Beautiful Dark Twisted Fantasy",
        "mbid": "cd7d8c81-d519-4149-8cd0-ade722ad19b9",
        "url": "https:\/\/www.last.fm\/music\/Kanye+West\/My+Beautiful+Dark+Twisted+Fantasy",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/8a071c4b073625018de5f0ac58727511.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/8a071c4b073625018de5f0ac58727511.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/8a071c4b073625018de5f0ac58727511.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/8a071c4b073625018de5f0ac58727511.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "5"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          },
          {
            "name": "Kanye West",
            "url": "https:\/\/www.last.fm\/tag\/Kanye+West"
          },
          {
            "name": "hip hop",
            "url": "https:\/\/www.last.fm\/tag\/hip+hop"
          },
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "Rihanna",
            "url": "https:\/\/www.last.fm\/tag\/Rihanna"
          }
        ]
      },
      "wiki": {
        "published": "14 Dec 2010, 00:57",
        "summary": "\"All of the Lights\" is a song by American rapper Kanye West, as the fourth single from his fifth studio album \"My Beautiful Dark Twisted Fantasy\". It was produced by West and features additional vocals from several other recording artists, including John Legend, The-Dream, Elly Jackson, Alicia Keys, Fergie, Elton John, Drake, Kid Cudi, and Rihanna; the latter two are credited on music video, while solely the latter is credited on the single.\n\n\"All of the Lights\" was well received by music critics <a href=\"http:\/\/www.last.fm\/music\/Kanye+West\/_\/All+of+the+Lights\">Read more on Last.fm<\/a>.",
        "content": "\"All of the Lights\" is a song by American rapper Kanye West, as the fourth single from his fifth studio album \"My Beautiful Dark Twisted Fantasy\". It was produced by West and features additional vocals from several other recording artists, including John Legend, The-Dream, Elly Jackson, Alicia Keys, Fergie, Elton John, Drake, Kid Cudi, and Rihanna; the latter two are credited on music video, while solely the latter is credited on the single.\n\n\"All of the Lights\" was well received by music critics, who complimented its detailed production and dramatically-themed style. The single was a moderate international success, reaching number 18 on the Billboard Hot 100, was the 59th most popular song of 2011, and number two on the Hot R&B\/Hip-Hop Songs chart in the United States, being the 12th most popular song on that chart in 2011, while it also attained respectable chartings in several other countries. It won Grammy Awards for Best Rap Song and Best Rap\/Sung Collaboration and was nominated for Song of the Year at the 54th Grammy Awards. As of December 2011, the song has sold over 1,561,000 digital units in the US. By August 2013, it had been certified triple platinum by the RIAA.\n\nThe song's accompanying music video, directed by Hype Williams, featured strobe-lit images of Rihanna and West, as well as Kid Cudi. It was given a discretionary warning by Epilepsy Action, stating that the video \"potentially triggers seizures for people with photosensitive epilepsy\". West and Rihanna performed the song at the 2011 NBA All-Star Game, while it was also featured in the promo for the same event.\n\nBackground and recording\n\"All of the Lights\" was written by Kanye West, Jeff Bhasker, Malik Jones, Warren Trotter, Stacy Ferguson and Terius Nash. Its production was helmed by West himself and co-produced by Bhasker. Fourteen artists lent their voices as background vocals to the song: Alicia Keys, John Legend, The-Dream, Drake, Fergie, Kid Cudi, Elton John, Ryan Leslie, Charlie Wilson, Tony Williams, La Roux, Alvin Fields, Ken Lewis, and Rihanna, who also sang the song's hook and is labeled as a featured artist on the single version. West and Rihanna previously collaborated with Jay-Z on \"Run This Town\" (The Blueprint 3, 2009).\n\nThe early working title for \"All of The Lights\" was previously \"Ghetto University\" when the production on the song was just beginning. During the 2010 MTV Europe Music Awards, on November 10, 2010, Rihanna was interviewed by MTV News' staff. In the interview she explained that, West already played his album to her three months ago and that \"All of the Lights\" was one of her favorite songs. About it, she further commented, \"So when he asked me to come up to the studio at 2 o'clock in the morning, I had to, because I loved it, I knew it was that song.\"\n\nIn an interview for the same publication, Elly Jackson said of the song's vocal layering, \"He got me to layer up all these vocals with other people, and he just basically wanted to use his favorite vocalists from around the world to create this really unique vocal texture on his record, but it's not the kind of thing where you can pick it out\". Andrew Dawson, Anthony Kilhoffer, Mike Dean, HI and Noah Goldstein recorded West's vocals at Avex Recording Studios in Honolulu, Hawaii and Electric Lady Studios in New York City. Rihanna's vocals were recorded by Marcos Tovar at the Westlake Recording Studios in West Hollywood, California.\n\nIn a 2013 interview with The Breakfast Club, West said that the song took two years to finish, and detailed the creation and process of the song;\n\n\"'All The Lights' is a futurist song that started out as a Jeezy record with horns on it, then we put in another bridge, then Dream wrote the hook, then Rihanna sang it, and by the time you got it, it was to the level of like, the Nike Flyknit or something like that.\n\nLeaks and release\nEven though not fully leaked, \"All of the Lights\" was featured for the first time on \"Runaway\"—a 35-minute film about West's \"true labor of love\" which was released on October 23, 2010. The song was featured in the film together with other songs from West's then-upcoming fifth studio album My Beautiful Dark Twisted Fantasy (2010), including \"Monster\", \"Power\" and \"Lost in the World\" among others. The song fully leaked on November 4, 2010, online.\n\nWest announced through his Twitter account that \"All of the Lights\" would be the album's fourth single. Following the album's release, the song debuted at number 92 on the Billboard Hot 100. \"All of the Lights\" was released as a single on January 18, 2011 in the US and was released in the UK on February 21, 2011. Rihanna was credited as a featured artist for the single when impacting radio. In the United Kingdom, it was included in BBC Radio 1's B-Playlist.\n\nThe song was released as fourth and final single from My Beautiful Dark Twisted Fantasy. It was sent to British urban radio stations on November 25, 2010, and to Australian contemporary hit and alternative radio stations on December 13. On January 18, 2011, the song was sent to contemporary hit and rhythmic radio in the United States. On February 19, 2011, \"All of the Lights\" was solicited to mainstream radio stations in the United Kingdom.\n\nComposition\n\"All of the Lights\" is a hip hop song that runs for 4 minutes and 59 seconds. According to the sheet music published by Universal Music Publishing Group at Musicnotes.com, it was composed in the key of B flat minor using common time and a steady groove. Rihanna's vocal range spans from the low note of Ab3 to the falsetto note of F5. Instrumentation is provided by drums, bass, piano and horns. The piano is played by Elton John, who also together with thirteen other vocalists provides the background vocals. American singers Fergie and Alicia Keys, sing the break-downs and Ad-libs, respectively. Alex Deney from NME called the song a \"sleb-studded centrepiece\".\n\nReception\n\"All of the Lights\" received critical acclaim. AllMusic's Andy Kellman stated \"At once, the song features one of the year’s most rugged beats while supplying enough opulent detail to make Late Registration collaborator Jon Brion's head spin\". Alex Denney of NME called it \"the sleb-studded centrepiece\", commenting that \"In anyone else’s hands it’d be an A-list circle-jerk of horrid proportions, but through Kanye’s bar-raising vision it becomes a truly wondrous thing\". Zach Baron of The Village Voice found the song's lyrics relevant to the \"year of economic suffering\", writing that \"West interrupted his own wealthy anomie to pen 'All of the Lights,' an incongruously star-stuffed song about a disoriented parolee trying to beat a restraining order and see his daughter, working out a brief reunion with her estranged mother: 'Public visitation, we met at Borders'\". Chicago Sun-Times writer Thomas Conner viewed that \"as crowded as 'All of the Lights' is [,] it maintains an almost operatic drama, telling a tale of adultery and its aftermath that winds up being quite moving\". The Guardian's Kitty Empire cited the song as \"the album's most magnificent high\", writing that it \"backs up operatic levels of sound with great drama\".\n\nAnn Powers of NPR included \"All of the Lights\" in her list of the Top 10 Top 40 singles of 2011, commenting \"its like an action painting: the artist scatters elements across its canvas to form a whole that's all motion and colorful build.\" Slant Magazine named it the best single of 2011, describing the song as \"perhaps the most acute example of Kanye West’s pitched mania for theatrical expressions of manic-depressive instability, his mixture of self-destruction and self-love\", they later listed it second in their list of the best singles of the 2010s in 2019.\n\nTampa Bay Times named it the second best pop song of the decade, proclaiming \"Everything Kanye West has ever believed himself to be came to life in this song: The stadium-sized horns, the chilling Rihanna hook, the snarl of cockiness in his voice, the insane list of uncredited cameos .. It’s the moment King Midas figured out how to use his touch.\" Elsewhere, Nothing but Hope and Passion listed it 13th on its list of \"100 Must Listen Songs of the 2010s\". Time Out named it the 13th best song of all-time in 2016.\n\nMusic video and remix\nThe music video for \"All of the Lights\" was filmed in January 2011 and directed by Hype Williams. It features strobe-lit images of Rihanna and West, Kid Cudi in a red leather suit, and visual references to Gaspar Noé's 2009 film Enter the Void. The video premiered through West's Vevo channel on February 19, 2011. After reports of the video's images causing seizures with epileptic viewers and a public response from British organization Epilepsy Action, an alternate video was released that includes a discretionary warning that the video \"potentially trigger seizures for people with photosensitive epilepsy\", and removed its opening prologue and neon credits. In 2015, the video faced controversy when Gaspar Noé commented the similarities between the video and Enter the Void, especially when Hype Williams featured his name in the title and credit sequences over and over again.\n\nAn earlier version of the song's remix was leaked in 2010, featuring a verse by Drake. On March 14, 2011, an unfinished version of the remix was leaked to the internet, featuring guest verses from Lil Wayne, Big Sean, and Drake, a different verse from the leak. It did not feature West himself, though he did write a verse for it, according to Big Sean.\n\nMedia\nIn 2016, the song was used in a Gatorade commercial starring Serena Williams. The song is also featured in the game NBA 2K14 as part of the soundtrack chosen by LeBron James. In 2019, The song was featured in a Peloton TV commercial, entitled; Our Kind of Joy. Liverpool F.C. used the song during their medal collection and trophy lift after winning the 2019–20 Premier League, and played the song last in the dressing room before matches throughout the season. <a href=\"http:\/\/www.last.fm\/music\/Kanye+West\/_\/All+of+the+Lights\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}