{
  "created_at": "2025-05-03T14:30:42.865562+00:00",
  "elapsed": 0.226837,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:30:42.865562+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4821",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:30:43 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Queen&format=json&method=track.getInfo&track=I+Want+To+Break+Free"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Queen&format=json&method=track.getInfo&track=I+Want+To+Break+Free",
  "_decoded_content": {
    "track": {
      "name": "I Want to Break Free",
      "mbid": "9948b388-b41c-4cfd-a22d-aee0f42dee3b",
      "url": "https:\/\/www.last.fm\/music\/Queen\/_\/I+Want+to+Break+Free",
      "duration": "254000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1019615",
      "playcount": "5943351",
      "artist": {
        "name": "Queen",
        "mbid": "420ca290-76c5-41af-999e-564d7c71f1a7",
        "url": "https:\/\/www.last.fm\/music\/Queen"
      },
      "album": {
        "artist": "Queen",
        "title": "Greatest Hits II",
        "mbid": "92faa683-a1a5-4198-a55d-af3471f14c94",
        "url": "https:\/\/www.last.fm\/music\/Queen\/Greatest+Hits+II",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/5acf44b6b52e40d5a345f5f39c4cb715.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/5acf44b6b52e40d5a345f5f39c4cb715.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/5acf44b6b52e40d5a345f5f39c4cb715.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/5acf44b6b52e40d5a345f5f39c4cb715.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "5"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "classic rock",
            "url": "https:\/\/www.last.fm\/tag\/classic+rock"
          },
          {
            "name": "rock",
            "url": "https:\/\/www.last.fm\/tag\/rock"
          },
          {
            "name": "80s",
            "url": "https:\/\/www.last.fm\/tag\/80s"
          },
          {
            "name": "Queen",
            "url": "https:\/\/www.last.fm\/tag\/Queen"
          },
          {
            "name": "glam rock",
            "url": "https:\/\/www.last.fm\/tag\/glam+rock"
          }
        ]
      },
      "wiki": {
        "published": "13 Oct 2009, 19:38",
        "summary": "\"I Want to Break Free\" is a song performed by Queen, which was written by bassist John Deacon. According to the I Want To Break Free Songfacts, he wrote it from the male perspective of the women's liberation movement. It featured on their 1984 album The Works. In the UK Chart, it peaked at number 3, and remained in the chart for fifteen consecutive weeks from its release in late April 1984. Most of the song follows the traditional 12 bar blues progression in E Major, a rare thing for a Queen song. <a href=\"http:\/\/www.last.fm\/music\/Queen\/_\/I+Want+to+Break+Free\">Read more on Last.fm<\/a>.",
        "content": "\"I Want to Break Free\" is a song performed by Queen, which was written by bassist John Deacon. According to the I Want To Break Free Songfacts, he wrote it from the male perspective of the women's liberation movement. It featured on their 1984 album The Works. In the UK Chart, it peaked at number 3, and remained in the chart for fifteen consecutive weeks from its release in late April 1984. Most of the song follows the traditional 12 bar blues progression in E Major, a rare thing for a Queen song. The synth solo is played by Fred Mandel – live, however, May played it on guitar.\n\nTwo differing versions of the song are in circulation. The version on The Works is in fact shorter than the single remix by 61 seconds, because of a fade-in synthesiser introduction and a longer solo in which both the synthesiser and guitar feature separately. This is in contrast to \"Hammer to Fall\", a song which was edited down by thirty seconds from the album version to be released as a single. The promotional 45 sent to radio stations by Capitol Records had both versions on either side. However, Queen's name and the song title were deliberately left off one, so the labels read \"Special Single Mix (Queen 4:21)\" and \"Special Single Mix-Edited (3:59).\n\nThe music video, directed by David Mallet, was a parody of the northern British soap opera Coronation Street. During part of the video, the band members dressed in drag, as mildly similar characters found in the soap at the time; Mercury's character was loosely based on Bet Lynch, while May's character was based on Hilda Ogden. The video also depicted the band in what appeared to be a coal mine in their normal look, and it also features a ballet piece with the Royal Ballet (one of the dancers was Jeremy Sheffield), for which Freddie Mercury shaved his trademark moustache to portray Nijinsky (though he had kept it for the parody part of the video, interestingly enough). According to Brian May in an interview about Queen's Greatest Hits, the video ruined the band in America, where many people - unlike the case in the UK - failed to see the soap-opera connection & interpreted the video as an open declaration of transvestitism and Mercury’s homosexuality. This might explain why singles failed to go above #40 in the US Billboard charts after \"Radio Ga Ga\", until The Show Must Go On reached No. 2. The video was initially banned by MTV in the U.S., but the ban was lifted in 1991 when it aired on VH1's My Generation 2-part episodes devoted to Queen hosted by guitarist Brian May. The song received renewed attention when it was used in a media advertising campaign for Safeway. <a href=\"http:\/\/www.last.fm\/music\/Queen\/_\/I+Want+to+Break+Free\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}