{
  "created_at": "2025-05-03T14:39:20.542575+00:00",
  "elapsed": 0.277731,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:39:20.542575+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "6061",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:39:20 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Kendrick+Lamar&format=json&method=track.getInfo&track=Money+Trees"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Kendrick+Lamar&format=json&method=track.getInfo&track=Money+Trees",
  "_decoded_content": {
    "track": {
      "name": "Money Trees",
      "url": "https:\/\/www.last.fm\/music\/Kendrick+Lamar\/_\/Money+Trees",
      "duration": "387000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1755214",
      "playcount": "27585749",
      "artist": {
        "name": "Kendrick Lamar",
        "mbid": "381086ea-f511-4aba-bdf9-71c753dc5077",
        "url": "https:\/\/www.last.fm\/music\/Kendrick+Lamar"
      },
      "album": {
        "artist": "Kendrick Lamar",
        "title": "good kid, m.A.A.d city",
        "url": "https:\/\/www.last.fm\/music\/Kendrick+Lamar\/good+kid,+m.A.A.d+city",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/48628c6af67db437b0b9ff156b2c1085.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/48628c6af67db437b0b9ff156b2c1085.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/48628c6af67db437b0b9ff156b2c1085.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/48628c6af67db437b0b9ff156b2c1085.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "MySpotigramBot",
            "url": "https:\/\/www.last.fm\/tag\/MySpotigramBot"
          },
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          },
          {
            "name": "hip hop",
            "url": "https:\/\/www.last.fm\/tag\/hip+hop"
          },
          {
            "name": "west coast hip hop",
            "url": "https:\/\/www.last.fm\/tag\/west+coast+hip+hop"
          }
        ]
      },
      "wiki": {
        "published": "26 Dec 2012, 14:36",
        "summary": "\"Money Trees\" is a song by American rapper Kendrick Lamar, taken from his major label debut studio album good kid, m.A.A.d city. The song, which appears as the fifth track on the album, features a guest appearance from his Black Hippy cohort, fellow American rapper Jay Rock. The song, produced by DJ Dahi, entered the Billboard Bubbling Under Hot 100 chart at number 19 due to high downloads, following the album's release. The song, mixed by Top Dawg engineer Derek \"MixedByAli\" Ali <a href=\"http:\/\/www.last.fm\/music\/Kendrick+Lamar\/_\/Money+Trees\">Read more on Last.fm<\/a>.",
        "content": "\"Money Trees\" is a song by American rapper Kendrick Lamar, taken from his major label debut studio album good kid, m.A.A.d city. The song, which appears as the fifth track on the album, features a guest appearance from his Black Hippy cohort, fellow American rapper Jay Rock. The song, produced by DJ Dahi, entered the Billboard Bubbling Under Hot 100 chart at number 19 due to high downloads, following the album's release. The song, mixed by Top Dawg engineer Derek \"MixedByAli\" Ali, features background vocals from American singer Anna Wise of Sonnymoon. Money Trees samples the Beach House song \"Silver Soul,\" from their 2010 album Teen Dream, as well as vocals from Kendrick’s \"Cartoon and Cereal\" and interpolates lyrics from E-40’s \"Big Ballin’ With My Homies\".\n\nOn June 2, 2015, Jay Rock released the sequel \"Money Trees Deuce\" as a solo record with no feature from Kendrick Lamar.\n\n\"Money Trees\" follows the storyline of \"Good Kid, M.A.A.D City\", as Kendrick Lamar reassesses what happened so far in the story. He talks about having sex with his love interest Sherane and going to tell his friends about it. He also assesses his current situation in his hometown Compton, California and reflects on the immortalization of his uncle after he was shot. At the end of the track, Lamar's mom calls him again and asks him to bring her car back, a recurring theme of the story. His dad has forgotten about the dominos he wanted by now, suggesting that Lamar \"has been out of the house for a while, driving around and trying to figure his life out, having just been attacked outside Sherane’s house.\"\n\nOn August 28, 2013, Taj Stansberry revealed that he had begun to shoot a music video with Lamar and Jay Rock for \"Money Trees\". Stansberry, who called the song his favorite song on the album, said upon getting the job to come up with a treatment for the video that was due in a day, he dropped everything right then and created a website for the idea to present to Lamar. He added: \"I started literally at 9 in the morning and finished at 9 at night.\" As of June 2018, no further information has been announced regarding the video.\n\nEven without being released as a single, the song spent seven weeks on the US charts and peaked at number 19 on the US Billboard Bubbling Under Hot 100 Singles chart.\n\n\"Money Trees\" by Kendrick Lamar is a masterful work of art that showcases the artist's skillful use of language, storytelling, and social commentary. The song is built around a smooth and soulful beat, with Kendrick's lyrics seamlessly flowing over the instrumentation.\n\nThe lyrics of \"Money Trees\" are rich with meaning and depth, exploring themes of temptation, greed, and the desire for success. Kendrick tells the story of growing up in a neighborhood where money is scarce and violence is prevalent, and the struggles he faced in trying to break free from that cycle.\n\nOne of the most impressive aspects of \"Money Trees\" is Kendrick's use of language. His lyrics are packed with clever wordplay, metaphors, and allusions, all of which serve to enhance the storytelling aspect of the song. The chorus, for example, is built around the refrain \"money trees is the perfect place for shade,\" which is a play on words that captures both the allure and danger of material wealth.\n\nThe production on \"Money Trees\" is equally impressive, with the beat featuring a jazzy piano riff and smooth bassline that create a laid-back and mellow vibe. The mix is clean and crisp, with each element of the instrumental and vocal tracks blending together seamlessly.\n\nOverall, \"Money Trees\" is a powerful and impactful work of art that showcases Kendrick Lamar's exceptional talent as a rapper and storyteller. The song's rich and complex lyrics, combined with its soulful and expertly crafted production, make it a standout track not just in Kendrick's catalog, but in the history of hip-hop as a genre. <a href=\"http:\/\/www.last.fm\/music\/Kendrick+Lamar\/_\/Money+Trees\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}