{
  "created_at": "2025-05-03T14:28:58.776464+00:00",
  "elapsed": 0.205351,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:28:58.776464+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "20354",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:28:59 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Band+Aid&format=json&method=track.getInfo&track=Do+They+Know+It%27s+Christmas"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Band+Aid&format=json&method=track.getInfo&track=Do+They+Know+It%27s+Christmas",
  "_decoded_content": {
    "track": {
      "name": "Do They Know It's Christmas?",
      "mbid": "d3a862d6-5be5-4050-9e5a-9c577d46bb14",
      "url": "https:\/\/www.last.fm\/music\/Band+Aid\/_\/Do+They+Know+It%27s+Christmas%3F",
      "duration": "231000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "438238",
      "playcount": "1512221",
      "artist": {
        "name": "Band Aid",
        "mbid": "0ecaa896-58fa-4dca-b53d-8da7bc5f59c5",
        "url": "https:\/\/www.last.fm\/music\/Band+Aid"
      },
      "album": {
        "artist": "Band Aid",
        "title": "Do They Know It's Christmas?",
        "mbid": "969900f9-a7a4-4d1f-96e3-37eab9775a1b",
        "url": "https:\/\/www.last.fm\/music\/Band+Aid\/Do+They+Know+It%27s+Christmas%3F",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/5f560b3c60ba4d8281771655b33d854d.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/5f560b3c60ba4d8281771655b33d854d.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/5f560b3c60ba4d8281771655b33d854d.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/5f560b3c60ba4d8281771655b33d854d.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "2"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "christmas",
            "url": "https:\/\/www.last.fm\/tag\/christmas"
          },
          {
            "name": "80s",
            "url": "https:\/\/www.last.fm\/tag\/80s"
          },
          {
            "name": "xmas",
            "url": "https:\/\/www.last.fm\/tag\/xmas"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "band aid",
            "url": "https:\/\/www.last.fm\/tag\/band+aid"
          }
        ]
      },
      "wiki": {
        "published": "25 Dec 2009, 00:06",
        "summary": "\"Do They Know It's Christmas?\" is a song written by Bob Geldof and Midge Ure in 1984 to raise money for relief of 1984–1985 famine in Ethiopia. The original version was produced by Midge Ure and released by Band Aid on 29 November 1984.\n\nIn late 1984, a BBC report by Michael Buerk was aired highlighting the famine that had hit the people of Ethiopia. Irish singer Bob Geldof saw the report and wanted to raise money. He called Midge Ure from Ultravox and together they quickly co-wrote the song, \"Do They Know It's Christmas?\". <a href=\"http:\/\/www.last.fm\/music\/Band+Aid\/_\/Do+They+Know+It%27s+Christmas%3F\">Read more on Last.fm<\/a>.",
        "content": "\"Do They Know It's Christmas?\" is a song written by Bob Geldof and Midge Ure in 1984 to raise money for relief of 1984–1985 famine in Ethiopia. The original version was produced by Midge Ure and released by Band Aid on 29 November 1984.\n\nIn late 1984, a BBC report by Michael Buerk was aired highlighting the famine that had hit the people of Ethiopia. Irish singer Bob Geldof saw the report and wanted to raise money. He called Midge Ure from Ultravox and together they quickly co-wrote the song, \"Do They Know It's Christmas?\".\n\nGeldof kept a November appointment with BBC Radio 1 DJ Richard Skinner to appear on his show, but instead of discussing his new album (the original reason for his booking), he used his airtime to publicise the idea for the charity single, so by the time the musicians were recruited there was intense media interest in the subject.\n\nGeldof put together a group called Band Aid, consisting of leading Irish and British musicians who were among the most popular of the era. The 1984 original became the biggest selling single in UK singles chart history, selling a million copies in the first week alone. It stayed at Number 1 for five weeks, becoming Christmas number one, and ultimately sold more than 3.5 million copies domestically. It remained the highest selling single in UK chart history until 1997, when Elton John's \"Candle in the Wind 1997\" was released in tribute to the late Diana, Princess of Wales, which sold almost 5 million copies in Britain.\n\nRespected producer Trevor Horn was approached by Geldof to produce the song, but he was unavailable. Instead, he gave use of his studio, Sarm West in London, free of charge to the project for 24 hours, which Geldof accepted, assigning Ure as the producer instead. On 25 November 1984, the song was recorded and mixed.\n\nGeldof and Ure arrived first at dawn so that Ure could put the recorded backing tracks, put together at his home studio, on to the system at SARM. He also had vocals recorded by both Sting and Simon Le Bon of the song which he had acquired from the artists early in order to provide a guide for the other singers.\n\nThe world's media were in attendance as artists began arriving from 9am. Duran Duran, Spandau Ballet, Paul Young, Culture Club (without Boy George, initially), George Michael of Wham!, Kool and the Gang, Sting, Bono and Adam Clayton of U2, Glenn Gregory of Heaven 17 (whom Ure personally ordered down) and his bandmate Martyn Ware, Phil Collins, Paul Weller of the Style Council, Francis Rossi and Rick Parfitt of Status Quo, Jody Watley of Shalamar, Bananarama, Marilyn (who was not invited but arrived anyway) and some of Geldof's bandmates from the Boomtown Rats all arrived. Only one of Ure's Ultravox colleagues, Chris Cross, attended. Geldof, noticing Boy George's non-attendance (despite ringing him up in New York the day before demanding he sing on the record), went back to the phone to get the Culture Club frontman out of bed and on to Concorde.\n\nUre played the backing track and guide vocals to the artists together, then decided, in a way of getting all involved straightaway, to record the crescendo first, which also allowed the 'team shot' of the day to be photographed. The artists were put in a huge group and sang the 'Feed the world, let them know it's Christmas time' refrain over and over again until it was completed.\n\nThen Ure sought a volunteer to be first into the studio to sing the main body of the song. Eventually Tony Hadley of Spandau Ballet took the plunge, with plenty of rival artists watching him, and sang the song straight through. The other assigned singers then did likewise, with Ure taping their efforts and then making notes as to which bits would be cut into the final recording. Le Bon, despite having already done his bit at Ure's house, re-recorded his so he could be part of the moment. Sting also recorded the words again, this time to provide harmony.\n\nPhil Collins arrived with his entire drum kit and waited until Ure was ready to record him over an electronic drum track that had already been put in place. The song ended up as a mixture of Collins' drums and an African rhythm that opens the song, taken from a sample of The Hurting by Tears for Fears.\n\nNot all went smoothly. Ure stated in his autobiography that he was constantly battling with Geldof, the song's lyricist but not renowned for his melody skills, and telling him to leave when he would come into the production booth and wrongly tell the artist behind the mic what to sing. Ure also had to shelve an attempt by the two members of Status Quo to record the \"here's to you\" harmonies because Parfitt could not hit the note. Rossi afterwards told Ure that Parfitt never sang in the studio, only onstage, and he should have kept him away from the mic. This section was eventually taken on by Weller, Sting and Gregory. However, Quo were able to contribute in other ways, according to the journalist Robin Eggar:\n\n\"Once Status Quo produced their bag of cocaine and the booze started to flow – I brought six bottles of wine from my flat, which disappeared in a minute – it became a party.\"\n\nBoy George arrived at 6 pm and went straight into the recording booth to deliver his lines. Boy George was rather vocal in his dislike of fellow singer George Michael, some of which is caught on video during the filming of the Band Aid collaboration. While recording harmonies, Boy George openly confused Michael's recorded vocals with the voice of \"Alf\" (British singer-songwriter Alison Moyet, who did not participate in the charity single). When the engineer correctly identified the voice as that of Michael, Boy George replied, \"God, he sounded camp. But then he is.\" Once Boy George had finished his tracks, Ure had all the vocals he needed and, as the artists began to party and then drifted away, began working on the mix. A B-side, featuring messages from artists who had and hadn't made the recording (including David Bowie, Paul McCartney, all members of Big Country and Holly Johnson from Frankie Goes to Hollywood) was also recorded over the same backing track. Trevor Horn arrived back to his own studio to put this together.\n\nDespite being singers themselves, neither Geldof nor Ure had a solo line on the song, though both took part in the 'Feed the world' crescendo.\n\nUre worked on the mix through the night and finally completed the task at 8am on the Monday morning. Prior to departing SARM, Geldof recorded a statement: \"This record was recorded on the 25th of November 1984. It's now 8am on the 26th. We've been here 24 hours and I think it's time we went home.\"\n\nThe song was quickly dispatched to the pressing plants who had promised to have the single pressed and ready by the Tuesday. A spell of publicity and final legal details followed, then it hit the shops on Thursday 29 November in a sleeve designed by Peter Blake. It went straight to #1.\n\nParticipants\n\nThe original Band Aid ensemble consisted of (in sleeve order):\n\n    * Adam Clayton (U2)\n    * Queen\n    * Phil Collins (Genesis, solo)\n    * Bob Geldof (The Boomtown Rats)\n    * Steve Norman (Spandau Ballet)\n    * Chris Cross (Ultravox)\n    * John Taylor (Duran Duran)\n    * Paul Young\n    * Tony Hadley (Spandau Ballet)\n    * Glenn Gregory (Heaven 17)\n    * Simon Le Bon (Duran Duran)\n    * Simon Crowe (The Boomtown Rats)\n    * Marilyn\n    * Keren Woodward (Bananarama)\n    * Martin Kemp (Spandau Ballet)\n    * Jody Watley (Shalamar)\n    * Bono (U2)\n    * Paul Weller (The Style Council)\n    * James \"J.T.\" Taylor (Kool & the Gang)\n    * George Michael (Wham!)\n    * Midge Ure (Ultravox)\n    * Martyn Ware (Heaven 17)\n    * John Keeble (Spandau Ballet)\n    * Gary Kemp (Spandau Ballet)\n    * Roger Taylor (Duran Duran)\n    * Sarah Dallin (Bananarama)\n    * Siobhan Fahey (Bananarama)\n    * Pete Briquette (The Boomtown Rats)\n    * Francis Rossi (Status Quo)\n    * Robert 'Kool' Bell (Kool & the Gang)\n    * Dennis J. T. Thomas (Kool & the Gang)\n    * Andy Taylor (Duran Duran)\n    * Jon Moss (Culture Club)\n    * Sting (The Police)\n    * Rick Parfitt (Status Quo)\n    * Nick Rhodes (Duran Duran)\n    * Johnny Fingers (The Boomtown Rats)\n    * David Bowie\n    * Boy George (Culture Club)\n    * Holly Johnson (Frankie Goes to Hollywood)\n    * Paul McCartney\n    * Stuart Adamson (Big Country)\n    * Bruce Watson (Big Country)\n    * Tony Butler (Big Country)\n    * Mark Brzezicki (Big Country)\n\nThe song comprises two parts: a verse and bridge which allow individual singers to perform different lines; and a chorus in the form of two repeated phrases by ensemble. The chorus was added by Midge Ure shortly before the recording session. The first line of the recording is sung by Paul Young on the 1984 version, Kylie Minogue on the 1989 version, and Chris Martin on the 2004 version. The line was originally written for David Bowie who finally sang it at the Live Aid concert in 1985. See the Band Aid article for the full list of contributors.\n\nThe following morning Geldof appeared on Mike Read's BBC Radio 1 Breakfast Show to promote the record and promised that every penny would go to the cause. This led to a stand-off with the British Government which refused to waive the VAT (sales tax) on the sales of the single. Geldof made the headlines by publicly standing up to Prime Minister Margaret Thatcher and, sensing the strength of public feeling, the government backed down and donated the tax back to the charity.\n\nRadio 1 began to play the song every hour - normally an A-list single got seven or eight plays per day - as the public mood was gripped. The DJs began to take apart the song in order to identify each vocalist, and BBC Television was persuaded by Geldof (who rang BBC1 controller Michael Grade personally) that Top of the Pops, the flagship chart show, should break with tradition and feature a song which had yet to be released. Grade watched the video and immediately ordered that every preceding program should start five minutes early in order to accommodate it on Top of the Pops. David Bowie flew into England to record an introduction for the video.\n\nThe single was released on 3 December 1984, and went straight to #1 in the UK pop charts, outselling all the other records in the chart put together. It became the fastest selling single of all time in the UK, selling a million in the first week alone. It stayed at Number 1 for five weeks and ultimately sold more than three million copies.\n\nDuring the release of \"Do They Know It's Christmas?\", while he was at Number 1 in the charts, singer\/songwriter Jim Diamond publicly pleaded with people not to buy his own single \"I Should Have Known Better\" that week, and urged them to instead buy \"Do They Know It's Christmas?\". He was quoted as saying \"I'm delighted to be at number 1, but next week I don't want people to buy my record; I want them to buy Band Aid instead.\"\n\nEach week of its stay at #1, the video would be shown on Top of the Pops, although for the Christmas Day episode, reviewing the year's hits, the song was relayed through the speaker system where all the artists mimed their own line - with the exception of Bono. U2 wasn't invited on to the episode, as they'd only had one hit in 1984 and were still a growing band, so Paul Weller was given the task of miming Bono's words as well as his own.\n\nIn the United States, the video was played on MTV frequently throughout the holiday season. It sold more than a million copies in the U.S. but did not reach #1 there, due to the more complex nature of the chart system, which counted airplay as well as sales. Despite outselling the official #1 by four to one, it did not make the Top Ten due to a lack of airplay, ultimately peaking at #13 on the Billboard Hot 100.\n\nTwelve months later, \"Do They Know It's Christmas?\" returned to the UK charts, reaching #3 in the week after Christmas of 1985, with only songs by Whitney Houston and Shakin' Stevens preventing its return to the top merely 47 weeks after it had left the #1 spot.\n\nThe single was released just before Christmas with the aim of raising money for the relief of the famine. Geldof's somewhat cautious hope was for £70,000. Ultimately, however, the song raised many millions of pounds and became the biggest-selling single in UK singles chart history. It has since been passed by Elton John's tribute to Diana, Princess of Wales, \"Candle in the Wind 1997\".\n\nEventually, the British-American band Foreigner displaced the song at #1 in the UK with their rock ballad \"I Want to Know What Love Is\" at the beginning of 1985. During Band Aid's tenure at the top, Wham! had stayed at #2 with their double A-side \"Last Christmas\"\/\"Everything She Wants\", which became the biggest selling single (at over a million) not to reach #1 in the UK. George Michael and Andrew Ridgeley donated their royalties from this record to Band Aid.\n\nIn 2001, the song was included on the Now That's What I Call Christmas! CD, along with 35 other popular Christmas songs, many by the original artists who made them famous. Those artists (or their legal heirs) who participated on the CD received a platinum album for their contributions to its success (certified 6x Platinum in November 2004).\n\nA new version was recorded under the name of Band Aid II in 1989, produced by the popular Hit Factory team of Stock, Aitken and Waterman and featuring a number of the year's most accessible artists, including Kylie Minogue, Jason Donovan, Lisa Stansfield and Bros. Bananarama also appeared, making Sarah Dallin and Keren Woodward the only artists to appear on both versions (although they couldn't be heard on the first). The song again reached #1 for Christmas, raising more money and also making it the final number-one single of the 1980s and it was final song to be played on Top of the Pops in the Eighties, whom of it was the original version of the song.\n\nBand Aid 20 recorded a third version of the song in November 2004 for the twentieth anniversary of the original recording, and again got to #1. The idea was prompted by Coldplay singer Chris Martin, although Geldof and Ure both got quickly involved. Geldof did the publicity and educated the younger artists on the issues (some of the artists weren't born when the original was recorded) while Ure assisted producer Nigel Godrich and filmed the event for the corresponding documentary.\n\nThis version of the song featured an extra segment - a rap by Dizzee Rascal in the midst of the \"here's to you\" section. Bono arrived at the recording to sing the same line as two decades earlier, making him the third artist to appear on two versions, except for Geldof and Ure.\n\nWhile the 1989 and 2004 versions of Do They Know It's Christmas had notable chart success (despite both being criticized for their very \"pop\" oriented sound which lacked the earnestness of the original recording), the popularity of the 1984 recording has remained unmatched and the record has seen numerous re-releases in small numbers around Christmas over the years.\n\nIn 2005, a \"benefit spoof\" of this song was released by \"The North American Halloween Prevention Initiative\" made up of a wide variety of indie artists. The proceeds of the single titled \"Do They Know It's Hallowe'en?\" were donated to UNICEF.\n\nRichard Cheese and Lounge Against the Machine covered this into a Lounge style song on their 2006 album, \"Silent Nightclub\".\n\nIn 2004, the Swedish singer Shirley Clamp recorded a cover of the song with a schlager rhythm that sold very well in Sweden. It's still being sold in stores and it is a very popular Christmas song.\n\nCanadian band Barenaked Ladies recorded a version of the song, which they had played live for several years, for their 2004 release Barenaked for the Holidays. The release of the album happened to coincide with the 2004 Band Aid release. All the profits\/royalties the band receive for their release are donated to the Stephen Lewis Foundation.\n\nThere are two Polish versions of that song, both called \"Daj im znak\", which means \"give them a sign.\" One is recorded by Cugowski Brothers, Maciej Silski, and Grzegorz Markowski (Perfect), and the other Magda Rzemek, Cugowski brothers (Bracia), and Artur Gadowski (IRA).\n\nPiccolo Coro dell'Antoniano; Italian choir of children, also has been performing it occasionally. Their first time was in 2003, at the annual Christmas Concert. It has also appeared twice on their Christmas albums.\n\nIn Japan, since 2003, an interlude of this song was used as a chime in the Super express Kodama and Hikari running Tokaido Shinkansen.\n\nIn 2003, the Germany's TV AllStars released a version of the song. At Christmas 2004, Conan O'Brien of Late Night with Conan O'Brien did a segment on his show that was supposed to be a sale of a Christmas CD called \"Do They Know the Singers of 'Do They Know It's Christmas?'?\"\n\nIn 2006, the creators of the Adult Swim cartoon The Venture Bros. recorded a cover of the song, sung in the voices of the characters they play on the show.\n\nIn 1999, The Echoing Green recorded a cover version which appeared on the album Electronica.\n\nIn 2002, Pulp did a parody of the song in the video for their single \"Bad Cover Version\" that featured impersonators dressed as many of the same artists from the original song.\n\nAlso in 2009, Toronto punk rock band Fucked Up released a version of the song, featuring vocals from GZA, Ezra Koenig of Vampire Weekend, Bob Mould of Hüsker Dü, Tegan and Sara, Yo La Tengo, Kevin Drew of Broken Social Scene, comedian David Cross, Andrew W.K. and Kyp Malone of TV on the Radio. The recording was financed using some of Fucked Up's 2009 Polaris Music Prize award. The money received from purchasing the track off of iTunes was split between three Canadian charity groups, Justice for Missing and Murdered Indigenous Women, DTES Power of Women Group, and Sisters in Spirit, all advocates against violence against women. <a href=\"http:\/\/www.last.fm\/music\/Band+Aid\/_\/Do+They+Know+It%27s+Christmas%3F\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}