{
  "created_at": "2025-05-03T14:29:53.471632+00:00",
  "elapsed": 0.184733,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:29:53.471632+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5198",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:29:53 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=KIDS+SEE+GHOSTS&format=json&method=track.getInfo&track=4th+Dimension"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=KIDS+SEE+GHOSTS&format=json&method=track.getInfo&track=4th+Dimension",
  "_decoded_content": {
    "track": {
      "name": "4th Dimension",
      "url": "https:\/\/www.last.fm\/music\/Kids+See+Ghosts\/_\/4th+Dimension",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "586652",
      "playcount": "8413483",
      "artist": {
        "name": "Kids See Ghosts",
        "url": "https:\/\/www.last.fm\/music\/Kids+See+Ghosts"
      },
      "toptags": {
        "tag": [
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "Kanye West",
            "url": "https:\/\/www.last.fm\/tag\/Kanye+West"
          },
          {
            "name": "louis prima",
            "url": "https:\/\/www.last.fm\/tag\/louis+prima"
          },
          {
            "name": "kid cudi",
            "url": "https:\/\/www.last.fm\/tag\/kid+cudi"
          },
          {
            "name": "MySpotigramBot",
            "url": "https:\/\/www.last.fm\/tag\/MySpotigramBot"
          }
        ]
      },
      "wiki": {
        "published": "17 Mar 2022, 04:05",
        "summary": "\"4th Dimension\" is a song by American hip-hop duo Kids See Ghosts, composed of the rappers Kanye West and Kid Cudi, from their eponymous debut studio album. The song features a guest appearance from Louis Prima, who was credited as a featured artist due to his work being sampled. It was produced by West, with additional production from Mike Dean and Noah Goldstein. The producers co-wrote the song with Kid Cudi and Prima, with the latter of the two receiving credit as a result of it sampling music by him. <a href=\"http:\/\/www.last.fm\/music\/Kids+See+Ghosts\/_\/4th+Dimension\">Read more on Last.fm<\/a>.",
        "content": "\"4th Dimension\" is a song by American hip-hop duo Kids See Ghosts, composed of the rappers Kanye West and Kid Cudi, from their eponymous debut studio album. The song features a guest appearance from Louis Prima, who was credited as a featured artist due to his work being sampled. It was produced by West, with additional production from Mike Dean and Noah Goldstein. The producers co-wrote the song with Kid Cudi and Prima, with the latter of the two receiving credit as a result of it sampling music by him. A hip hop song, it samples Prima's \"What Will Santa Claus Say (When He Finds Everybody Swingin')\" and Shirley Ann Lee's \"Someday\". Lyrically, the song features Kids See Ghosts presenting their thoughts to stop themselves from becoming worried.\n\nIn 2018, the song debuted at number 42 on the US Billboard Hot 100, marking the first time a track with Prima appeared on the Hot 100 since 1961 and thus breaking Bobby Helms' record. The song further reached the top 50 in Australia, Canada, Ireland, and the United Kingdom. It has since been certified gold in the United States by the Recording Industry Association of America (RIAA).\n\nOn June 26, 2020, \"4th Dimension\" was used as the soundtrack for a preview of Kids See Ghosts' Takashi Murakami-directed animated show of the same name. The clip features the characters Kanye Bear and Kid Fox, who are voiced by West and Kid Cudi, respectively. In the clip, the characters are sucked into a different dimension, where they successfully manage to escape a cemetery. Kids See Ghosts performed the song live at the 2018 Camp Flog Gnaw Carnival.\n\nThe staff of Complex reached out to the Gia Maione Prima Foundation's attorney Anthony Sylvester in June 2018 to find out how Prima became featured, which Sylvester explained by saying:\n\n\"It all happened very quickly, within the last week. Kanye and his people were gracious with sharing the recording with us, and acknowledging the contribution of Louis Prima to the song. They were very, very receptive to the idea that, for all intents and purposes, Louis was featured. I don't know if they had it in their minds before, or if it was simply something that we thought on our side. I didn't really expect [the idea of Louis being a featured artist] to go anywhere. And then the next day, there it was. It really speaks to the graciousness of Kanye and his people, I must say.\"\n\nSylvester elaborated as he recalled that West and his people told him \"what their plans were\" and \"how excited they were,\" with him feeling \"equally excited\" after becoming aware of their plans and he admitted \"a lot of good things\" happened very quickly. He revealed that he was surprised they wanted to sample a holiday song, not remembering any sample requests for \"What Will Santa Claus Say? (When He Finds Everybody Swingin')\" ever before and Sylvester confirmed his \"jaw dropped.\" According to Sylvester, it was him who approved the sample and he assumed \"royalties are paid\" to the foundation as a result of Prima receiving a writing credit as a writer while expressing the feeling that the sample request \"won't be the last now.\" \"4th Dimension\" was produced by West, with additional production being handled by Dean alongside Noah Goldstein. Prior to sampling gospel singer Shirley Ann Lee's \"Someday\" on the song, West had sampled the recording for \"Ghost Town\", with the sample showing continuity of the track. The connection between the track and Kids See Ghosts is also evident from the album being titled as such, as well as it featuring the sequel \"Freeee (Ghost Town, Pt. 2)\". Originally, \"Ghost Town\" was slated for release as the fourth track on the album. <a href=\"http:\/\/www.last.fm\/music\/Kids+See+Ghosts\/_\/4th+Dimension\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}