{
  "created_at": "2025-05-03T14:30:47.075187+00:00",
  "elapsed": 0.228533,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:30:47.075187+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "7822",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:30:47 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Queen&format=json&method=track.getInfo&track=Keep+Yourself+Alive"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Queen&format=json&method=track.getInfo&track=Keep+Yourself+Alive",
  "_decoded_content": {
    "track": {
      "name": "Keep Yourself Alive",
      "mbid": "c459d5fc-2be7-46d0-9565-b6caa6c626a7",
      "url": "https:\/\/www.last.fm\/music\/Queen\/_\/Keep+Yourself+Alive",
      "duration": "228000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "204656",
      "playcount": "998359",
      "artist": {
        "name": "Queen",
        "mbid": "420ca290-76c5-41af-999e-564d7c71f1a7",
        "url": "https:\/\/www.last.fm\/music\/Queen"
      },
      "album": {
        "artist": "Queen",
        "title": "Queen",
        "mbid": "47a61826-8264-46e1-a1ef-e854618195c5",
        "url": "https:\/\/www.last.fm\/music\/Queen\/Queen",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/2d786dd2b4fc4c35b1b4b486f12553ec.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/2d786dd2b4fc4c35b1b4b486f12553ec.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/2d786dd2b4fc4c35b1b4b486f12553ec.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/2d786dd2b4fc4c35b1b4b486f12553ec.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "1"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "classic rock",
            "url": "https:\/\/www.last.fm\/tag\/classic+rock"
          },
          {
            "name": "rock",
            "url": "https:\/\/www.last.fm\/tag\/rock"
          },
          {
            "name": "hard rock",
            "url": "https:\/\/www.last.fm\/tag\/hard+rock"
          },
          {
            "name": "Queen",
            "url": "https:\/\/www.last.fm\/tag\/Queen"
          },
          {
            "name": "70s",
            "url": "https:\/\/www.last.fm\/tag\/70s"
          }
        ]
      },
      "wiki": {
        "published": "24 Feb 2009, 01:59",
        "summary": "\"Keep Yourself Alive\" is the first track on the English rock group Queen's eponymous debut album - Queen, released in 1973 -  and was written by guitarist Brian May. It was released as Queen's first single along with another song from the album, \"Son and Daughter\".\n\nMay had written the song when the band had already been formed several years prior, before John Deacon joined the original trio of Freddie Mercury, Roger Taylor, and May.\n\nAccording to an interview with May in a radio special about their 1977 album News of the World <a href=\"http:\/\/www.last.fm\/music\/Queen\/_\/Keep+Yourself+Alive\">Read more on Last.fm<\/a>.",
        "content": "\"Keep Yourself Alive\" is the first track on the English rock group Queen's eponymous debut album - Queen, released in 1973 -  and was written by guitarist Brian May. It was released as Queen's first single along with another song from the album, \"Son and Daughter\".\n\nMay had written the song when the band had already been formed several years prior, before John Deacon joined the original trio of Freddie Mercury, Roger Taylor, and May.\n\nAccording to an interview with May in a radio special about their 1977 album News of the World, he had penned the lyrics thinking of them as ironic and tongue-in-cheek, but their sense was completely changed when Freddie Mercury sang them.\n\nThe newly-formed Queen quickly added \"Keep Yourself Alive\" to the live set. Mercury commented that the song \"was a very good way of telling people what Queen was about in those days\" (RAM, 21 May 1976, p 17). Indeed, the number included a drum solo by Roger Taylor and one line sung\/spoken by him (\"Do you think you're better every day?\"), followed by a response line sung\/spoken by Brian May. (\"No I think I'm two steps nearer to my grave\"). Other recordings, and live performances, have May's line performed by Mercury.\n\n\"Keep Yourself Alive\" was part of the band's live set until the early 1980s. On the 1980 and 1981 tours, the band would play an improvisational jam before the start of the song then after the drum solo, it would morph into Taylor's tympani drum solo followed by May's echo-plexed guitar solo spot before either segueing into the \"Brighton Rock\" finale or a drum and guitar climax or segued into a Flash Gordon medley (which consisted of \"Battle Theme\"\/\"Flash's Theme\"\/\"The Hero\"). The band would not play it again until 1984 on The Works tour as part of a medley of older songs (with \"Somebody to Love\", \"Killer Queen\", \"Seven Seas of Rhye\", and \"Liar\").\n\nIn live performances, Mercury would often sing the line \"all you people keep yourself alive\" (which is sung only two times in the studio version) in place of the more-repeated line \"it'll take you all your time and a money honey you'll survive\".\n\nThe first version of \"Keep Yourself Alive\" is from summer 1971 at De Lane Lea Studios. It was produced by Louie Austin and includes the intro played on Brian May's Hairfred acoustic guitar. All of the song elements were already present, including call-and-response vocals by Freddie Mercury (verses) and during the break, where Roger Taylor sang a line and Mercury answered it. This demo version remains Brian May's favourite take of the song.\n\nSubsequently they did several attempts to \"recapture the magic\" when they went on to do the \"real\" version at Trident Studios. The one mixed by Mike Stone was the only one moderately accepted, and it's the one released as single. It includes Freddie Mercury doing all of the harmony vocals in the chorus (multi-tracking himself) and Brian May singing the \"two steps nearer to my grave\" line instead of Mercury (who did it live and in earlier versions). This recording does not use acoustic guitar; the printed transcription on EMI Music Publishing's Off the Record' sheet music lists at least seven electric guitar parts, one of which uses a prominent phasing effect. It can also be noted that this recording includes the line \"Come on and get it, get it, get it boy, keep yourself alive,\" which was not in the original version.\n\nIt's been suggested by some fans and Queen scholars that Mercury could have helped on the musical songwriting, based on the fact that (as it's been recalled by former bassists and the band themselves) they were in a more collaborative period in the pre-studio days and Mercury was usually the one getting his way with structural ideas. While it's highly possible that he contributed ideas to the song (the modulation types and the expanded form are closer to his style than May's), the bottom line is that even in that case Mercury would be more a co-arranger than a co-writer per-se (like George Martin on The Beatles' songs).\n\n\nInterviews with Queen:\n\nBrian May - 1983, BBC Radio One:\n\n\"The first recording of it ever was in De Lane Lea when we did it ourselves and I’ve still got that recording and I think it’s very good and has something which the single never had. But THEY pressurised us very strongly to redo all the tracks and we redid ‘Keep Yourself Alive’ with Roy and it was pretty awful, actually. I thought it was terrible and I was very unhappy about it and I thought the De Lane Lea one was better and I eventually managed to persuade Roy that it was better as well. So, we went back in and did it again in a way that was a bit more true to the original. But there is no way that you can ever really repeat something. I have this great belief that the magic of the moment can never be recaptured and, although we ended up with something that was technically in the playing and perhaps even in the recording a bit better than the De Lane Lea thing. I still think that the De Lane Lea one had that certain sort of magic, so I was never really happy. As it turned out no one else was ever really happy either and we kept remixing it. We thought that it’s the mix that’s wrong, we kept remixing and there must have been, at least, seven or eight different mixes by different groups of people. Eventually we went in and did a mix with Mike Stone, our engineer, and that’s the one that we were in the end happiest with. That’s the one we put out.\n\nBut, to my mind ‘Keep Yourself Alive’ was never really satisfactory. Never had that magic that it should have had.\" <a href=\"http:\/\/www.last.fm\/music\/Queen\/_\/Keep+Yourself+Alive\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}