{
  "created_at": "2025-05-03T14:30:46.377974+00:00",
  "elapsed": 0.228549,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:30:46.377974+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4001",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:30:46 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Billie+Eilish&format=json&method=track.getInfo&track=ocean+eyes"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Billie+Eilish&format=json&method=track.getInfo&track=ocean+eyes",
  "_decoded_content": {
    "track": {
      "name": "Ocean Eyes",
      "url": "https:\/\/www.last.fm\/music\/Billie+Eilish\/_\/Ocean+Eyes",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1212192",
      "playcount": "13838100",
      "artist": {
        "name": "Billie Eilish",
        "url": "https:\/\/www.last.fm\/music\/Billie+Eilish"
      },
      "toptags": {
        "tag": [
          {
            "name": "indie",
            "url": "https:\/\/www.last.fm\/tag\/indie"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "indie pop",
            "url": "https:\/\/www.last.fm\/tag\/indie+pop"
          },
          {
            "name": "dream pop",
            "url": "https:\/\/www.last.fm\/tag\/dream+pop"
          },
          {
            "name": "alternative",
            "url": "https:\/\/www.last.fm\/tag\/alternative"
          }
        ]
      },
      "wiki": {
        "published": "24 Jan 2022, 00:13",
        "summary": "“ocean eyes” is the debut single from then 13-year-old Billie Eilish. She posted the song on SoundCloud where it organically went viral, generating over a million plays. The song has been officially remixed four times, featured in the extended play, \"Ocean Eyes (The Remixes)\".\n\nIn this song, Billie Eilish puts herself in the position of someone she hurt deeply, trying to understand what they went through. The song is a metaphorical love song. Billie Eilish compares her attraction to an individual to that of the ocean. <a href=\"http:\/\/www.last.fm\/music\/Billie+Eilish\/_\/Ocean+Eyes\">Read more on Last.fm<\/a>.",
        "content": "“ocean eyes” is the debut single from then 13-year-old Billie Eilish. She posted the song on SoundCloud where it organically went viral, generating over a million plays. The song has been officially remixed four times, featured in the extended play, \"Ocean Eyes (The Remixes)\".\n\nIn this song, Billie Eilish puts herself in the position of someone she hurt deeply, trying to understand what they went through. The song is a metaphorical love song. Billie Eilish compares her attraction to an individual to that of the ocean. She talks about how deep she’s fallen, and how she gets sucked in by the eyes of her love interest.\n\nThe track has two music videos, with the first being the original, homemade version. It features Eilish against a flowing curtain, singing soulfully to the camera, filmed in one take on her own property. She goes on to talk more about the process of making the music video on a YouTube video with FBE:\n\n\"This was the day after my birthday that we shot this. I had just turned 14. They put makeup on me that I did not want, and they did my hair very fucking weird. The difference between a 13-year-old and then a 16-year-old is so different.\"\n\nThe second is a dance video, highlighting Eilish’s passion for dance with vivid, interpretive choreography.\n\n\"[My brother] came into my room in October of last year to tell me he had this song called “Ocean Eyes.” He’d been doing it with his band before, but of course I’d heard it because I was right next door. I sang it, and we both loved it. It’s just a beautiful song, and [my brother] Finneas is an amazing writer. I loved it and I couldn’t get it out of my head for weeks. I’m in a dance company, and one of my teachers asked if I could record [the song] and send it to him so he could choreograph a dance. So all of the production is based off of lyrical contemporary dance.\" - Billie Eilish via Vouge\n\n\"We put it on SoundCloud with a free download link next to it so my dance teacher could access it. We had no intentions for it, really. But basically overnight a ton of people started hearing it and sharing it. Hillydilly, a music discovery website, found it and posted it and it just got bigger and bigger. It was really surreal. Then, Danny Ruckasin, who is now my manager, reached out to my brother and was like, “dude, this is going to get huge and I think you’re going to need help along the way. I want to help you guys.” We were like, “that’s swag!”\" - Billie Eilish via Teen Vogue <a href=\"http:\/\/www.last.fm\/music\/Billie+Eilish\/_\/Ocean+Eyes\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}