{
  "created_at": "2025-05-03T14:28:21.768623+00:00",
  "elapsed": 0.188828,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:28:21.768623+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "7742",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:28:22 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=LINKIN+PARK&format=json&method=track.getInfo&track=Breaking+the+Habit"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=LINKIN+PARK&format=json&method=track.getInfo&track=Breaking+the+Habit",
  "_decoded_content": {
    "track": {
      "name": "Breaking the Habit",
      "mbid": "1f0b2aed-6cf0-4e71-ac81-53a31820e3aa",
      "url": "https:\/\/www.last.fm\/music\/Linkin+Park\/_\/Breaking+the+Habit",
      "duration": "196000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1401876",
      "playcount": "13890832",
      "artist": {
        "name": "Linkin Park",
        "mbid": "f59c5520-5f46-4d2c-b2c4-822eabf53419",
        "url": "https:\/\/www.last.fm\/music\/Linkin+Park"
      },
      "album": {
        "artist": "Linkin Park",
        "title": "Meteora",
        "mbid": "f3bfd870-0708-46d0-9953-9f5f573fb600",
        "url": "https:\/\/www.last.fm\/music\/Linkin+Park\/Meteora",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/fee069a98672ac3719f6c766ff6f0f9c.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/fee069a98672ac3719f6c766ff6f0f9c.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/fee069a98672ac3719f6c766ff6f0f9c.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/fee069a98672ac3719f6c766ff6f0f9c.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "9"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "rock",
            "url": "https:\/\/www.last.fm\/tag\/rock"
          },
          {
            "name": "Nu Metal",
            "url": "https:\/\/www.last.fm\/tag\/Nu+Metal"
          },
          {
            "name": "alternative rock",
            "url": "https:\/\/www.last.fm\/tag\/alternative+rock"
          },
          {
            "name": "Linkin Park",
            "url": "https:\/\/www.last.fm\/tag\/Linkin+Park"
          },
          {
            "name": "alternative",
            "url": "https:\/\/www.last.fm\/tag\/alternative"
          }
        ]
      },
      "wiki": {
        "published": "30 Mar 2009, 13:43",
        "summary": "\"Breaking the Habit\" is a song by American rock band Linkin Park. It is the ninth track from their second studio album, Meteora, and was released as the fifth and final single from the album. The song was a hit; it became the fifth consecutive single from Meteora to reach number one on the Billboard Modern Rock Tracks chart, a feat unmatched by any other artist in the history of that chart. It was also the third single from the album to reach number one on the Mainstream Rock Tracks chart. <a href=\"http:\/\/www.last.fm\/music\/Linkin+Park\/_\/Breaking+the+Habit\">Read more on Last.fm<\/a>.",
        "content": "\"Breaking the Habit\" is a song by American rock band Linkin Park. It is the ninth track from their second studio album, Meteora, and was released as the fifth and final single from the album. The song was a hit; it became the fifth consecutive single from Meteora to reach number one on the Billboard Modern Rock Tracks chart, a feat unmatched by any other artist in the history of that chart. It was also the third single from the album to reach number one on the Mainstream Rock Tracks chart. The song also peaked at number 20 on the Billboard Hot 100, and was certified Gold by the RIAA. On September 4, 2012, \"Breaking the Habit\", \"Shadow of the Day\", \"New Divide\", and \"Burn It Down\" were released in the \"Linkin Park Pack 02\" as downloadable content for the music rhythm video game, Rock Band 3.\n\nBackground\n\"Breaking the Habit\" features a strong electronica-influenced opening, live strings and guitar. It is an exception from their previous nu metal\/rap rock performances as no distorted guitar riffs are included nor are there any rapping vocals from Mike Shinoda, a style they would further explore on their later albums.\n\nA common misconception about the song is that it was written by lead singer Chester Bennington due to his struggles with substance abuse. Band member Mike Shinoda began writing the song before he met Bennington based on another close friend's drug addiction.\n\nIn the album notes, it was said that the song was originally going to be an instrumental track lasting a little over three and a half minutes, but Shinoda was convinced by the band to change it. The instrumental was later released on the Underground 9.0 Fan Club as a demo track titled \"Drawing\".\n\nShinoda had a lyrical idea of an emotion he had been trying to express for 5 to 6 years before the production of Meteora. To him, the lyrics had sounded wrong until listening to the \"Drawing\" demo one night and they fell together. He showed the lyrics he wrote to Bennington who read them and teared up, relating to the words to a point where he had difficulty performing the song live for almost a year after the release of Meteora.\n\nAn original 2002 demo of this song with different lyrics and Shinoda on lead vocals appears on LP Underground XIV.\n\nMusic video\nThe music video for \"Breaking the Habit\" was animated by Studio Gonzo; it was directed by Joe Hahn and co-produced by Eric Calderon. It uses an anime stylization which was supervised by Kazuto Nakazawa, who had previously directed the animated segment of Quentin Tarantino's Kill Bill: Volume 1 among other things. The video was shot of the band performing the song and was later rotoscoped. The video has gone on to be a favorite amongst MTV viewers, going as far as winning the 2004 MTV VMA Viewer's Choice Award.\n\nAs the video begins, a deceased man is shown lying on a car's roof. The surrounding area has been taped off and is littered with investigating police officers as well as onlookers. The video cuts to another character, a girl who breaks a mirror, then writes \"I'm nothing\" onto a sheet of paper. She picks up a shard of glass, clenches it in her hand, and smears her blood on the note. Throughout the different scenes, a wisp of smoke meanders around the characters as their stories play out, and the human face of Chester Bennington singing the song flashes various times. Another character is a young woman throwing tomatoes at a man. At a point, the ubiquitous smoke drifts over the deceased man's body and enters his mouth, and the video begins to seemingly rewind itself, the woman throwing tomatoes at the man who is her husband or boyfriend, is shown coming home to see the man with another woman in bed suggesting they just had sex. The body of the deceased man begins to rise, falling in reverse, towards the roof of a tall building. It is revealed that the body is that of Chester, who had apparently fallen to his death. Upon landing on the roof, he joins with the rest of the band in performing the remainder of the song.\n\nAs of October 2020, the song has 240 million views on YouTube.\n\nThere is also a second music video, titled \"Breaking the Habit (5.28.04 3:37 PM)\", showing the band in their studio performing the song. The video was directed by Kimo Proudfoot and is available on the Breaking the Habit DVD.\n\niTunes\nThe video for \"Breaking the Habit\" is available on iTunes, along with a live video version of the video. The live video was taken from the Road to Revolution: Live at Milton Keynes DVD concert.\n\nReception\n“Breaking the Habit” has been ranked among the best Linkin Park songs by Billboard (6th), Stereogum (2nd), and The Independent.\n\nLive performances\n\"Breaking the Habit\" was not initially performed in the tour for Meteora, until it received a full performance on November 15, 2003 in San Bernardino. Since then, it has found itself in the majority of their concerts. From its debut up until the end of the tour cycle for the band's 3rd album, Minutes to Midnight, \"Breaking the Habit\" was played with a piano intro, where the first verse and chorus were played, and after that, the actual song would start. \"Breaking the Habit\" is also sometimes played live with an extended outro consisting of an a cappella performance of the chorus. After Linkin Park's 'Concert for the Philippines' on January 11, 2014, \"Breaking the Habit\" was dropped from the band's setlist. It would not be played live again until May 17, 2015, at Rock on the Range in Columbus, Ohio. <a href=\"http:\/\/www.last.fm\/music\/Linkin+Park\/_\/Breaking+the+Habit\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}