{
  "created_at": "2025-05-03T14:32:27.740838+00:00",
  "elapsed": 0.191431,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:32:27.740838+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "14307",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:32:28 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Billie+Eilish&format=json&method=track.getInfo&track=everything+i+wanted"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Billie+Eilish&format=json&method=track.getInfo&track=everything+i+wanted",
  "_decoded_content": {
    "track": {
      "name": "Everything I Wanted",
      "url": "https:\/\/www.last.fm\/music\/Billie+Eilish\/_\/Everything+I+Wanted",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1195109",
      "playcount": "17330392",
      "artist": {
        "name": "Billie Eilish",
        "url": "https:\/\/www.last.fm\/music\/Billie+Eilish"
      },
      "toptags": {
        "tag": [
          {
            "name": "indie pop",
            "url": "https:\/\/www.last.fm\/tag\/indie+pop"
          },
          {
            "name": "indie",
            "url": "https:\/\/www.last.fm\/tag\/indie"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "alternative",
            "url": "https:\/\/www.last.fm\/tag\/alternative"
          },
          {
            "name": "sad",
            "url": "https:\/\/www.last.fm\/tag\/sad"
          }
        ]
      },
      "wiki": {
        "published": "01 Feb 2020, 18:16",
        "summary": "\"everything i wanted\" is a song by American singer and songwriter Billie Eilish, and co-written by Eilish and her brother Finneas O'Connell, who also produced it. Darkroom and Interscope Records released the track as a single on November 13, 2019. It is a house and electronica-influenced pop and alternative pop track with minimal piano and downtempo bass guitar instrumentation. Inspired by a nightmare she experienced, the song is about Eilish's strong relationship with O'Connell and his protectiveness of her from harm. <a href=\"http:\/\/www.last.fm\/music\/Billie+Eilish\/_\/Everything+I+Wanted\">Read more on Last.fm<\/a>.",
        "content": "\"everything i wanted\" is a song by American singer and songwriter Billie Eilish, and co-written by Eilish and her brother Finneas O'Connell, who also produced it. Darkroom and Interscope Records released the track as a single on November 13, 2019. It is a house and electronica-influenced pop and alternative pop track with minimal piano and downtempo bass guitar instrumentation. Inspired by a nightmare she experienced, the song is about Eilish's strong relationship with O'Connell and his protectiveness of her from harm.\n\n\"everything i wanted\" received mainly positive reviews from critics, several of whom praised the music and lyrics. The song was commercially successful, reaching number eight on the US Billboard Hot 100, becoming Eilish's second top-ten hit in the United States. It debuted at number one in the record charts of several countries, including Ireland and Norway, and peaked at number three on the UK Singles Chart. \"everything i wanted\" has received several certifications, including triple platinum in Australia, and double plantinum in Canada and the United States. On November 24, 2020, the song received nominations for Record of the Year, Song of the Year, and Best Pop Solo Performance at the 63rd Annual Grammy Awards, making it Eilish's second consecutive year for earning a nomination in such categories.\n\nEilish directed the song's accompanying music video, which was uploaded to her YouTube channel on January 23, 2020. The video depicts Eilish and Finneas holding hands while driving through the city in a Dodge Challenger and into the ocean; it received positive reviews from critics, many of whom praised its visual theme and message. Eilish has performed \"Everything I Wanted\" live several times; it was included on the setlist of her When We All Fall Asleep Tour and Where Do We Go? World Tour. Eilish and Finneas performed the track during a 50-minute livestream for Verizon Communications in April 2020.\n\nBackground and release\n\nIn October 2019, Finneas O'Connell said he and his sister Billie Eilish were working on new music. In November of that year, Eilish announced the release of two new songs and a music video for the song \"xanny\", which was released the following month. Eilish later announced the song's title \"everything i wanted\" and its release date during a livestream on Instagram on November 10, 2019. \"Everything I Wanted\" was used in an advertisement for Beats by Dre headphones that features Eilish. The track was originally titled \"Nightmare\".\n\nEilish and O'Connell—who is best known by his stage name Finneas—started to write \"Everything I Wanted\" in September 2018; it began as a feeling of Eilish's depression. Eilish got the inspiration for the song in 2018 when she had a dream in which she died after jumping off the Golden Gate Bridge and nobody caring. Eilish couldn't stop thinking about her nightmares, which made her feel \"caught up\" and \"distracted\" as she and O'Connell were trying to work her fears into a new track. When she told O'Connell about the idea, he became very uncomfortable about the topic. In an interview with The New York Times, Eilish said she \"was in a really bad place mentally\" while O'Connell said he did not want to help her write a hopeless song about suicide because he and their parents were concerned about her well-being. He told Eilish she \"can't always solve [her] problems in a song\". Eilish persuaded O'Connell and their parents by telling them writing \"Everything I Wanted\" was \"the way I can feel those things without doing something to myself\". Eilish and O'Connell changed the song's subject to one of mutual support and togetherness rather than depression and suicide. The duo discussed how their relationship and understanding of what music is have made them write music together. The song also references Eilish's feelings about fame, which she sometimes finds frustrating.\n\n\"Everything I Wanted\" was mastered by John Greenham and mixed by Rob Kinelski, both of whom also served as studio personnel. The song was released for digital download and streaming as a single on November 13, 2019, via Darkroom and Interscope Records. It was added to the reissue of Eilish's debut studio album When We All Fall Asleep, Where Do We Go? in December 2019. A flexi disc of the song was released via pre-order to ship in the following four-to-six weeks. The release came with a digital single that was delivered to US customers via email. The single's cover art, an abstract painting of the Golden Gate Bridge in San Francisco, California, was made by Jason Anderson.\n\nComposition and lyrics\n\n\"everything i wanted\" has a moderately fast tempo of 120 beats per minute (BPM) and is played in the key of A major while Eilish's vocal range spans from the low note of E3 to the high note of B4. According to Jem Aswad from Variety, the song features a significant use of reverberation, a \"gentle beatbox, and soft, hazy keyboard riffs\". The track has been described as a house and electronica-influenced pop and alternative pop track in press reviews; it features minimalist production consisting of piano and downtempo bass guitar instrumentation. According to Lake Schatz of Consequence of Sound, the song has a \"spare beat and quiet keys\".\n\nAccording to Eilish, the song discusses her relationship with O'Connell and his ongoing support for her. The song's first verse was inspired by Eilish's experiences with depression and mental illness. The track begins with the singer talking about her committing suicide and nobody caring; \"Thought I could fly \/ So I stepped off the Golden \/ Nobody cried \/ Nobody even noticed \/ I saw them standing right there \/ Kinda thought they might care\". In the chorus, Eilish and O'Connell talk about their mutual support for each other and the way O'Connell helps Eilish deal with fame and her personal demons. \"And you say, 'As long as I'm here, no one can hurt you' \/ Don't wanna lie here, but you can learn to \/ If I could change the way that you see yourself \/ You wouldn't wonder why you hear, 'they don't deserve you'\". Pitchfork's Dani Blum stated the song \"has layered vocals that swell and surround Eilish in the bridge\" as she repeatedly asks; \"If I knew it all then, would I do it again? \/ If they knew what they said would go straight to my head \/ What would they say instead?\".\n\nCritical response\n\n\"everything i wanted\" received mainly positive reviews from music critics. The song was praised by Insider's Callie Ahlgrim, who called it a \"thoughtful dynamic\" and the lyrics a \"breathtaking portrait of their in-sync collaborative skills\". Jon Caramanica from The New York Times said the keyboards on the recording are \"urgent\" and \"elegiac\", and described the chorus as \"draining yet hopeful\". Rolling Stone’s Brenna Ehrlich stated the song showed a \"softer, sadder version of Eilish\" and described the track as \"a meditation on fame\". Writing for Clash, Robin Murray said the song \"is definitely hewn from Billie's tender side\". The staff of DIY labeled the track a \"cool, quietly upbeat production\". Billboard's Heran Mamo called the track a \"touching tribute\". Idolator's Mike Wass said the song was \"eerie, yet comforting\". Starr Bowenbank writing for Cosmopolitan magazine regarded it as a song that would \"leave you sobbing in a puddle of your own tears\". ABC News Radio's Randy Holmes described \"Everything I Wanted\" as an \"emotional\" and \"chilling\" track. Julia Emmanuele of Bustle magazine viewed the song \"makes it clear that Eilish's experiences with managing her mental health is constantly evolving, but it seems that the singer is determined to surround herself with people like Finneas, who help support her through it all.\"\n\nJasmine Gomez, writing for Seventeen, called \"Everything I Wanted\" a \"haunting, yet beautiful tribute\" from Eilish to Finneas. Rhian Daly of NME wrote the track's \"message is cohesive and clear. The duo have got each other's backs, be that protecting each other from the outside world and helping change their perceptions of themselves.\" Brent Furdyk, writing for Entertainment Tonight Canada, labeled the song \"a touching tribute to [Eilish's and O'Connell's] kindship” In a mixed review for Los Angeles Times, August Brown called the song a \"misty, echoing loop that keeps her downcast voice front and center in the mix\". The staff of Electronic Beats compared the track to Eilish's number-one hit \"Bad Guy\" while Jem Aswad of Variety said it is \"neither a menacing banger like [\"Bad Guy\"] or a ballad like \"I Love You\". Sam Prance of PopBuzz labeled the song's lyrics as \"heartbreakingly personal\". Allie Gemmill of Teen Vogue described \"Everything I Wanted\" as \"moody\", \"slow\", and \"introspective\", saying it is another \"classic Billie jam\". In a review for Stereogum, Chris Deville said the track puts a \"crystalline, watery spin on her signature sound\".\n\nSpeaking to Apple Music's Zane Lowe, Selena Gomez said she related to Eilish's view of fame and said; \"when I heard [\"Everything I wanted\"], I just sobbed because I've been doing this for so long and it's like, 'Damn, that's so true.' \" Bono of U2 included the song in his list of \"60 Songs That Saved My Life\", saying in a \"fan letter\", \"I step inside your song and it's a black beauty, achingly awesomely vulnerable and terrifying\". Eilish's mother Maggie Baird also cried when she heard the song.\n\nCommercial performance\n\nFollowing the release of \"Everything I Wanted\", it debuted at number 74 on the US Billboard Hot 100 on November 23, 2019. On November 30, it rose to number 8 on the chart, becoming Eilish's second top-ten hit in the US. The single also achieved success on Billboard component charts; it rose from number two to number one on the Billboard Alternative Songs radio airplay chart in February 2020, becoming her third number one on the chart, tying Eilish with Beck and Alanis Morissette for the most number ones by a solo artist on the Alternative Songs chart. \"Everything I Wanted\" also reached the top five on the Adult Top 40, Dance\/Mix Show Airplay, Mainstream Top 40 and Hot Rock & Alternative Songs charts. It has received a triple platinum certification by the Recording Industry Association of America (RIAA), denoting track-equivalent sales of three million units based on sales and streams.\n\nThe single peaked at number 6 on the Canadian Hot 100 and has received a double-platinum certification by Music Canada (MC). \"Everything I Wanted\" achieved major success in Europe; it reached number 3 on the UK Singles Chart, becoming Eilish's third top-ten hit in the United Kingdom. It has received a platinum certification from the British Phonographic Industry (BPI), which denotes track-equivalent sales of 600,000 units. The track peaked at number 2 on the Australian singles chart and has also received a triple-platinum certification by the Australian Recording Industry Association (ARIA). \"Everything I Wanted\" peaked at number one in Estonia, Ireland, Latvia, Lithuania, and Norway. It has also peaked within the top 10 of singles charts in Austria, Belgium, and Germany.\n\nLive performances and other usages\n\nEilish performed \"Everything I Wanted\" live for the first time in December 2019 in Mexico City on the final stop of her When We All Fall Asleep Tour, and during an Apple Live acoustic show at the Steve Jobs Theater in Cupertino the same year. \"Everything I Wanted\" was included on her setlist for the Where Do We Go? World Tour (2020). Eilish performed the song live with O'Connell playing acoustic guitar for Blux in February 2020. In April of that year, the pair performed an acoustic version of \"Everything I Wanted\" during a 50-minute livestream for Verizon Communications. On February 7, 2020, Alicia Keys covered \"Everything I Wanted\" for BBC Radio 1's Live Lounge segment. On March 9, 2020, JP Cooper and his band covered the song for Billboard; they slowly built \"a lush unfurling arrangement comprised of dual guitars, piano and organ\", and that Cooper was crooning \"as he gently strums an electric guitar\". Cooper told Billboard he does not perform many covers but he felt drawn to the song, and that he and his band had a great time recording it. On March 13, 2020, Georgia recorded a cover of \"Everything I Wanted\" at Abbey Road Studios in London. Sam Moore of NME wrote that the cover had mixed together \"elements of electro-pop and orchestral music\". On March 13, 2020, English indie rock band Gengahr performed a cover of the song for Triple J's Like a Version segment. The band additionally performed their track \"Heavenly Maybe\". Gengahr's rendition of \"Everything I Wanted\" was later released as a single. <a href=\"http:\/\/www.last.fm\/music\/Billie+Eilish\/_\/Everything+I+Wanted\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}