{
  "created_at": "2025-05-03T14:44:48.897586+00:00",
  "elapsed": 0.214132,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:44:48.897586+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5796",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:44:49 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Linkin+Park&format=json&method=track.getInfo&track=BURN+IT+DOWN"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Linkin+Park&format=json&method=track.getInfo&track=BURN+IT+DOWN",
  "_decoded_content": {
    "track": {
      "name": "Burn It Down",
      "mbid": "5e54d4be-a83b-41d1-9372-06fa58b4c36d",
      "url": "https:\/\/www.last.fm\/music\/Linkin+Park\/_\/Burn+It+Down",
      "duration": "230000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "803313",
      "playcount": "7869273",
      "artist": {
        "name": "Linkin Park",
        "mbid": "f59c5520-5f46-4d2c-b2c4-822eabf53419",
        "url": "https:\/\/www.last.fm\/music\/Linkin+Park"
      },
      "album": {
        "artist": "Linkin Park",
        "title": "Living Things",
        "mbid": "bb58b36a-81ce-4b61-a757-fc937b9f95f4",
        "url": "https:\/\/www.last.fm\/music\/Linkin+Park\/Living+Things",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/5dda2ee492c00966c166665454e10c2d.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/5dda2ee492c00966c166665454e10c2d.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/5dda2ee492c00966c166665454e10c2d.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/5dda2ee492c00966c166665454e10c2d.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "3"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "rock",
            "url": "https:\/\/www.last.fm\/tag\/rock"
          },
          {
            "name": "alternative rock",
            "url": "https:\/\/www.last.fm\/tag\/alternative+rock"
          },
          {
            "name": "alternative",
            "url": "https:\/\/www.last.fm\/tag\/alternative"
          },
          {
            "name": "electronic rock",
            "url": "https:\/\/www.last.fm\/tag\/electronic+rock"
          },
          {
            "name": "Linkin Park",
            "url": "https:\/\/www.last.fm\/tag\/Linkin+Park"
          }
        ]
      },
      "wiki": {
        "published": "17 May 2012, 20:49",
        "summary": "\"Burn It Down\" (stylized in all caps) is a song by American rock band Linkin Park. The song was released to radio stations, as well as a digital download, on April 16th, 2012, as the lead single and the third track from their fifth studio album, Living Things. The song was written by the band and produced by co-lead vocalist Mike Shinoda and Rick Rubin, who co-produced the band's studio albums Minutes to Midnight (2007) and A Thousand Suns (2010). <a href=\"http:\/\/www.last.fm\/music\/Linkin+Park\/_\/Burn+It+Down\">Read more on Last.fm<\/a>.",
        "content": "\"Burn It Down\" (stylized in all caps) is a song by American rock band Linkin Park. The song was released to radio stations, as well as a digital download, on April 16th, 2012, as the lead single and the third track from their fifth studio album, Living Things. The song was written by the band and produced by co-lead vocalist Mike Shinoda and Rick Rubin, who co-produced the band's studio albums Minutes to Midnight (2007) and A Thousand Suns (2010). A music video for the song was directed by Linkin Park turntablist Joe Hahn. As of June 24, 2022, \"Burn It Down\" has sold over three million copies in the United States alone.\n\nThe song's working title was \"Buried at Sea\" and was recorded in February 2012, as revealed by numerous LPTVs (behind-the-scenes footage) released in April and May 2012. Lead singer Chester Bennington talked about the song in an interview with MTV, saying what made the song interesting was \"the really high energy and the really strong electronic melodies and hooks kind of set this song apart, which is why we chose it as our first single.\" Mike Shinoda, the band's rapper and producer, noted that the song's meaning can be open to numerous interpretations, with an example being \"what we do in pop culture, where we build somebody up to be the next great thing and then we just like to destroy them at the end of the day, and we've lived through that, so I think there's a lot of personal energy that went into the connection of that story.\" In an interview with The Huffington Post, Shinoda clarified that his explanation of \"Burn It Down\" was based on the band's personal experiences, saying: '...We're talking about my personal story and his personal story, and there's also a layer of pop culture that plays a role in the lyrics of the song. For example, people build up a certain celebrity or musician or actor or whatever and they're popular one minute and the next thing, you know either they've done something wrong or they've done nothing wrong and there's just a bad rumor that goes around about them and then everybody's attacking that person. That's just the way things are. We've actually lived through that as a band. All that stuff plays a role.'\n\nThe music video was directed by Joe Hahn, the band's turntablist. Filming for the video commenced on March 28, 2012. Warner Bros. Records announced that a lyric video would also premiere on April 15. It was released through YouTube. Bennington described the music video's set as an \"electronic pod, full of wires and cables,\" as well as stating that the video features numerous visual effects. Bennington also noted the video's similarity to their live performances, saying \"we're really trying to capture a live kind of element with the band just playing just very similar to how we would perform live.\" Bennington noted that Hahn pushed the group in making the video – \"And, for whatever reason, I usually get it the worst. I've almost drowned, I had all this powder thrown in my face. ... On this new one, I was sweating like crazy. It was intense.\" \"Burn It Down\" was used in the promotional teaser for the 2012 NBA Playoffs on TNT, featuring previews of the music video. The music video premiered on May 24, 2012, on MTV. The music video was nominated for the 2012 MTV Video Music Awards in two categories for the Best Rock Video and Best Visual Effects. The video peaked at Vh1 India's top 50 videos of 2012 at #5. \"Burn It Down\"'s video was also ranked 11th of the Top 40 Music Videos Of 2012 by Fuse. As of February 2023, the music video for \"Burn It Down\" has over 354 million views on YouTube. <a href=\"http:\/\/www.last.fm\/music\/Linkin+Park\/_\/Burn+It+Down\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}