{
  "created_at": "2025-05-03T14:44:40.379126+00:00",
  "elapsed": 0.284115,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:44:40.379126+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4629",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:44:40 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Anitta&format=json&method=track.getInfo&track=Vai+malandra"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Anitta&format=json&method=track.getInfo&track=Vai+malandra",
  "_decoded_content": {
    "track": {
      "name": "Vai Malandra",
      "url": "https:\/\/www.last.fm\/music\/Anitta\/_\/Vai+Malandra",
      "duration": "206000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1639",
      "playcount": "28171",
      "artist": {
        "name": "Anitta",
        "mbid": "d606b860-cc03-4959-a3fd-3a24bccf2560",
        "url": "https:\/\/www.last.fm\/music\/Anitta"
      },
      "album": {
        "artist": "Anitta",
        "title": "Checkmate",
        "url": "https:\/\/www.last.fm\/music\/Anitta\/Checkmate",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/47f1a26761d6d12af330195b71ff0930.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/47f1a26761d6d12af330195b71ff0930.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/47f1a26761d6d12af330195b71ff0930.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/47f1a26761d6d12af330195b71ff0930.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": []
      },
      "wiki": {
        "published": "19 Dec 2017, 06:29",
        "summary": "\"Vai Malandra\" é uma canção dos cantores brasileiros Anitta e MC Zaac juntamente com o rapper estadunidense Maejor, trazendo ainda a participação especial dos produtores brasileiros Tropkillaz e DJ Yuri Martins. A faixa foi lançada em 18 de dezembro de 2017 como quarto e último single do projeto CheckMate – no qual Anitta lançou um novo single por mês.\nEm 17 de dezembro, Anitta apresentou-se no Festival de Verão Salvador, onde cantou todas <a href=\"http:\/\/www.last.fm\/music\/Anitta\/_\/Vai+Malandra\">Read more on Last.fm<\/a>.",
        "content": "\"Vai Malandra\" é uma canção dos cantores brasileiros Anitta e MC Zaac juntamente com o rapper estadunidense Maejor, trazendo ainda a participação especial dos produtores brasileiros Tropkillaz e DJ Yuri Martins. A faixa foi lançada em 18 de dezembro de 2017 como quarto e último single do projeto CheckMate – no qual Anitta lançou um novo single por mês.\nEm 17 de dezembro, Anitta apresentou-se no Festival de Verão Salvador, onde cantou todas as músicas do CheckMate e falou que o lançamento de \"Vai Malandra\" ocorreria no dia seguinte. No dia do lançamento da canção e do videoclipe, a cantora realizou uma transmissão ao vivo em seu canal no YouTube, a qual teve mais de 100 mil visualizações, com apresentação de Didi Wagner entrevistando os envolvidos no projeto, cenas dos bastidores e contando como havia sido a gravação.\nO videoclipe foi gravado em 20 de agosto de 2017, dia da Meia Maratona do Rio, o que fez com que a produção tivesse que adiantar a entrada de toda a equipe no Morro do Vidigal, favela pacificada do Rio de Janeiro, para às 5 horas da manhã por conta dos bloqueios das ruas. A direção ficou por conta do estadunidense Terry Richardson. O set de filmagem era composto por cerca de 120 pessoas entre câmeras, produtores e figurantes, sendo que 60 figurantes selecionados eram moradores da comunidade. Ao todo foram quase 30 horas de gravação incluindo as montagens de composição dos cenários, como a piscina que foi construída em cima de um caminhão (que foi completada de água com a ajuda de um caminhão-pipa) e a instalação de sistema soundsystem com caixas de som de mais de 100kg. A produção também teve que lidar com a chuva durante a noite, que aparecem nas cenas noturnas. \"Não estava programada, mas tornou o clipe ainda mais real\", comentou Felipe Tadeu, especialista em produção executiva e sócio da Mangaba Produções.\nOriginalmente planejado para ser lançado em setembro, o vídeo acabou sendo adiado após a imprensa internacional divulgar diversas acusações de assédio sexual do diretor em seus trabalhos anteriores, fazendo com que Anitta refletisse que não era o momento para liberar um trabalho que fosse associa-la ao profissional. Apenas no final de novembro a cantora se pronunciou, anunciando que liberaria o videoclipe em respeito aos profissionais envolvidos e ao potencial de sucesso da canção, porém que repudiava qualquer tipo de assédio ou machismo envolvendo o diretor ou qualquer outro caso. Em 14 de dezembro é liberada uma prévia do vídeo.\nO vídeo foi lançado no dia 18 de dezembro às 12 horas (horário de Brasília) em todas as plataformas digitais e o videoclipe estreou simultaneamente no canal do Youtube da cantora. Desde o início do mesmo dia, a hashtag #VaiMalandra ocupou a primeira posição nos \"Trending Topics\" mundiais. Em 20 minutos após o lançamento, o clipe ultrapassou a marca de 500 mil visualizações. <a href=\"http:\/\/www.last.fm\/music\/Anitta\/_\/Vai+Malandra\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}