{
  "created_at": "2025-05-03T14:32:34.850095+00:00",
  "elapsed": 0.187919,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:32:34.850095+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5478",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:32:35 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=The+Weeknd&format=json&method=track.getInfo&track=Heartless"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=The+Weeknd&format=json&method=track.getInfo&track=Heartless",
  "_decoded_content": {
    "track": {
      "name": "Heartless",
      "url": "https:\/\/www.last.fm\/music\/The+Weeknd\/_\/Heartless",
      "duration": "198000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1070478",
      "playcount": "16565753",
      "artist": {
        "name": "The Weeknd",
        "mbid": "c8b03190-306c-4120-bb0b-6f2ebfc06ea9",
        "url": "https:\/\/www.last.fm\/music\/The+Weeknd"
      },
      "album": {
        "artist": "The Weeknd",
        "title": "The Highlights",
        "url": "https:\/\/www.last.fm\/music\/The+Weeknd\/The+Highlights",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/13eba218340495aa6ed6985c0c9a39dc.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/13eba218340495aa6ed6985c0c9a39dc.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/13eba218340495aa6ed6985c0c9a39dc.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/13eba218340495aa6ed6985c0c9a39dc.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "trap",
            "url": "https:\/\/www.last.fm\/tag\/trap"
          },
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "The Weeknd",
            "url": "https:\/\/www.last.fm\/tag\/The+Weeknd"
          },
          {
            "name": "MySpotigramBot",
            "url": "https:\/\/www.last.fm\/tag\/MySpotigramBot"
          },
          {
            "name": "rnb",
            "url": "https:\/\/www.last.fm\/tag\/rnb"
          }
        ]
      },
      "wiki": {
        "published": "27 Nov 2019, 14:52",
        "summary": "\"Heartless\" is a song recorded by Canadian singer The Weeknd. It was released on November 27, 2019, through XO and Republic Records, as the lead single from his fourth studio album After Hours. The Weeknd wrote and produced the song alongside Metro Boomin, Illangelo, and Dre Moon. The song combines R&B and trap with elements of electroclash.\n\n\"Heartless\" received acclaim from critics, praising it for its production, catchiness and the Weeknd's vocals. <a href=\"http:\/\/www.last.fm\/music\/The+Weeknd\/_\/Heartless\">Read more on Last.fm<\/a>.",
        "content": "\"Heartless\" is a song recorded by Canadian singer The Weeknd. It was released on November 27, 2019, through XO and Republic Records, as the lead single from his fourth studio album After Hours. The Weeknd wrote and produced the song alongside Metro Boomin, Illangelo, and Dre Moon. The song combines R&B and trap with elements of electroclash.\n\n\"Heartless\" received acclaim from critics, praising it for its production, catchiness and the Weeknd's vocals. It peaked at number three on the Canadian Hot 100. Elsewhere, the song topped the US Billboard Hot 100, giving the Weeknd his fourth number-one song on the chart, and also has figured within the record charts in other 28 countries and was the last new number one single of the 2010s. A vaporwave remix of the song featuring American rapper Lil Uzi Vert was released alongside the deluxe edition of its parent album on March 23, 2020. On April 3, 2020, an extended and normal-pitched version of the Lil Uzi Vert remix was released alongside the parent album's accompanying remix EP.\n\nThe Weeknd first teased that he was working on a new album in November 2018, via a performance in which he told the crowd that \"Chapter VI was coming soon.\" Following a trio of collaborative singles throughout 2019, on August 6, he further reassured fans that he was working on his fourth studio album. Then after a period of silence, on November 24 the single \"Blinding Lights\" was revealed through a Mercedes-Benz television commercial, with reports of \"Heartless\" surfacing a day later, along with its leaked cover art. It then premiered on the seventh episode of The Weeknd's Beats 1 radio show Memento Mori on November 27, 2019. In an interview with CR Men, The Weeknd confirmed that \"Heartless\" was the first song that he wrote for After Hours after the release of his 2018 EP My Dear Melancholy.\n\n\"Heartless\" entered the Billboard Hot 100 at number 32 on the issue dated December 7, 2019, becoming the highest-debuting single of the week. The following week, it jumped 31 positions to the number one position on the chart, becoming The Weeknd's fourth number-one single in the United States. However, on the issue dated December 21, 2019, \"Heartless\" fell sixteen places out of the top ten to number 17 partly due to Christmas songs overtaking the upper half of the chart, becoming the biggest drop from the number-one spot in the chart's 61-year history. The song later returned to the top ten (at number four) after the release of After Hours on the issue dated April 4, 2020, its first week in the top ten since December 2019. On April 5, 2022, \"Heartless\" was awarded a 3x Platinum certification from the Recording Industry Association of America (RIAA) for selling two million units in the United States. It was the final new number one single of 2010s in the United States.\n\nOn the Rolling Stone Top 100 Songs chart, the song debuted at number fourteen, lodging 11.1 million streams after two days of tracking. In its second week, The song ascended at number one, becoming The Weeknd's first number-one song on the chart.\n\nIn the singer's native Canada, \"Heartless\" reached number three on the Canadian Hot 100. In the United Kingdom, the song reached number ten, becoming The Weeknd's seventh top-10 hit in the country.\n\nIn 2024 , \"Heartless\" reached 1 billion streams , joining the billions club and being one of the 11 songs from the Weeknd that managed to hit and surpass 1 billion streams. <a href=\"http:\/\/www.last.fm\/music\/The+Weeknd\/_\/Heartless\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}