{
  "created_at": "2025-05-03T14:30:00.696772+00:00",
  "elapsed": 0.211368,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:30:00.696772+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5365",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:30:01 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Drake&format=json&method=track.getInfo&track=Nonstop"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Drake&format=json&method=track.getInfo&track=Nonstop",
  "_decoded_content": {
    "track": {
      "name": "Nonstop",
      "url": "https:\/\/www.last.fm\/music\/Drake\/_\/Nonstop",
      "duration": "239000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "687326",
      "playcount": "6953054",
      "artist": {
        "name": "Drake",
        "mbid": "b49b81cc-d5b7-4bdd-aadb-385df8de69a6",
        "url": "https:\/\/www.last.fm\/music\/Drake"
      },
      "album": {
        "artist": "Drake",
        "title": "Non-stop",
        "url": "https:\/\/www.last.fm\/music\/Drake\/Non-stop",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/6f28769a22c494f194c38cc3c821109c.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/6f28769a22c494f194c38cc3c821109c.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/6f28769a22c494f194c38cc3c821109c.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/6f28769a22c494f194c38cc3c821109c.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "MySpotigramBot",
            "url": "https:\/\/www.last.fm\/tag\/MySpotigramBot"
          },
          {
            "name": "rap",
            "url": "https:\/\/www.last.fm\/tag\/rap"
          },
          {
            "name": "trap",
            "url": "https:\/\/www.last.fm\/tag\/trap"
          },
          {
            "name": "Drake",
            "url": "https:\/\/www.last.fm\/tag\/Drake"
          },
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          }
        ]
      },
      "wiki": {
        "published": "21 Jan 2022, 15:05",
        "summary": "On “Nonstop,” Drake flexes his abilities as a rapper and the business moves being made behind the scenes of his music. The song audibly has a distinct Memphis influence, as displayed by Drake’s flow throughout the song.\n\nThe Memphis influence is also notable in rising Memphis producer Tay Keith’s instrumental. Keith sampled the hook from the 1995 track “My Head Is Spinnin'” by Memphis artists Mack Daddy Ju and D.J. Squeeky.\n\n“Nonstop” is Drake’s second collaboration with Tay Keith. <a href=\"http:\/\/www.last.fm\/music\/Drake\/_\/Nonstop\">Read more on Last.fm<\/a>.",
        "content": "On “Nonstop,” Drake flexes his abilities as a rapper and the business moves being made behind the scenes of his music. The song audibly has a distinct Memphis influence, as displayed by Drake’s flow throughout the song.\n\nThe Memphis influence is also notable in rising Memphis producer Tay Keith’s instrumental. Keith sampled the hook from the 1995 track “My Head Is Spinnin'” by Memphis artists Mack Daddy Ju and D.J. Squeeky.\n\n“Nonstop” is Drake’s second collaboration with Tay Keith. He had previously collaborated with BlocBoy JB on Tay Keith-produced “Look Alive” in early 2018, a single that peaked at #5 on the Billboard Hot 100.\n\nA lyric from “Nonstop” was teased as part of the Scorpion billboards that Drake released worldwide in the weeks leading up to the album’s release.\n\nOn July 27, 2018, exactly four weeks after Scorpion’s release, Drake released the music video for “Nonstop,” featuring various locations in London, including his surprise performance at Wireless Festival 2018. Unlike other music videos from \"Scorpion\", it was released exclusively on Apple Music for a week before it was put on YouTube and other platforms.\n\nTay Keith let The Fader know about the creation of the instrumental:\n\nTay Keith: He hit me up on Instagram. He was just congratulating me and BlocBoy JB for what we was doing and just showing us respect for the whole wave we had. He told me to send him something and I sent him a pack of beats that had “Look Alive” in it. He wrapped on “Look Alive,” like 24 hours, sent it back, sent it to Bloc, he sent it back. Then we shot the video like two or three days later. Everything was done in one week — that quick.\n\nAfter “Look Alive,” I just kept sending him beat packs. I just kept cooking up that specific type of sound and sending him packs. He chose the “Nonstop beat as he was wrapping up the album. You know, he wanted that Memphis slap. You’ll go to Metro Boomin for this sound, or Pi'erre Bourne for this, or Zaytoven for his sound. It just so happened that the sound I’ve developed has the Memphis origins to it that made Drake wanted to work with it. I’ve just took the origins — with Three 6 Mafia and DJ Squeeky and them — and brought it back to life in a sense.\n\nI talk to Drake all the time. When you got a personal relationship with somebody, it’s easier to work with someone. I’m pretty sure, like the way that we work, he don’t just have people sending him beats and he picks ‘em without knowing the person. You gotta trust a person to work with 'em.'\"\n\nAccording to Songfacts, Keith also told Billboard:\n\n\"'It was one of those records, I didn’t expect it to be as big as it was. It was one of those, ‘Oh, I’m just gonna cook this up in a pack and see where it goes.’ Drake hopped on it and was f–king with it. I didn’t expect it to be at # 2 on the Billboard Hot 100. For it to be just a beat I cooked in a pack, too? It wasn’t made for anything specific. It was a random type of blessing.'\"\n\nTay Keith sampled the chorus from the 1995 track “My Head Is Spinnin'” by Memphis artists Mack Daddy Ju and D.J. Squeeky.\n\n“Nonstop” debuted at #2 on the Billboard Hot 100 on the chart week of July 14, 2018. It stayed on the chart for 22 weeks and was blocked from #1 by Drake’s own “In My Feelings.” <a href=\"http:\/\/www.last.fm\/music\/Drake\/_\/Nonstop\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}