{
  "created_at": "2025-05-03T14:36:13.944803+00:00",
  "elapsed": 0.351121,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:36:13.944803+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4428",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:36:14 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Kanye+West&format=json&method=track.getInfo&track=No+Child+Left+Behind"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Kanye+West&format=json&method=track.getInfo&track=No+Child+Left+Behind",
  "_decoded_content": {
    "track": {
      "name": "NO CHILD LEFT BEHIND",
      "url": "https:\/\/www.last.fm\/music\/Kanye+West\/_\/NO+CHILD+LEFT+BEHIND",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "434481",
      "playcount": "4592291",
      "artist": {
        "name": "Kanye West",
        "mbid": "164f0d73-1234-4e2c-8743-d77bf2191051",
        "url": "https:\/\/www.last.fm\/music\/Kanye+West"
      },
      "toptags": {
        "tag": [
          {
            "name": "ambient pop",
            "url": "https:\/\/www.last.fm\/tag\/ambient+pop"
          },
          {
            "name": "gospel",
            "url": "https:\/\/www.last.fm\/tag\/gospel"
          },
          {
            "name": "Kanye West",
            "url": "https:\/\/www.last.fm\/tag\/Kanye+West"
          },
          {
            "name": "art pop",
            "url": "https:\/\/www.last.fm\/tag\/art+pop"
          },
          {
            "name": "2021",
            "url": "https:\/\/www.last.fm\/tag\/2021"
          }
        ]
      },
      "wiki": {
        "published": "25 Feb 2022, 20:47",
        "summary": "“No Child Left Behind” is a song by American rapper Kanye West from his tenth studio album, \"Donda\". The song includes vocals from fellow American rapper Vory. It was performed by the Sunday Service Choir on Halloween 2021, with additional contributions from Justin Bieber. In July 2021, the song was used in a Beats by Dre commercial during Game 6 of the NBA Finals, which stars Sha'Carri Richardson.\n\nDuring the first \"Donda\" public listening event at Mercedes-Benz Stadium in Atlanta on July 22 <a href=\"http:\/\/www.last.fm\/music\/Kanye+West\/_\/NO+CHILD+LEFT+BEHIND\">Read more on Last.fm<\/a>.",
        "content": "“No Child Left Behind” is a song by American rapper Kanye West from his tenth studio album, \"Donda\". The song includes vocals from fellow American rapper Vory. It was performed by the Sunday Service Choir on Halloween 2021, with additional contributions from Justin Bieber. In July 2021, the song was used in a Beats by Dre commercial during Game 6 of the NBA Finals, which stars Sha'Carri Richardson.\n\nDuring the first \"Donda\" public listening event at Mercedes-Benz Stadium in Atlanta on July 22, 2021, \"No Child Left Behind\" was previewed by West, with vocals from Vory, but was previously previewed as a one-minute snippet in a Beats by Dre commercial featuring Sha'Carri Richardson, prior to the listening party. In the commercial, West suggested that the album would be released on July 23, and the ad would also air at the NBA Finals. Shortly after the commercial aired, French producer Gesaffelstein stated that he had produced the song. Speaking to XXL about working with West, Vory mentioned the faith the rapper has put in him musically, explaining that they are understanding of one another while saying their \"vibe is crazy\". Vory detailed that even West's childhood friends recognize the vibe, saying of them collaborating, \"You would think y'all have known each other for years.\" The rapper recalled that West originally set out to create an entirely different song titled \"Never Abandon Your Child\", until he told him to use a different saying of the same meaning, specifying that a quote would be preferable. Vory also stated that West advised him to gain a proper fanbase by putting careful thought into creating a discography, rather than gathering popularity via gimmicks or internet skills.\n\nOn January 8, 2002, President George W. Bush signed the No Child Left Behind Act into law. The concept behind the education bill was the creation of new standards and goals for the USA's public schools to ensure that no child is left behind. Many considered it a failure, and President Barack Obama repealed the Act in 2015.\n\nThe titular phrase has since entered the vernacular. For West it takes on two different meanings within this song:\n\n1. When West's wife Kim Kardashian filed for divorce in February 2021, their four children faced an uncertain future. The parents have agreed joint custody and West is assuring them none of them will be \"left behind.\"\n\n2. When Kanye West debuted the first of his weekly Sunday Services, critics wondered if he was dabbling in Christianity for a publicity stunt, but by the time he released his Jesus Is King album later in the year, it was clear the Chicago rapper had experienced a genuine conversion experience. During this song's chorus West sings of all the miracles God bestowed upon him. The breakdown of his marriage is a time of trial but he knows as a child of God, he can always count on his heavenly Father. <a href=\"http:\/\/www.last.fm\/music\/Kanye+West\/_\/NO+CHILD+LEFT+BEHIND\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}