{
  "created_at": "2025-05-03T14:43:15.591507+00:00",
  "elapsed": 0.208676,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:43:15.591507+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "6239",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:43:15 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Coldplay&format=json&method=track.getInfo&track=My+Universe"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Coldplay&format=json&method=track.getInfo&track=My+Universe",
  "_decoded_content": {
    "track": {
      "name": "My Universe",
      "url": "https:\/\/www.last.fm\/music\/Coldplay\/_\/My+Universe",
      "duration": "228000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "684901",
      "playcount": "53131713",
      "artist": {
        "name": "Coldplay",
        "mbid": "cc197bad-dc9c-440d-a5b5-d52ba2e14234",
        "url": "https:\/\/www.last.fm\/music\/Coldplay"
      },
      "album": {
        "artist": "Coldplay",
        "title": "Music Of The Spheres (Autographed CD)",
        "url": "https:\/\/www.last.fm\/music\/Coldplay\/Music+Of+The+Spheres+(Autographed+CD)",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/92687f4e0bb818eb961d4cf6fb533f9a.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/92687f4e0bb818eb961d4cf6fb533f9a.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/92687f4e0bb818eb961d4cf6fb533f9a.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/92687f4e0bb818eb961d4cf6fb533f9a.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "bts",
            "url": "https:\/\/www.last.fm\/tag\/bts"
          },
          {
            "name": "k-pop",
            "url": "https:\/\/www.last.fm\/tag\/k-pop"
          },
          {
            "name": "rock",
            "url": "https:\/\/www.last.fm\/tag\/rock"
          },
          {
            "name": "Kpop",
            "url": "https:\/\/www.last.fm\/tag\/Kpop"
          }
        ]
      },
      "wiki": {
        "published": "24 Sep 2021, 22:47",
        "summary": "\"My Universe\", an uplifting pop-rock song about a difficult love, works as the second single from Coldplay's ninth studio album \"Music of the Spheres\", being a duet with South Korean boy group BTS.\n\nOriginally was made only for BTS, but the artists ended up performing it together. The harmonised chorus vocals were recorded in April 2021 when Coldplay's Chris Martin visited South Korea. The song marks the first collaboration between the groups.\n\nThe rumors about a possible collaboration between Coldplay and BTS go back to February 2021 <a href=\"http:\/\/www.last.fm\/music\/Coldplay\/_\/My+Universe\">Read more on Last.fm<\/a>.",
        "content": "\"My Universe\", an uplifting pop-rock song about a difficult love, works as the second single from Coldplay's ninth studio album \"Music of the Spheres\", being a duet with South Korean boy group BTS.\n\nOriginally was made only for BTS, but the artists ended up performing it together. The harmonised chorus vocals were recorded in April 2021 when Coldplay's Chris Martin visited South Korea. The song marks the first collaboration between the groups.\n\nThe rumors about a possible collaboration between Coldplay and BTS go back to February 2021, when BTS surprisingly covered Coldplay’s \"Fix You\" during their MTV Unplugged session. The performance gained worldwide recognition, and Coldplay took to Twitter to express their admiration for it. After this performance, fans of both bands expressed an interest in the groups collaborating, but the rumors truly sparked when Chris Martin was spotted at Incheon Airport in South Korea. The rumors continued when, during the interview for the promotion of \"Higher Power\", he addressed the rumors, saying: \"I love them a lot and so if the right song came along, I wouldn’t ever say no.\"\n\nIn July 2021, part of the song was leaked online, thus confirming the collaboration. BTS' label, BigHit Music, released a press statement about Coldplay’s upcoming new song that supposedly featured BTS saying: \"It’s hard to confirm.\" Both artists continued hinting at the collaboration for months, with Chris Martin even singing a fragment of \"My Universe\" (including the Korean verse) on The Kelly Clarkson Show (as was reported by an audience member) and hosted a conversation with BTS for their \"Permission to Dance\" Challenge on YouTube Shorts.\n\nThe song was announced officially on September 13, 2021, with the press release info from both groups.\n\nA making-of documentary of the song titled \"Inside My Universe\" was released on 26 September 2021. An acoustic version and a remix by Guy Berryman titled \"Supernova 7 Mix\" were released digitally on streaming platforms on 27 September. A third remix, handled by SUGA, was released on 18 October, and additional remixes by Galantis and David Guetta were released in November.\n\nA music video directed by Dave Meyers was released on 30 September 2021. Set in the \"Spheres planetary system\", where music has been banned by the \"Silencers\", who appeared in Coldplay's 2011 album \"Mylo Xyloto\". The video depicts Coldplay, BTS, and the fictional alien band Supernova 7 performing \"My Universe\" together. Though located on different planets, the three groups are united as holograms through \"HOLOBAND\" technology controlled by alien DJ Lafrique, who broadcasts their performance throughout the system from her radio ship while being hunted by the Silencers. Coldplay filmed the video at an empty, abandoned municipal swimming pool complex in Rubí, Barcelona, in July 2021. The BTS portion was shot on a green-screen stage at a studio in Seoul, South Korea, two weeks after the Barcelona shoot. The green screen was useful to make the visual effects, such as the groups' holographic versions, and to unite the scenes from both groups.\n\nThe song debuted at #1 on the Billboard Hot 100, marking BTS' sixth and Coldplay's second chart-topping single. This was also the first collaboration between two lead groups to debut at the top of the Hot 100. The track topped several other charts, including the Billboard Global 200 and Global Excl. U.S., and dominated the UK Singles Chart at #3 while becoming the most downloaded song of 2021 in the UK.\n\nThe song earned critical acclaim and multiple accolades, including wins at the Melon Music Awards and MTV Video Music Awards Japan. It also received a Grammy nomination for Best Pop Duo\/Group Performance. As of now, it has surpassed 1.36 billion streams on Spotify and garnered over 314 million views on YouTube.\n\nThe song was written by Chris Martin, Guy Berryman, Jonny Buckland, Will Champion, RM, SUGA, j-hope, Bill Rahko, Jacob Collier, & Kygo. The production was led by Max Martin, Oscar Holter & Bill Rahko, with contributions from Coldplay' members. <a href=\"http:\/\/www.last.fm\/music\/Coldplay\/_\/My+Universe\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}