{
  "created_at": "2025-05-03T14:39:55.778088+00:00",
  "elapsed": 0.177928,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:39:55.778088+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "3917",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:39:56 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Olivia+Rodrigo&format=json&method=track.getInfo&track=the+grudge"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Olivia+Rodrigo&format=json&method=track.getInfo&track=the+grudge",
  "_decoded_content": {
    "track": {
      "name": "The Grudge",
      "url": "https:\/\/www.last.fm\/music\/Olivia+Rodrigo\/_\/The+Grudge",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "614766",
      "playcount": "10604579",
      "artist": {
        "name": "Olivia Rodrigo",
        "url": "https:\/\/www.last.fm\/music\/Olivia+Rodrigo"
      },
      "toptags": {
        "tag": [
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "Ballad",
            "url": "https:\/\/www.last.fm\/tag\/Ballad"
          },
          {
            "name": "sad",
            "url": "https:\/\/www.last.fm\/tag\/sad"
          },
          {
            "name": "singer-songwriter",
            "url": "https:\/\/www.last.fm\/tag\/singer-songwriter"
          },
          {
            "name": "piano",
            "url": "https:\/\/www.last.fm\/tag\/piano"
          }
        ]
      },
      "wiki": {
        "published": "13 Sep 2023, 05:44",
        "summary": "\"the grudge\" is a song that explores the aftermath of a betrayal in a relationship. The lyrics reveal the deep pain and resentment the narrator feels towards their ex-partner.\n\nIn the first verse, the narrator describes the trauma caused by the betrayal, highlighting the trust that was broken and how their world was completely changed by one phone call. They express their frustration that the person who hurt them doesn't seem to think about the damage they caused. <a href=\"http:\/\/www.last.fm\/music\/Olivia+Rodrigo\/_\/The+Grudge\">Read more on Last.fm<\/a>.",
        "content": "\"the grudge\" is a song that explores the aftermath of a betrayal in a relationship. The lyrics reveal the deep pain and resentment the narrator feels towards their ex-partner.\n\nIn the first verse, the narrator describes the trauma caused by the betrayal, highlighting the trust that was broken and how their world was completely changed by one phone call. They express their frustration that the person who hurt them doesn't seem to think about the damage they caused. The narrator clings to every detail of the betrayal, unable to let go, and feels haunted by their ex's voice, which makes them doubt their own worth.\n\nThe chorus reflects the struggle of trying to appear tough and unaffected by the pain, while internally feeling a desire to scream and question how someone could hurt them so easily. The narrator admits that they can't let go of their feelings, despite trying for a long time. They acknowledge that forgiveness requires strength, but they don't feel strong enough to forgive yet.\n\nIn the second verse, the narrator reveals the internal arguments they have with their ex in their mind, where they can win and make their ex feel guilty. They imagine a scenario where their ex is remorseful for their actions, believing that they must be insecure and unhappy to have caused such pain. The narrator acknowledges that both parties were hurt, but recognizes that the wounds inflicted were not equal.\n\nThe bridge raises questions about whether the narrator believes they deserved the pain inflicted upon them. It also highlights the toxic nature of the relationship, with the mention of a flower filled with vitriol, symbolizing the ex's poisonous behavior. The line \"You have everything and you still want more\" suggests a sense of entitlement and greed on the part of the ex.\n\nThe final chorus demonstrates the conflicting emotions the narrator still holds towards their ex. Despite everything that has happened, they admit that their ex still means everything to them. They recognize that their ex doesn't care, and while they have tried to let go, forgiveness still feels out of reach. The narrator acknowledges that forgiveness requires strength but admits uncertainty about whether they have reached that point yet.\n\nOverall, \"the grudge\" delves into the emotional aftermath of betrayal, exploring feelings of resentment, anger and the struggle to forgive. It portrays the internal battle between holding on to the pain caused and wanting to let go and move on. <a href=\"http:\/\/www.last.fm\/music\/Olivia+Rodrigo\/_\/The+Grudge\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}