{
  "created_at": "2025-05-03T14:28:28.996189+00:00",
  "elapsed": 0.281068,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:28:28.996189+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5847",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:28:29 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=P%21nk&format=json&method=track.getInfo&track=What+About+Us"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=P%21nk&format=json&method=track.getInfo&track=What+About+Us",
  "_decoded_content": {
    "track": {
      "name": "What About Us",
      "url": "https:\/\/www.last.fm\/music\/P%21nk\/_\/What+About+Us",
      "duration": "269000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "355389",
      "playcount": "2710675",
      "artist": {
        "name": "P!nk",
        "mbid": "f4d5cc07-3bc9-4836-9b15-88a08359bc63",
        "url": "https:\/\/www.last.fm\/music\/P%21nk"
      },
      "album": {
        "artist": "P!nk",
        "title": "Beautiful Trauma",
        "url": "https:\/\/www.last.fm\/music\/P%21nk\/Beautiful+Trauma",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/1a30e25e207cbf7b0769945030b5edb9.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/1a30e25e207cbf7b0769945030b5edb9.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/1a30e25e207cbf7b0769945030b5edb9.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/1a30e25e207cbf7b0769945030b5edb9.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "2017",
            "url": "https:\/\/www.last.fm\/tag\/2017"
          },
          {
            "name": "best of 2017",
            "url": "https:\/\/www.last.fm\/tag\/best+of+2017"
          },
          {
            "name": "female vocalists",
            "url": "https:\/\/www.last.fm\/tag\/female+vocalists"
          },
          {
            "name": "club",
            "url": "https:\/\/www.last.fm\/tag\/club"
          }
        ]
      },
      "wiki": {
        "published": "11 Aug 2017, 16:16",
        "summary": "\"What About Us\" is a song recorded by the American singer-songwriter Pink for her seventh studio album Beautiful Trauma (2017). RCA Records released the song for digital download and streaming on August 10, 2017, as the album's lead single. The song, which written by Pink, Johnny McDaid, and its producer Steve Mac, is an electronic dance music (EDM) track with upbeat dance production that blends repetitive chords, synthesizers, and drum machine beats. <a href=\"http:\/\/www.last.fm\/music\/P%21nk\/_\/What+About+Us\">Read more on Last.fm<\/a>.",
        "content": "\"What About Us\" is a song recorded by the American singer-songwriter Pink for her seventh studio album Beautiful Trauma (2017). RCA Records released the song for digital download and streaming on August 10, 2017, as the album's lead single. The song, which written by Pink, Johnny McDaid, and its producer Steve Mac, is an electronic dance music (EDM) track with upbeat dance production that blends repetitive chords, synthesizers, and drum machine beats. Pink, who was inspired by the politics of the time, composed it as a political protest song with poetic and inclusive lyrics. The song's lyrics explore Pink's belief the US government had failed people and sends a message about those who feel unheard or forgotten.\n\nMusic critics gave \"What About Us\" mostly positive reviews; many of them commended the production and Pink's vocal performance while others appreciated the song's political message and the anthemic nature of the composition. It peaked at number 13 on the US Billboard Hot 100 and gave Pink her record-breaking ninth number-one song on the Adult Pop Songs chart, surpassing Katy Perry as the soloist with the most chart-topping songs on the chart. The song also reached number one the national charts of eight countries, including Australia, Poland and Switzerland, and peaked within the top 10 in 12 other territories, including Canada and the United Kingdom. \"What About Us\" was nominated for Best Pop Solo Performance at the 60th Annual Grammy Awards.\n\nAn accompanying music video for \"What About Us\" was directed by Georgia Hudson and released on August 16, 2017. It depicts Pink and members of minority groups performing several choreographed routines in an abandoned city while being chased by searchlights from hovering helicopters. The video received positive reviews from critics, who praised the choreography and the representation of oppressed groups, as well as the song's political theme. To promote the song, Pink performed it live at the 2017 MTV Video Music Awards, on Saturday Night Live, and on The Ellen DeGeneres Show, among other televised appearances, as well as her Beautiful Trauma World Tour (2017–2019). The song has been covered several times during live performances by other artists, including Kelly Clarkson and Liam Payne.\n\nWriting and inspiration\nAfter conducting The Truth About Love Tour (2013–2014) in support of her sixth studio album The Truth About Love (2012), Pink took a nearly-four-year hiatus to focus on her personal life and find inspiration. During the hiatus, she concentrated on her family and living \"a normal life\", which influenced her music. Fifty songs were composed throughout the development of Beautiful Trauma, including \"What About Us\".\n\n\"What About Us\" was written by Pink, Johnny McDaid and Steve Mac, and was produced by Mac. In an interview with Vulture, Pink talked about the experience of writing the song, stating, \"it was just another day I was angry about what's happening in the world\". The singer decided to have discussions and anecdotes with McDaid to develop ideas for the album's songs; McDaid said Pink had \"so much to say\" and expressed herself \"really profoundly\". \"What About Us\" was written and recorded during the session; according to Pink, \"those are those kinds of songs where it just falls out of you, that's why I think you're just a vessel when you're being creative\".\n\nWhen asked about the creation of the song, McDaid said:\n\nFrom my perspective the creation of it is about looking into yourself, interacting. It's like alchemy, you know, you interact with the person there in the room and ... these things, these ideas come out and what the ideas are for [Pink] are probably different to even the person hearing it. And that's the beauty of her, she really allows people to receive her music the way they do. <a href=\"http:\/\/www.last.fm\/music\/P%21nk\/_\/What+About+Us\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}