{
  "created_at": "2025-05-03T14:40:06.499221+00:00",
  "elapsed": 0.336745,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:40:06.499221+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4827",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:40:06 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Noah+Kahan&format=json&method=track.getInfo&track=Stick+Season"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Noah+Kahan&format=json&method=track.getInfo&track=Stick+Season",
  "_decoded_content": {
    "track": {
      "name": "Stick Season",
      "url": "https:\/\/www.last.fm\/music\/Noah+Kahan\/_\/Stick+Season",
      "duration": "182000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "756253",
      "playcount": "15012964",
      "artist": {
        "name": "Noah Kahan",
        "url": "https:\/\/www.last.fm\/music\/Noah+Kahan"
      },
      "album": {
        "artist": "Noah Kahan",
        "title": "Stick Season",
        "url": "https:\/\/www.last.fm\/music\/Noah+Kahan\/Stick+Season",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/370510f1781a9bd351389b6633c517ed.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/370510f1781a9bd351389b6633c517ed.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/370510f1781a9bd351389b6633c517ed.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/370510f1781a9bd351389b6633c517ed.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "indie folk",
            "url": "https:\/\/www.last.fm\/tag\/indie+folk"
          },
          {
            "name": "indie",
            "url": "https:\/\/www.last.fm\/tag\/indie"
          },
          {
            "name": "singer-songwriter",
            "url": "https:\/\/www.last.fm\/tag\/singer-songwriter"
          },
          {
            "name": "guitar",
            "url": "https:\/\/www.last.fm\/tag\/guitar"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          }
        ]
      },
      "wiki": {
        "published": "16 Jul 2022, 04:07",
        "summary": "On “Stick Season,” singer and songwriter Noah Kahan unlocks the next level of his artistry. The track arrives via Republic Records as an homage to growth, encapsulating the highs and lows of change that – while hard to understand in the moment – are necessary and inevitable in life.\n\n“I wrote ‘Stick Season’ without knowing it would become, in my opinion, the most important song of my career,” Kahan shared in a statement. “It allowed me to finally cross over into the style of songwriting that I have loved my entire life <a href=\"http:\/\/www.last.fm\/music\/Noah+Kahan\/_\/Stick+Season\">Read more on Last.fm<\/a>.",
        "content": "On “Stick Season,” singer and songwriter Noah Kahan unlocks the next level of his artistry. The track arrives via Republic Records as an homage to growth, encapsulating the highs and lows of change that – while hard to understand in the moment – are necessary and inevitable in life.\n\n“I wrote ‘Stick Season’ without knowing it would become, in my opinion, the most important song of my career,” Kahan shared in a statement. “It allowed me to finally cross over into the style of songwriting that I have loved my entire life, and the second I finished writing it, I felt a level of comfort and honesty that I had never previously felt since I began my journey in music.”\n\n”Stick Season,” which marks Kahan’s first official release since his long-awaited sophomore album I Was \/ I Am arrived last year, was brought to life by visuals that reflect the changing of seasons in his home state of Vermont. Just as winter turns to spring, and spring to summer, then summer to fall, and fall back into winter, people change while weathering the seasons of their own lives.\n\n“Being able to tell a story, and being able to relate back to my home in New England in such an honest way, made me believe in myself again,” Kahan said. “At its core, ‘Stick Season’ is a song about feeling left behind and feeling trapped. It’s about seeing the other side of a place you thought was only beautiful. As a relationship ends, some place or someone you used to look back at so fondly quickly transforms into a memory of pain.”\n\nHe adds: “The beauty of autumn foliage in Vermont transforms into a brown and gray wasteland as we wait for the first snow. It is an unfortunate but necessary transition, similar in so many ways to the transition from familiar lovers into heartbroken strangers. I like to look at the song as hopeful; winter will come, the snow will fall, melt, and eventually summer will be back in all its beauty. You will suffer, move on, and survive again.”\n\nThe final line of the song finds Kahan reaching a point of understanding and acceptance as he sings: “Now you’re tire tracks, and one pair of shoes, and I’m split in half, but that’ll have to do.” In his statement, he explains that this particular lyric “speaks to the acknowledgement of the end, an inventory of the pieces left behind, and an acceptance of the future.”\n\n\"Stick Season\" was first performed on Instagram Live in 2020. Noah has since been performing the unreleased song on his \"I Was\/I Am\" Tour.\n\nHis latest and final album in the Stick season series, \"Stick Season\/ Forever\" features the famous single along with the entire contents of his album \"Stick Season \" and all his featuring -  'We'll All Be Here Forever' Tracks. <a href=\"http:\/\/www.last.fm\/music\/Noah+Kahan\/_\/Stick+Season\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}