{
  "created_at": "2025-05-03T14:32:05.799168+00:00",
  "elapsed": 0.18114,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:32:05.799168+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "3088",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:32:06 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Lana+Del+Rey&format=json&method=track.getInfo&track=Love+song"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Lana+Del+Rey&format=json&method=track.getInfo&track=Love+song",
  "_decoded_content": {
    "track": {
      "name": "Love Song",
      "url": "https:\/\/www.last.fm\/music\/Lana+Del+Rey\/_\/Love+Song",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "672212",
      "playcount": "9624379",
      "artist": {
        "name": "Lana Del Rey",
        "mbid": "b7539c32-53e7-4908-bda3-81449c367da6",
        "url": "https:\/\/www.last.fm\/music\/Lana+Del+Rey"
      },
      "toptags": {
        "tag": [
          {
            "name": "dream pop",
            "url": "https:\/\/www.last.fm\/tag\/dream+pop"
          },
          {
            "name": "art pop",
            "url": "https:\/\/www.last.fm\/tag\/art+pop"
          },
          {
            "name": "alternative",
            "url": "https:\/\/www.last.fm\/tag\/alternative"
          },
          {
            "name": "Lana Del Rey",
            "url": "https:\/\/www.last.fm\/tag\/Lana+Del+Rey"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          }
        ]
      },
      "wiki": {
        "published": "21 Aug 2020, 13:32",
        "summary": "\"Love Song\" (stylized in sentence case) is a song about a passionate and intense romantic relationship. The lyrics describe the relationship between two people who are deeply in love and enjoy spending time together. The first verse describes the thrill of being in the backseat of a car with the person they love, going fast and feeling alive. The singer believes that she can make her partner proud of her and feels like a star when she's with them. <a href=\"http:\/\/www.last.fm\/music\/Lana+Del+Rey\/_\/Love+Song\">Read more on Last.fm<\/a>.",
        "content": "\"Love Song\" (stylized in sentence case) is a song about a passionate and intense romantic relationship. The lyrics describe the relationship between two people who are deeply in love and enjoy spending time together. The first verse describes the thrill of being in the backseat of a car with the person they love, going fast and feeling alive. The singer believes that she can make her partner proud of her and feels like a star when she's with them.\n\nThe chorus expresses the singer's desire for a once-in-a-lifetime love and how grateful she is to be in this relationship, despite feeling like a \"fucking mess\". She's thankful for the high life this person has brought her and acknowledges that they've passed some kind of test, but more importantly, she's just happy to be with them.\n\nThe second verse is about how the singer feels safe with this person and trusts them to see her for who she really is. They explore each other’s bodies freely and she wonders if it's safe to continue doing so. This verse can be interpreted as the singer poking fun at the concept of safety and how the intensity of their relationship can be both exhilarating and scary.\n\nThe final chorus emphasizes that despite any potential risks, the relationship is worth it because of how deeply the two are in love. The \"taste, the touch, the way we love\" all come together to make the sound of their love song. In the end, this is a song about how beautiful and intense it is to be completely in love with someone and the risks and rewards that come with it.\n\nIt is the sixth track from Lana Del Rey's sixth studio album, Norman Fucking Rockwell! <a href=\"http:\/\/www.last.fm\/music\/Lana+Del+Rey\/_\/Love+Song\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}