{
  "created_at": "2025-05-03T14:31:19.498924+00:00",
  "elapsed": 0.181124,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:31:19.498924+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5364",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:31:19 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Jeremy+Zucker&format=json&method=track.getInfo&track=comethru"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Jeremy+Zucker&format=json&method=track.getInfo&track=comethru",
  "_decoded_content": {
    "track": {
      "name": "comethru",
      "url": "https:\/\/www.last.fm\/music\/Jeremy+Zucker\/_\/comethru",
      "duration": "181000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "359383",
      "playcount": "3262095",
      "artist": {
        "name": "Jeremy Zucker",
        "url": "https:\/\/www.last.fm\/music\/Jeremy+Zucker"
      },
      "album": {
        "artist": "Various Artists",
        "title": "Indie Mix",
        "url": "https:\/\/www.last.fm\/music\/Various+Artists\/Indie+Mix",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/7951fa58b7bacbc22de44bde9794b633.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/7951fa58b7bacbc22de44bde9794b633.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/7951fa58b7bacbc22de44bde9794b633.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/7951fa58b7bacbc22de44bde9794b633.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "indie",
            "url": "https:\/\/www.last.fm\/tag\/indie"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "indie pop",
            "url": "https:\/\/www.last.fm\/tag\/indie+pop"
          },
          {
            "name": "Awesome",
            "url": "https:\/\/www.last.fm\/tag\/Awesome"
          },
          {
            "name": "Favorite",
            "url": "https:\/\/www.last.fm\/tag\/Favorite"
          }
        ]
      },
      "wiki": {
        "published": "15 Jan 2022, 06:20",
        "summary": "“comethru” is the opening track for Jeremy Zucker’s EP, \"summer,\". The song lays out the mindset of Jeremy as he was transitioning into a new lifestyle.\n\nJeremy graduated from college shortly before releasing this song. While he watched his friends move into full time jobs, Jeremy found himself locked in his parents' basement. He was working many hours to create and produce music like this song.\n\nIn the song, Jeremy sings about how he dealt with the idea of working while his friends were out celebrating their last summer before 18. <a href=\"http:\/\/www.last.fm\/music\/Jeremy+Zucker\/_\/comethru\">Read more on Last.fm<\/a>.",
        "content": "“comethru” is the opening track for Jeremy Zucker’s EP, \"summer,\". The song lays out the mindset of Jeremy as he was transitioning into a new lifestyle.\n\nJeremy graduated from college shortly before releasing this song. While he watched his friends move into full time jobs, Jeremy found himself locked in his parents' basement. He was working many hours to create and produce music like this song.\n\nIn the song, Jeremy sings about how he dealt with the idea of working while his friends were out celebrating their last summer before 18. In a tweet, Jeremy also stated that he wrote the song all alone during a summer while being bored and lonely.\n\n\"'The inspiration for the song was staying at home this past Summer by myself, living and making music out of my parents' basement. And just feeling lonely all the time. I was working my ass off every single day, working crazy hours in my basement. And I basically was just lonely, and I felt like I needed someone to be around me to lift my spirits and live life differently, I guess. I was in this loop of just working and working, and not taking care of myself. I just wanted, whether it was a friend or a girl, or just to do something to shake my day up. I just needed someone to come through.'\"\n\n\"'I made this song a little differently than a lot of my other songs, normally I’m in front of my computer and producing and playing a bunch of instruments, and writing the song as I’m producing it. But for this one, I was just chilling in my room on the guitar. I wrote the whole song out, and I was like, “Wow, this is amazing. But I have no idea how I’m gonna produce it out into a whole song.” So actually, we made six different versions of it, all with different production and all these other things happening. I was sending it to my friends back and forth, and it took so long to realize that the best version was the stripped down version. It became this acoustic jam. I decided to keep this one stripped down, because generally I think when I’m producing, less is more. I’ll lay out a million different ideas with all these different instruments, and they all tie into each other, and transition perfectly. And in the moment, I’m like, “This is so crazy,” and it’s so fulfilling to my ears, just being a production nerd. But when I take a step back and I listen to the song again, I’m really just focusing on the song and the lyrics and the melody. So sometimes getting rid of a lot of that extra stuff, lets the song itself shine through. I feel like “comethru” is such an easy song to listen to, and when I was writing that, I was like, “People are gonna love this.” And it made me feel so good to write it, and I was so in-the-moment. But I hated working on it for such an extended period of time, because I feel like an easy song to listen to is, you love it in-the-moment, but I feel like it’s always short-lived. When you find a song that really hits you deep, it lasts for a long time. So those songs, I’m so happy to keep going on the production and editing it and making it amazing and long and cinematic. But with “comethru,” it was so hard. I had to stay in the mindset to be like, “This is a happy song, I can’t put too much thought into it, or else it’s not gonna sound happy.”'\" <a href=\"http:\/\/www.last.fm\/music\/Jeremy+Zucker\/_\/comethru\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}