{
  "created_at": "2025-05-03T14:43:42.053205+00:00",
  "elapsed": 0.208326,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:43:42.053205+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "7658",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:43:42 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Gym+Class+Heroes&format=json&method=track.getInfo&track=Stereo+Hearts"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Gym+Class+Heroes&format=json&method=track.getInfo&track=Stereo+Hearts",
  "_decoded_content": {
    "track": {
      "name": "Stereo Hearts (feat. Adam Levine)",
      "url": "https:\/\/www.last.fm\/music\/Gym+Class+Heroes\/_\/Stereo+Hearts+(feat.+Adam+Levine)",
      "duration": "210000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1018706",
      "playcount": "7569349",
      "artist": {
        "name": "Gym Class Heroes",
        "mbid": "f4d4b515-0b74-423f-a161-db184330c37c",
        "url": "https:\/\/www.last.fm\/music\/Gym+Class+Heroes"
      },
      "album": {
        "artist": "Gym Class Heroes",
        "title": "The Papercut Chronicles II",
        "url": "https:\/\/www.last.fm\/music\/Gym+Class+Heroes\/The+Papercut+Chronicles+II",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/d4dcaa646976b94bee327f17d7b70939.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/d4dcaa646976b94bee327f17d7b70939.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/d4dcaa646976b94bee327f17d7b70939.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/d4dcaa646976b94bee327f17d7b70939.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "Hip-Hop",
            "url": "https:\/\/www.last.fm\/tag\/Hip-Hop"
          },
          {
            "name": "pop",
            "url": "https:\/\/www.last.fm\/tag\/pop"
          },
          {
            "name": "hip hop",
            "url": "https:\/\/www.last.fm\/tag\/hip+hop"
          },
          {
            "name": "adam levine",
            "url": "https:\/\/www.last.fm\/tag\/adam+levine"
          },
          {
            "name": "gym class heroes",
            "url": "https:\/\/www.last.fm\/tag\/gym+class+heroes"
          }
        ]
      },
      "wiki": {
        "published": "18 Aug 2011, 17:29",
        "summary": "\"Stereo Hearts\" is a song by American group Gym Class Heroes featuring Adam Levine of Maroon 5. The song was released on June 14, 2011, as the lead single from the group's fifth studio album The Papercut Chronicles II. It got some heat when Adam Levine talked it up on The Voice, which was in its first season at the time.\n\nProduced by Benny Blanco and Robopop, \"Stereo Hearts\" begins with Adam Levine singing the hook. \"My heart's a stereo \/ It beats for you, so listen close \/ Hear my thoughts in every note. <a href=\"http:\/\/www.last.fm\/music\/Gym+Class+Heroes\/_\/Stereo+Hearts+(feat.+Adam+Levine)\">Read more on Last.fm<\/a>.",
        "content": "\"Stereo Hearts\" is a song by American group Gym Class Heroes featuring Adam Levine of Maroon 5. The song was released on June 14, 2011, as the lead single from the group's fifth studio album The Papercut Chronicles II. It got some heat when Adam Levine talked it up on The Voice, which was in its first season at the time.\n\nProduced by Benny Blanco and Robopop, \"Stereo Hearts\" begins with Adam Levine singing the hook. \"My heart's a stereo \/ It beats for you, so listen close \/ Hear my thoughts in every note. \/ Make me your radio \/ Turn me up when you feel low \/ This melody was meant for you \/ So sing along to my stereo.\" The song is written in the key of F♯ minor. McCoy then raps about serenading his ideal girl and picking love over animosity, all the while relaying the message using music-based metaphors. Additional Fender Rhodes was played by Austin Bis at Chalice Recording Studios in Los Angeles.\n\nGym Class Heroes drummer Matt McGinley explained that the song's music video \"basically plays on the idea that we're sort of just being casual, hanging out, being ourselves and our shadows get wild and get loose. The video shows the band playing in the city of New York and their shadows are playing on the ground.\"\n\nThe video (directed by Hiro Murai) has the feel of a 1980s setting, with a breakdancer and several payphones seen, though the actual setting is modern as evidenced by the Mini Cooper in one scene. It prominently features a pawn shop with a stack of old-fashioned boomboxes and TV sets, on which Adam Levine appears when he is singing the chorus.\n\nA lyric video for the song received millions of views in the first month of its release. This is one of the first lyric videos to incorporate a live action story line, showing a man and a woman in split-screen as they get dressed for the day and go outdoors carrying boom-boxes, until they finally meet in a park. The video stars actress Breana McDow and was directed by music video director Djay Brawner.\n\nThe song received positive reviews. MTV's Jenna Hally Rubenstein complimented the band's new direction on \"Stereo Hearts\", writing that it is \"a little more slickly produced than we're used to, but, we're still solidly behind the experimental new song.\" MTV's James Montgomery described it as a \"prime-time slab of genre-mashing, sweat-inducing pop, the kind of song that may very well push GCH to summertime superstardom.\" Becky Bain of Idolator called it a \"head-nodding jam\" and \"an instantly memorable signal that Gym Class is back in session.\"\n\nTravie McCoy joined Maroon 5 onstage to perform \"Stereo Hearts\" on Saturday Night Live on November 5, 2011. Gym Class Heroes and Adam Levine performed the song at the 2011 American Music Awards, along with Christina Aguilera for the Maroon 5 song \"Moves like Jagger\" on November 20, 2011. The duo continued with the song on The Ellen DeGeneres Show on November 23, 2011, and Pepsi Super Bowl Fan Jam, a pre-show of the Super Bowl XLVI on February 2, 2012.\n\nOne of the upstart writers Brandon Lowry spoke to SongFacts about the track's creation:\n\n\"It was originally more of an emo-pop-punk thing,\" he said. \"We were pitching it to artists to record for their albums and somebody at Fueled By Ramen \/ Atlantic Records heard the chorus and it became this bastardized - in a good way - hodgepodge of a bunch of different people collaborating on this one song. It turned into this entity of rapping and singing, but the original song was me and two other people that we wrote on a piano. \n\nThe label had us cut out the original verses. They took the chorus and sent it to the legendary producer Benny Blanco. He then made the song around the chorus and took some of the original demo parts, then sent it to Travie McCoy from Gym Class Heroes, who did the raps.\n\nIt started to take shape, it started to be awesome, then Adam Levine jumped on the hook because he was friends with Benny. He wrote the bridge and suddenly we have a song. They didn't know whose song it was - is it a Maroon 5 song? Is it Gym Class Heroes? It ended up being Gym Class Heroes featuring Adam Levine.\n\nBefore that I was literally broke and about to move back in with my parents. My partner and I had been working on pop songs for two years with no luck, and we were about to quit. Then a few weeks after that, this happened and it became a life-changing song.\"\n\nTravis McCoy found working with Levine inspired him to push on to the next level with his own vocals. The Gym Class frontman told MTV News: \"It's a fun love song at the end of the day, and it's definitely got a summertime vibe. And having Adam bless us with his vocal stylings doesn't hurt much,\" McCoy said. \"He just destroyed it. Watching that dude do [vocal] runs, and first he belts out the hook, and I'm like, 'OK!' then he does overdubs and he's like, 'Nah, I don't like that, I can do better.'\"\n\nMcCoy explained the song's meaning to MTV News: \"We worked with Benny Blanco on this single, and the chorus kind of jumped out at me, the whole metaphor for your heart being a stereo. Lyrically, I played off that, just imagining my heart being inanimate objects like dusty records and old-school boom boxes and whatnot.\"\n\nThe song rose to #4 in the US in October and went on to post massive streaming numbers, earning over 500 million views on YouTube and nearly one billion streams on Spotify. <a href=\"http:\/\/www.last.fm\/music\/Gym+Class+Heroes\/_\/Stereo+Hearts+(feat.+Adam+Levine)\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}