{
  "created_at": "2025-05-03T14:43:21.869437+00:00",
  "elapsed": 0.259008,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:43:21.869437+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5398",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:43:22 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Skrillex&format=json&method=track.getInfo&track=Rumble"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Skrillex&format=json&method=track.getInfo&track=Rumble",
  "_decoded_content": {
    "track": {
      "name": "Rumble",
      "url": "https:\/\/www.last.fm\/music\/Skrillex\/_\/Rumble",
      "duration": "146000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "275728",
      "playcount": "2399222",
      "artist": {
        "name": "Skrillex",
        "mbid": "ae002c5d-aac6-490b-a39a-30aa9e2edf2b",
        "url": "https:\/\/www.last.fm\/music\/Skrillex"
      },
      "album": {
        "artist": "Skrillex",
        "title": "Rumble",
        "url": "https:\/\/www.last.fm\/music\/Skrillex\/Rumble",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/b862d3ec7eb4b14dacf528c1227d9399.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/b862d3ec7eb4b14dacf528c1227d9399.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/b862d3ec7eb4b14dacf528c1227d9399.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/b862d3ec7eb4b14dacf528c1227d9399.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "dubstep",
            "url": "https:\/\/www.last.fm\/tag\/dubstep"
          },
          {
            "name": "Grime",
            "url": "https:\/\/www.last.fm\/tag\/Grime"
          },
          {
            "name": "EDM",
            "url": "https:\/\/www.last.fm\/tag\/EDM"
          },
          {
            "name": "electronic",
            "url": "https:\/\/www.last.fm\/tag\/electronic"
          },
          {
            "name": "UK Dubstep",
            "url": "https:\/\/www.last.fm\/tag\/UK+Dubstep"
          }
        ]
      },
      "wiki": {
        "published": "23 Jan 2023, 01:05",
        "summary": "“Rumble“ is a song by American record producer Skrillex, British record producer Fred Again, and British rapper Flowdan. It was released as a single through Atlantic Records and Owsla on January 4, 2023, with production handled by Skrillex and Fred Again. The song features uncredited vocals from American singer Elley Duhé and contains additional writing from Jordan Douglas and Tyshane Thomas. It is the first single from Skrillex' 2023 studio album, his first since 2014's Recess. <a href=\"http:\/\/www.last.fm\/music\/Skrillex\/_\/Rumble\">Read more on Last.fm<\/a>.",
        "content": "“Rumble“ is a song by American record producer Skrillex, British record producer Fred Again, and British rapper Flowdan. It was released as a single through Atlantic Records and Owsla on January 4, 2023, with production handled by Skrillex and Fred Again. The song features uncredited vocals from American singer Elley Duhé and contains additional writing from Jordan Douglas and Tyshane Thomas. It is the first single from Skrillex' 2023 studio album, his first since 2014's Recess.\n\nIn an interview with BBC Radio 1, Skrillex explained that “Rumble“ was initially a collaboration between Fred Again and Flowdan from 2018. After meeting Fred and hearing the song for the first time, he asked for the song's stems and made his own version, which he disliked: \"I did something. I didn’t like it. I thought I ruined the song. I was scared to play it and then we started working on it like months ago.\" English producer Four Tet was also involved, but eventually \"kicked off\" from the song. During a live set at the Electric Ballroom in London on January 6, 2023 featuring all three producers, Skrillex explained that Four Tet's role \"was the most important role, which was to make sure we didn’t overproduce it and fuck it up\".\n\nIn July 2022, Fred Again played a set for Boiler Room in London, in which the song was included and played in public for the first time. The song became a fan-favourite from the set, creating excitement for a possible release and prompting unofficial uploads of the song to appear on YouTube in the weeks leading up to release.\n\nOn January 2, 2023, Skrillex posted a 15-second teaser of Rumble on social media, alongside the text \"QFF\/DGTC 23\", announcing a potential full length studio project or double album. It would be his first studio album in 9 years, following 2014's Recess. The announcement of the album and song's release garnered positive reaction, including from fellow producers Tchami, Subtronics, Kill the Noise, Eptic, Deorro, and rapper Missy Elliot, among others.\n\nUpon the song's release on January 4, Skrillex announced that another single, “Way Back“, with American rapper and singer Trippie Redd and British singer and producer PinkPantheress, would release on January 6. On January 5, a live set with Skrillex, Fred Again, and Four Tet took place at the Electric Ballroom in London, where “Rumble“ was played.\n\nUpon release, the song received positive reviews from fans and critics. Jon Blistein of Rolling Stone wrote \"“Rumble“ lives up to its name, with Flowdan rapping over a steady, propulsive groove punctuated with menacing bass swells. The two-and-half-minute track builds steadily to a clever peak that drops with a deft, almost understated boom.\" Cameron Sunkel of EDM.com stated that “Rumble“ \"appropriately combines the best of [Skrillex and Fred Again's] respective worlds in flawless fashion\", adding that \"Skrillex's mission to make the club shake remains undeterred\", and that \"the spirit of the duo's collective penchant for deep dubstep and jungle-inspired electronic music shines through in spades.\" Katie Bain of Billboard wrote that despite its short length, \"the song packs a heavy punch with a sinewy, stuttering beat simmered in the deepest vibrations of the low end and a bridge composed of a voice pitched all the way up,\" while also praising Flowdan's delivery and lyrical content. <a href=\"http:\/\/www.last.fm\/music\/Skrillex\/_\/Rumble\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}