{
  "created_at": "2025-05-03T14:44:45.952526+00:00",
  "elapsed": 0.178349,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:44:45.952526+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "4158",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:44:46 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Mike+Posner&format=json&method=track.getInfo&track=I+Took+A+Pill+In+Ibiza+-+Seeb+Remix"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Mike+Posner&format=json&method=track.getInfo&track=I+Took+A+Pill+In+Ibiza+-+Seeb+Remix",
  "_decoded_content": {
    "track": {
      "name": "I Took A Pill In Ibiza - SeeB Remix",
      "url": "https:\/\/www.last.fm\/music\/Mike+Posner\/_\/I+Took+A+Pill+In+Ibiza+-+SeeB+Remix",
      "duration": "0",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "777537",
      "playcount": "6117795",
      "artist": {
        "name": "Mike Posner",
        "mbid": "5b64e344-b2fb-47bd-bd7b-4c793b17d472",
        "url": "https:\/\/www.last.fm\/music\/Mike+Posner"
      },
      "toptags": {
        "tag": [
          {
            "name": "tropical house",
            "url": "https:\/\/www.last.fm\/tag\/tropical+house"
          },
          {
            "name": "electropop",
            "url": "https:\/\/www.last.fm\/tag\/electropop"
          },
          {
            "name": "2016",
            "url": "https:\/\/www.last.fm\/tag\/2016"
          },
          {
            "name": "dance",
            "url": "https:\/\/www.last.fm\/tag\/dance"
          },
          {
            "name": "dance-pop",
            "url": "https:\/\/www.last.fm\/tag\/dance-pop"
          }
        ]
      },
      "wiki": {
        "published": "04 Apr 2024, 19:52",
        "summary": "\"It was sort of a mystery pill. I was already under the influence of alcohol at the time. I had written a song with Avicii that week in Sweden called \"Stay with You\" and he was playing in Ibiza so I said, 'I will just go there with you,' because I was already in Europe. I don't have like a regular 9–5 job ... so might as well go to Ibiza, right? I had never been there before. So I went. We were at his show and I was drinking at the time. I just sort of moseyed out into the audience to watch Avicii spin from their point of view. <a href=\"http:\/\/www.last.fm\/music\/Mike+Posner\/_\/I+Took+A+Pill+In+Ibiza+-+SeeB+Remix\">Read more on Last.fm<\/a>.",
        "content": "\"It was sort of a mystery pill. I was already under the influence of alcohol at the time. I had written a song with Avicii that week in Sweden called \"Stay with You\" and he was playing in Ibiza so I said, 'I will just go there with you,' because I was already in Europe. I don't have like a regular 9–5 job ... so might as well go to Ibiza, right? I had never been there before. So I went. We were at his show and I was drinking at the time. I just sort of moseyed out into the audience to watch Avicii spin from their point of view. I would go back and forth between the backstage and the VIP area and then where the actual kids were. And most people didn't know who the heck I was in Ibiza except for this one guy who recognized me. He was like, 'Are you Mike Posner?' and he was all excited. He holds up this little bag of pills and is like, 'You want one?' And drunk Mike Posner was like, 'Fuck it, yeah.' So I took one and I had never done that before, and then I felt amazing. Then when I came down I felt 10 years older.\"\n\nThat's what Mike Posner explaining the inspiration for the song at August 2015 on Genius.com\n\nThe song presents a self reflection by Posner on how, his fame having long since faded, he has been left completely empty inside and unable to feel any kind of fulfillment, causing him to attempt to fill the void with rampant hedonism and material possessions. Posner's lyrics state he took the eponymous \"pill\" to impress Avicii (real name Tim Bergling), a Swedish DJ who wrote a song with Posner called \"Stay with You\" in 2012. Bergling committed suicide in 2018 after years of struggling with drug and alcohol addiction, three years after Posner released \"I Took a Pill in Ibiza\".\n\nRegarding their remix, SeeB told Official Charts: \"We got it from Matt D'Arduini, VP A&R at Island Records. It was really slow and we only listened to the vocals on it. Matt sent us the multitrack of Mike's new EP and we picked Ibiza right away. Such a brilliant lyric and melody but it needed a new soundscape to be a hit.\"Posner has called the success of the remix version both \"ironic\" and \"beautiful\": \"I wrote this sad thing, and it was me processing some dark and heavy emotion, and now people seem to be having their own joyous memories out of my sadness. That’s a very beautiful thing as an artist.\"\n\n\"I Took a Pill in Ibiza\" by Mike Posner Orignally Released at April 14, 2015 then Remixed by SeeB at July 24, 2015. and the Music Video Released to Youtube at February 27, 2016. <a href=\"http:\/\/www.last.fm\/music\/Mike+Posner\/_\/I+Took+A+Pill+In+Ibiza+-+SeeB+Remix\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}