{
  "created_at": "2025-05-03T14:44:47.720067+00:00",
  "elapsed": 0.182535,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:44:47.720067+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "10732",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:44:48 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Linkin+Park&format=json&method=track.getInfo&track=What+I%27ve+Done"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Linkin+Park&format=json&method=track.getInfo&track=What+I%27ve+Done",
  "_decoded_content": {
    "track": {
      "name": "What I've Done",
      "mbid": "d950932a-ee02-4062-9788-a38886d199a6",
      "url": "https:\/\/www.last.fm\/music\/Linkin+Park\/_\/What+I%27ve+Done",
      "duration": "205000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "1669737",
      "playcount": "16342432",
      "artist": {
        "name": "Linkin Park",
        "mbid": "f59c5520-5f46-4d2c-b2c4-822eabf53419",
        "url": "https:\/\/www.last.fm\/music\/Linkin+Park"
      },
      "album": {
        "artist": "Linkin Park",
        "title": "Minutes to Midnight",
        "mbid": "d08a98b7-0c33-40d6-b574-ff0ce1600af7",
        "url": "https:\/\/www.last.fm\/music\/Linkin+Park\/Minutes+to+Midnight",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/185a38ca7368d2c9ad9cb9ea95ae05f4.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/185a38ca7368d2c9ad9cb9ea95ae05f4.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/185a38ca7368d2c9ad9cb9ea95ae05f4.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/185a38ca7368d2c9ad9cb9ea95ae05f4.png",
            "size": "extralarge"
          }
        ],
        "@attr": {
          "position": "6"
        }
      },
      "toptags": {
        "tag": [
          {
            "name": "rock",
            "url": "https:\/\/www.last.fm\/tag\/rock"
          },
          {
            "name": "Linkin Park",
            "url": "https:\/\/www.last.fm\/tag\/Linkin+Park"
          },
          {
            "name": "alternative rock",
            "url": "https:\/\/www.last.fm\/tag\/alternative+rock"
          },
          {
            "name": "Nu Metal",
            "url": "https:\/\/www.last.fm\/tag\/Nu+Metal"
          },
          {
            "name": "alternative",
            "url": "https:\/\/www.last.fm\/tag\/alternative"
          }
        ]
      },
      "wiki": {
        "published": "15 Sep 2008, 16:40",
        "summary": "\"What I've Done\" is a song by American rock band Linkin Park. It was released as the first single from their third studio album Minutes to Midnight, and is the sixth track. The song is composed in the key of G minor. The song was released as a radio single on April 1, 2007, as a digital download on April 2, and as a CD single on April 30. The live version of \"What I've Done\" from Road to Revolution: Live at Milton Keynes was nominated for Best Hard Rock Performance at the 52nd Grammy Awards, but did not win. <a href=\"http:\/\/www.last.fm\/music\/Linkin+Park\/_\/What+I%27ve+Done\">Read more on Last.fm<\/a>.",
        "content": "\"What I've Done\" is a song by American rock band Linkin Park. It was released as the first single from their third studio album Minutes to Midnight, and is the sixth track. The song is composed in the key of G minor. The song was released as a radio single on April 1, 2007, as a digital download on April 2, and as a CD single on April 30. The live version of \"What I've Done\" from Road to Revolution: Live at Milton Keynes was nominated for Best Hard Rock Performance at the 52nd Grammy Awards, but did not win. It also serves as the main theme of the 2007 science fiction film Transformers and also appears in Transformers: The Album. Being certified five times platinum by the RIAA, it is the band's most commercially successful song, though not necessarily the most well-known, due to the fact that singles in the US used to have higher sales in general during the second half of the 2000s.\n\n\n\"What I've Done\" was featured in the video game Guitar Hero World Tour. In January 2011, it was released in a Linkin Park DLC pack for Rock Band 3. The song is also a B-side to the UK single of \"Iridescent\". An instrumental version of the song is currently used by Sky UK as background music for their interactive services.\n\nChester Bennington described the track in a March 2007 interview with MTV:\n\nJoe [Hahn] came up to Mike and me and asked us to take the whole idea of Minutes to Midnight and apply that to how the band has changed. So, in a way, it's us saying goodbye to how we used to be...The lyrics in the first verse are 'In this farewell, there's no blood, there's no alibi,' and right away, you'll notice that the band sounds different: The drums are much more raw, the guitars are more raw and the vocals aren't tripled. It's just us out there .... and that's how Rick Rubin wanted it.\n\nThe single and video appeared in the iTunes Store shortly after midnight EST on April 2, 2007. It became available the day after on iTunes in the UK and Australia. On April 2, the song was featured streaming on the front page of their official website, with the video being added to the site shortly thereafter.\n\n\nThe song starts out with a short 3-second guitar part and then a piano motif, before adding a hip hop-inspired drum line, and then introducing a raw-sounding guitar riff. When the song is played live at Linkin Park's concerts, Mike Shinoda plays the piano intro and the guitar after that. This song differs from most of Linkin Park's songs from previous albums in that it features almost no lead vocals from vocalist Mike Shinoda, with the exception of a brief \"na na na\" refrain at the end. \"What I've Done\" was the last song written for Minutes to Midnight. The song also has a downbeat exactly once every second, consistent throughout its entirety.\n\nMike Shinoda created a remix of the song, which is called \"What I've Done (Distorted Remix)\", which is included as a b-side to \"Bleed It Out\". The remix was then included in the international tour edition of Minutes to Midnight, as well as a track in the Linkin Park Underground-exclusive CD Underground X: Demos.\n\n\nMusic video\nThe music video for \"What I've Done\" was filmed in the California desert and was directed by Linkin Park turntablist Joe Hahn. It features footage of the band performing in an area outside of the city, interspersed with footage showing many political movements and humanitarian issues including pollution, racism, Nazism, the Ku Klux Klan, abortion, terrorism, Holocaust, deforestation, poverty, drug addiction, obesity, destruction, rising gasoline prices and crimes committed by humanity. Some cutscenes, such as the traffic scene and the napalm exploding, were also featured on the Rise Against music video for \"Ready to Fall\". The video premiered on April 2, 2007 on MTV and Fuse. It premiered on MTV Asia, MTV Germany, TMF Netherlands and Canada's MuchMusic on April 3, 2007.\n\nThe video starts off with some grass sinking down into the dirt, causing it to turn wet. It then cuts to a scorpion walking to where Linkin Park are performing. It explores the many ironies of humanity and its ill-effects on the earth and the environment (see above). It juxtaposes various pieces of footage: a large, well-fed man eating fast food, a woman measuring her waist and a man who is so malnourished that his ribcage is visible through his skin; African Americans being hosed down by the Ku Klux Klan; nuclear explosions, the World Trade Center collapsing as a result of the September 11 attacks, children waving American flags (one of the children being Brad Delson), a Middle Eastern child holding an AK-47, clips of oil tankers torn in half and birds covered in an oil slick. It also features Communist leaders Fidel Castro, Joseph Stalin & Mao Zedong. The video ends with the same clip from the beginning, but played in reverse, where it has the grass re-growing.\n\nThe video clip was featured and won on MTV's Battle of the Videos against videos by Evanescence (\"Sweet Sacrifice\") and Lil' Mama (\"Lip Gloss\"). The video also marks the first appearance of a Linkin Park video in the #1 spot on MTV's TRL, hitting #1 six times so far. The video has over 444 million views on YouTube as of March 2020. AOL currently has a live performance of \"What I've Done\" on their website. MTV's James Montgomery called \"What I've Done\" the \"biggest, baddest and best Linkin Park video of all time,\" praising the visuals as well as the numerous political figures and events occurring within the video. He summarized the video's message: \"Hahn was smart — or brave — enough to inject a message here: the destructive power of man versus the unyielding beauty of nature, and where it all will undoubtedly end (hint: we lose).\"\n\nAs mentioned in episode 89 of MTV Cribs, Chester's jacket was lent to him by Yellowcard frontman Ryan Key.\n\n\nAlternate music video\nA second video, made exclusively for Australia, features a considerably different scenario from the first; instead of clips of human sin and the grass sinking clip, the video tells the story of a woman (played by Emma Mullings) working at a government-run pharmaceutical company learning of a plan to develop a deadly new virus for \"social control\", and – with the help of several people dressed in black hooded sweatshirts with Linkin Park's logo on them – smuggles out several blood samples of a human test subject of the virus to expose the conspiracy. The video can be seen on YouTube and Linkin Park's Australian website.\n\n\nCommercial performance\nDespite Minutes To Midnight having mixed responses, the song made big debuts on the US charts during the chart week of April 21, 2007. The song debuted in the top 10 of the US Hot 100 on April 10, 2007, at #7. It is the band's second highest debut to date on the chart (this title was previously held by \"Somewhere I Belong\" which opened at #47), earning \"Hot Shot\" debut of the week, and subsequently becoming the third highest position for a Linkin Park single to date on the Hot 100. The song was their highest debut until they released \"New Divide\" in May 2009. At the time of its debut it was only the eleventh song since 2000 to debut at #7 or higher on the Hot 100, and only the third song to do so by an artist not from American Idol. The song was partly fueled by digital sales, debuting at #4 on the digital chart. The song was certified 2×Platinum by the RIAA on November 13, 2008. It reached 3 million downloads by early 2011, making it their most successful digital song in the US.  As of January 2015, the song has sold 3,700,000 copies in the US.\n\nIn addition the song became only the third song ever to open at #1 on the Modern Rock chart, also becoming the band's seventh number one on the chart. It held the #1 spot on Alternative Songs for 15 consecutive weeks, at the time tying it with Marcy Playground's \"Sex and Candy\" The song also reached #1 on the Mainstream Rock chart, where it stayed for 8 consecutive weeks. In the iTunes music store, the song had reached number two. It was kept out of the top spot by \"Give It to Me\" by Timbaland. The music video is the first to reach the number 1 spot on TRL for Linkin Park video history. It has also become a moderate hit on the Adult Top 40, and Pop 100 Airplay charts, peaking at number 21 and 17 respectively on those charts.\n\nThe song hit #6 in the UK once the physical format was released, making it Linkin Park's highest-charting UK single. <a href=\"http:\/\/www.last.fm\/music\/Linkin+Park\/_\/What+I%27ve+Done\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}