{
  "created_at": "2025-05-03T14:38:26.197523+00:00",
  "elapsed": 0.23402,
  "encoding": "utf-8",
  "expires": "2025-05-04T14:38:26.197523+00:00",
  "headers": {
    "Access-Control-Allow-Methods": "POST, GET, OPTIONS",
    "Access-Control-Allow-Origin": "*",
    "Access-Control-Max-Age": "86400",
    "Alt-Svc": "h3=\":443\"; ma=2592000,h3-29=\":443\"; ma=2592000",
    "Content-Length": "5301",
    "Content-Type": "application\/json",
    "Date": "Sat, 03 May 2025 14:38:26 GMT",
    "Server": "openresty\/1.13.6.2",
    "Via": "1.1 google"
  },
  "reason": "OK",
  "request": {
    "body": "",
    "headers": {
      "Accept": "*\/*",
      "Accept-Encoding": "gzip, deflate, br, zstd",
      "Connection": "keep-alive",
      "User-Agent": "python-requests\/2.31.0"
    },
    "method": "GET",
    "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Shakira&format=json&method=track.getInfo&track=Monoton%C3%ADa"
  },
  "status_code": 200,
  "url": "https:\/\/ws.audioscrobbler.com\/2.0\/?api_key=REDACTED&artist=Shakira&format=json&method=track.getInfo&track=Monoton%C3%ADa",
  "_decoded_content": {
    "track": {
      "name": "Monotonía",
      "url": "https:\/\/www.last.fm\/music\/Shakira\/_\/Monoton%C3%ADa",
      "duration": "161000",
      "streamable": {
        "#text": "0",
        "fulltrack": "0"
      },
      "listeners": "160798",
      "playcount": "1301737",
      "artist": {
        "name": "Shakira",
        "mbid": "bf24ca37-25f4-4e34-9aec-460b94364cfc",
        "url": "https:\/\/www.last.fm\/music\/Shakira"
      },
      "album": {
        "artist": "Shakira",
        "title": "MONOTONÍA",
        "url": "https:\/\/www.last.fm\/music\/Shakira\/MONOTON%C3%8DA",
        "image": [
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/34s\/31a0e2a6a106f9160c716629415c58a8.png",
            "size": "small"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/64s\/31a0e2a6a106f9160c716629415c58a8.png",
            "size": "medium"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/174s\/31a0e2a6a106f9160c716629415c58a8.png",
            "size": "large"
          },
          {
            "#text": "https:\/\/lastfm.freetls.fastly.net\/i\/u\/300x300\/31a0e2a6a106f9160c716629415c58a8.png",
            "size": "extralarge"
          }
        ]
      },
      "toptags": {
        "tag": [
          {
            "name": "bachata",
            "url": "https:\/\/www.last.fm\/tag\/bachata"
          },
          {
            "name": "spanish",
            "url": "https:\/\/www.last.fm\/tag\/spanish"
          },
          {
            "name": "latin",
            "url": "https:\/\/www.last.fm\/tag\/latin"
          },
          {
            "name": "Shakira",
            "url": "https:\/\/www.last.fm\/tag\/Shakira"
          },
          {
            "name": "monotonia",
            "url": "https:\/\/www.last.fm\/tag\/monotonia"
          }
        ]
      },
      "wiki": {
        "published": "18 Oct 2022, 04:44",
        "summary": "\"Monotonía\" (English: \"Monotony\") is a song by Colombian singer-songwriter Shakira and Puerto Rican singer Ozuna. The song was released on 19 October 2022 as the second single from Shakira's upcoming twelfth studio album. The song follows Shakira's previous single \"Te Felicito\" from April 2022.\n\nBackground and release\nOn 6 October 2022, Shakira began posting on her social media cryptic videos teasing new music. The first stating \"No fue culpa tuya. <a href=\"http:\/\/www.last.fm\/music\/Shakira\/_\/Monoton%C3%ADa\">Read more on Last.fm<\/a>.",
        "content": "\"Monotonía\" (English: \"Monotony\") is a song by Colombian singer-songwriter Shakira and Puerto Rican singer Ozuna. The song was released on 19 October 2022 as the second single from Shakira's upcoming twelfth studio album. The song follows Shakira's previous single \"Te Felicito\" from April 2022.\n\nBackground and release\nOn 6 October 2022, Shakira began posting on her social media cryptic videos teasing new music. The first stating \"No fue culpa tuya...\" (\"It wasn't your fault\"). The following day Shakira posted a follow-up video that said \"Ni tampoco mía\" (\"Nor mine\"). The final video of these teasers said \"Fue culpa de la monotonía\" (\"It's monotony's fault\"). After these tweets, Shakira then posted a teaser to the songs music video of someone stepping on a heart.\n\nThe single which was announced on 9 October 2022 and was released on 19 October 2022.[5] The song is a Bachata genre track and is meant to be part of Shakira's forthcoming album.[6] The song was her first release since she announced her breakup with Gerard Piqué and quickly got attention with the video surpassing 14 million views in just 10 hours.[7] The video shows several different references to Shakira's relationship with Piqué from how she felt heartbroken to how she is moving on from it.\n\nMusic video\nThe official music video was filmed on 10 and 11 September 2022 in Manresa. It was released along with the song on 19 October 2022. It was co-directed by Shakira and long-time collaborator Jaume de Laiguana.\n\nThe video starts with a depressed-looking Shakira walking through a grocery store while eating chips with her previous single \"Te Felicito\" playing in the background. Shakira then runs into what is presumed to be her ex-lover and starts crying while singing the first chorus of the song. As she starts backing away, the ex-lover pulls out a cannon that shoots Shakira in the chest blasting her heart out onto the floor. As Shakira lies unconscious in a pool of blood on the floor, Ozuna starts singing the chorus of the song while looking down at her. Shakira then regains consciousness and crawls on the floor picking up her beating heart with a hole in her chest. The video then transitions into a public area where Shakira is trembling and then running through a sidewalk with her heart in her hand. As Shakira keeps accidentally bumping into people, she then drops her heart while watching others step on it. Shakira then picks up her heart as she sings the chorus. The video then transitions into its final seen where Shakira walks into a room full of locked away items. Ozuna opens a metal box for Shakira so she can lock her heart away. As Ozuna locks Shakira's heart away, Shakira turns to walk out with a smile.\n\nReception\nGlobally, the music video for the song reached over 20 million views on YouTube within its first 24 hours of its release, making it the biggest Spanish-language debut on YouTube in 2022 and became the most-viewed Latin video on its release day by a female artist in the history of YouTube. It also debuted at #1 on the weekly Global YouTube Music Videos Chart with 23.6 million views from a partial week of tracking. It received another 43.4 million views during the October 21–27 tracking period. The count topped its first week's mark by 84%. <a href=\"http:\/\/www.last.fm\/music\/Shakira\/_\/Monoton%C3%ADa\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
      }
    }
  }
}